{
  "updated_at": "2025-09-02T07:13:26.035Z",
  "clusters": [
    {
      "id": "cluster_1",
      "coverage": 4,
      "updated_at": "Tue, 02 Sep 2025 17:10:59 +1000",
      "title": "Australia news LIVE: Neo-Nazi Thomas Sewell arrested outside Melbourne court; Migrant program to remain unchanged following mass protests, says Burke",
      "neutral_headline": "Neo-Nazi Arrested, Protests and Court Cases in Australia",
      "bullet_summary": [
        "Faruqi said anti-immigration rallies over the weekend should be a 'wake-up call', and accused other politicians of having downplayed or fuelled racism",
        "The senator also read out some of the abusive and violent letters that she said she receives weekly"
      ],
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/australia-news-live-more-than-800-killed-in-afghanistan-earthquake-trump-to-award-presidential-medial-of-freedom-to-giuliani-20250902-p5mrn8.html",
          "published_at": "Tue, 02 Sep 2025 17:10:59 +1000",
          "title": "Australia news LIVE: Neo-Nazi Thomas Sewell arrested outside Melbourne court; Migrant program to remain unchanged following mass protests, says Burke",
          "standfirst": "Follow live as we bring you the news from Australia and beyond.",
          "content": "Follow live as we bring you the news from Australia and beyond.",
          "feed_position": 1,
          "image_url": "https://static.ffx.io/images/$zoom_0.3116%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_314%2C$y_0/t_crop_custom/q_86%2Cf_auto/460d5261e501dcfb203ab57a8592032640c58155"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
          "published_at": "Tue, 02 Sep 2025 07:09:43 GMT",
          "title": "Australia news live: neo-Nazi Thomas Sewell arrested outside Melbourne court after crashing Jacinta Allan press conference",
          "standfirst": "Follow today’s news liveJacinta Allan says she is not afraid of neo-Nazi ‘goons’ after press conference gatecrashedGet our breaking news email, free app or daily news podcastRallies ‘deeply unsettling for many Australians’: Mark ButlerMark Butler is continuing his media rounds and has moved across to ABC News Breakfast.I think these rallies were deeply unsettling for many Australians. For most Australians who saw from that rally, a message of division, intolerance and in some cases, violence - including violence against police.I think what we want to do from a federal government [point of view] is just reinforce the importance of social cohesion – the importance of us being a really successful multicultural community with all of the benefits.These new, evolving, technologies require and a new, proactive, approach to harm prevention– and we’ll work closely with industry to achieve this.While this move won’t eliminate the problem of abusive technology in one fell swoop, alongside existing laws and our world-leading online safety reforms, it will make a real difference in protecting Australians. Continue reading...",
          "content": "Follow today’s news liveJacinta Allan says she is not afraid of neo-Nazi ‘goons’ after press conference gatecrashedGet our breaking news email, free app or daily news podcastRallies ‘deeply unsettling for many Australians’: Mark ButlerMark Butler is continuing his media rounds and has moved across to ABC News Breakfast.I think these rallies were deeply unsettling for many Australians. For most Australians who saw from that rally, a message of division, intolerance and in some cases, violence - including violence against police.I think what we want to do from a federal government [point of view] is just reinforce the importance of social cohesion – the importance of us being a really successful multicultural community with all of the benefits.These new, evolving, technologies require and a new, proactive, approach to harm prevention– and we’ll work closely with industry to achieve this.While this move won’t eliminate the problem of abusive technology in one fell swoop, alongside existing laws and our world-leading online safety reforms, it will make a real difference in protecting Australians. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/thomas-sewell-is-arrested-outside-melbourne-magistrates-court-on-tuesday-20250902-p5mrvz.html",
          "published_at": "Tue, 02 Sep 2025 17:02:44 +1000",
          "title": "Thomas Sewell is arrested outside Melbourne Magistrates' Court on Tuesday",
          "standfirst": "Prominent Neo-Nazi Thomas Sewell has been arrested outside a Melbourne court after his group attacked an Indigenous encampment on Sunday.",
          "content": "Prominent Neo-Nazi Thomas Sewell has been arrested outside a Melbourne court after his group attacked an Indigenous encampment on Sunday.",
          "feed_position": 3,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/67f9dbd6771296e140a3ae3345e0fc7ac0e46048"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/politics/nsw/pro-palestine-protesters-allegedly-assaulted-on-sydney-train-20250902-p5mruw.html",
          "published_at": "Tue, 02 Sep 2025 17:00:29 +1000",
          "title": "Pro-Palestine protesters allegedly assaulted on Sydney train",
          "standfirst": "Two brothers allege they were told “we don’t want you in our country” and physically assaulted by a group after Sunday’s pro-Palestine and anti-immigration protests.",
          "content": "Two brothers allege they were told “we don’t want you in our country” and physically assaulted by a group after Sunday’s pro-Palestine and anti-immigration protests.",
          "feed_position": 5,
          "image_url": "https://static.ffx.io/images/$zoom_0.44350000000000006%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_111/t_crop_custom/q_86%2Cf_auto/0f73c26e2de384d061dfe307bc539c29c22108d9"
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/nsw/police-investigating-alleged-assault-of-palestinian-men-on-sydney-train-20250902-p5mrvy.html",
          "published_at": "Tue, 02 Sep 2025 16:57:14 +1000",
          "title": "Police investigating alleged assault of Palestinian men on Sydney train",
          "standfirst": "Two Palestinian brothers claim they were the victims of a racially motivated hate crime when they were allegedly assaulted on the way home from a pro-Palestinian rally in Sydney on Sunday.",
          "content": "Two Palestinian brothers claim they were the victims of a racially motivated hate crime when they were allegedly assaulted on the way home from a pro-Palestinian rally in Sydney on Sunday.",
          "feed_position": 7,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/f7f7c4dab0e872fffee2a4f254032f42aac65324"
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb",
          "published_at": "Tue, 02 Sep 2025 06:52:58 GMT",
          "title": "Neo-Nazi Thomas Sewell arrested outside Melbourne court hours after confronting Victorian premier at press conference",
          "standfirst": "Sewell’s arrest comes after neo-Nazis attacked Camp Sovereignty, an Indigenous protest site, on Sunday Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastNeo-Nazi Thomas Sewell has been arrested outside a Melbourne court just hours after he confronted the Victorian premier, Jacinta Allan, at a press conference.Footage shows a large group of police and protective services officers handcuffing Sewell and an associate outside Melbourne’s magistrates court on Tuesday afternoon. Continue reading...",
          "content": "Sewell’s arrest comes after neo-Nazis attacked Camp Sovereignty, an Indigenous protest site, on Sunday Follow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastNeo-Nazi Thomas Sewell has been arrested outside a Melbourne court just hours after he confronted the Victorian premier, Jacinta Allan, at a press conference.Footage shows a large group of police and protective services officers handcuffing Sewell and an associate outside Melbourne’s magistrates court on Tuesday afternoon. Continue reading...",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/sep/02/bob-katter-distances-himself-from-neo-nazi-group-associated-with-megaphone-at-anti-immigration-protest-ntwnfb",
          "published_at": "Tue, 02 Sep 2025 06:46:25 GMT",
          "title": "Bob Katter distances himself from neo-Nazi group associated with megaphone at anti-immigration protest",
          "standfirst": "Separately, Greens call on Queensland MP to ‘apologise or resign’ for verbal altercation with Channel Nine reporter last weekFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastFederal MP Bob Katter has distanced himself from a neo-Nazi group that claimed ownership of a megaphone he used at a Townsville rally against mass immigration, with the veteran politician claiming he has been the victim of “bullying” in the media.The Greens have separately called on Katter, the member for Kennedy, to “apologise or resign” over his verbal altercation with a Channel Nine reporter last week, asking the Independent Parliamentary Standards Commission to investigate his conduct. Continue reading...",
          "content": "Separately, Greens call on Queensland MP to ‘apologise or resign’ for verbal altercation with Channel Nine reporter last weekFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastFederal MP Bob Katter has distanced himself from a neo-Nazi group that claimed ownership of a megaphone he used at a Townsville rally against mass immigration, with the veteran politician claiming he has been the victim of “bullying” in the media.The Greens have separately called on Katter, the member for Kennedy, to “apologise or resign” over his verbal altercation with a Channel Nine reporter last week, asking the Independent Parliamentary Standards Commission to investigate his conduct. Continue reading...",
          "feed_position": 2
        },
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/neo-nazi-thomas-sewell-arrested-outside-court-20250902-p5mrvp.html",
          "published_at": "Tue, 02 Sep 2025 16:39:36 +1000",
          "title": "Neo-Nazi Thomas Sewell arrested outside court",
          "standfirst": "Self-proclaimed neo-Nazi Thomas Sewell has been arrested outside court in Melbourne.",
          "content": "Self-proclaimed neo-Nazi Thomas Sewell has been arrested outside court in Melbourne.",
          "feed_position": 12,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/dd167148812f42e6025402ced85ed8c48ea20b90"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/thomas-sewell-neo-nazi-interrupts-jacinta-allan-press-conference-melbourne/a2feab0e-4e9e-4c72-8d71-97905bec22af",
          "published_at": "Tue, 02 Sep 2025 06:21:26 +0000",
          "title": "Neo-Nazi arrested outside court hours after crashing media conference",
          "standfirst": "The Victorian premier has hit back after copping an expletive laden tirade from neo-Nazi leader Thomas Sewell.",
          "content": "Self-proclaimed neo-Nazi Thomas Sewell has been arrested outside a Melbourne court hours after he crashed Victorian Premier Jacinta Allan&#x27;s press conference.Sewell was taken into custody out the front of Melbourne Magistrates&#x27; Court, where he was representing himself on a number of charges, including intimidating a police officer, following Sunday&#x27;s anti-immigration march.Exclusive 9News vision shows Sewell being arrested by several police officers about 3.20pm.READ MORE: Police descend on accused gunman Dezi Freeman&#x27;s propertyVictoria Police confirmed that detectives from the Melbourne Crime Investigation Unit attended Melbourne Magistrates Court about 3.20pm and arrested three men.\"Officers arrested a 32-year-old man from Balwyn, a 23-year-old man from Mooroolbark and a 20-year-old man from Ardeer,\" a spokesperson said.\"They are being interviewed in relation to an ongoing investigation into alleged assaults in King&#x27;s Domain about 5pm on 31 August.\"No charges relating to the arrest have been made yet.9News understands today&#x27;s arrest is in relation to an incident on Sunday where white supremacists stormed a First Nations camp.Sewell&#x27;s arrest comes hours after he gatecrashed Allan&#x27;s press conference, where he yelled at the premier over his right to protest.Allan was with Treasurer Jaclyn Symes in North Melbourne when Sewell arrived.\"Why don&#x27;t Australians have the right to protest?\" Sewell could be heard saying.READ MORE: &#x27;Gutless&#x27; attack by neo-Nazis on sacred Indigenous site slammed\"Why do you want to ban us from protesting? Shouldn&#x27;t we have the right to speak in our own country?\" Sewell was held back by security as Allan and Symes quickly left.Sewell was heard telling security, \"You don&#x27;t have the right to put your hands on me\".READ MORE: Fears the country&#x27;s most wanted man is &#x27;getting help&#x27;\"We&#x27;re going to take this country back from politicians like you,\" he said to Allan.Sewell left the scene after Allan, walking away on foot.\"Victoria Police is aware of an incident at a media stand-up in North Melbourne this morning where a man attended and was verbally abusive towards the premier,\" a police spokesperson said.\"The premier&#x27;s security team intervened to ensure the safety of everyone present and the man left shortly after.\"Allan also issued a statement, saying she was \"unharmed and undeterred\".She said it was a \"badge of honour\" to earn the ire of Nazis.\"But this isn&#x27;t about me. It&#x27;s about all the other people in the community who Nazis target - like multicultural people, LGBTIQA+ people, First Peoples, and Jews,\" she said in the written statement.\"They&#x27;re the Victorians who are on my mind right now, and they&#x27;re the Victorians who our anti-hate laws will protect when they come into force later this month.\"The new legislation will strengthen Victoria&#x27;s existing vilification laws, and make it a criminal offence to incite hate or threaten harm based on a protected attribute.\"We know how these goons operate. They whip up fear to divide our society. They will fail,\" Allan said of Sewell.\"Because Victorians are fair, and our values are strong.\"The New Zealand-born white nationalist figure recently made a speech to the crowd at the anti-immigration March For Australia rally in Melbourne on Sunday.In his tirade at the press conference, Sewell also incorrectly claimed 50,000 people attended that rally.On Sunday, he was also seen in a crowd that allegedly attacked an Indigenous encampment, Camp Sovereignty, after splitting off from the main rally.Police are investigating the incident, which Police Minister Andrew Carbines labelled \"gutless\".DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 0,
          "image_url": "https://prod.static9.net.au/fs/b36b582b-875e-4e66-9978-5bd4f1eb3e62"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/thomas-sewell-arrested-court-camp-sovereignty-jacinta-allan/105726392",
          "published_at": "Tue, 02 Sep 2025 06:21:24 +0000",
          "title": "Breaking: Neo-nazi leader Thomas Sewell arrested outside Melbourne court",
          "standfirst": "Earlier today, Thomas Sewell gatecrashed a press conference by the Victorian premier, while vision from Sunday showed he was among a group of far-right demonstrators who attacked a First Nations protest camp.",
          "content": "Earlier today, Thomas Sewell gatecrashed a press conference by the Victorian premier, while vision from Sunday showed he was among a group of far-right demonstrators who attacked a First Nations protest camp.",
          "feed_position": 1
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/sep/02/palestinian-australian-brothers-shamikh-majed-badra-alleged-attack-sydney-train",
          "published_at": "Tue, 02 Sep 2025 03:12:19 GMT",
          "title": "Palestinian Australian brothers allege racist abuse on Sydney train",
          "standfirst": "Shamikh and Majed Badra said men shouted abuse at them, allegedly because Majed was wearing a keffiyehFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTwo Palestinian Australian men say they were subjected to racist abuse on a Sydney train on the same day anti-immigration marches took place across Australian cities.Film-makers Shamikh and Majed Badra told Guardian Australia they were verbally abused on a train on Sunday afternoon, allegedly because Majed was wearing a keffiyeh. Continue reading...",
          "content": "Shamikh and Majed Badra said men shouted abuse at them, allegedly because Majed was wearing a keffiyehFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastTwo Palestinian Australian men say they were subjected to racist abuse on a Sydney train on the same day anti-immigration marches took place across Australian cities.Film-makers Shamikh and Majed Badra told Guardian Australia they were verbally abused on a train on Sunday afternoon, allegedly because Majed was wearing a keffiyeh. Continue reading...",
          "feed_position": 4
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/sep/02/labor-backlash-plans-limit-access-to-government-information",
          "published_at": "Tue, 02 Sep 2025 01:20:12 GMT",
          "title": "Labor facing backlash over plans to curb access to government information",
          "standfirst": "Changes announced by Michelle Rowland include new charges for FoI requests as well as tougher rules related to cabinet confidentialityFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastLabor is facing a backlash over plans to dramatically curb access to government documents under freedom of information rules, with the Coalition and crossbench signalling proposed changes will struggle to pass parliament.The attorney general, Michelle Rowland, has announced the biggest changes to transparency rules in more than a decade, including new charges for freedom of information requests to government departments and ministers, as well as tougher rules related to cabinet confidentiality. Continue reading...",
          "content": "Changes announced by Michelle Rowland include new charges for FoI requests as well as tougher rules related to cabinet confidentialityFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastLabor is facing a backlash over plans to dramatically curb access to government documents under freedom of information rules, with the Coalition and crossbench signalling proposed changes will struggle to pass parliament.The attorney general, Michelle Rowland, has announced the biggest changes to transparency rules in more than a decade, including new charges for freedom of information requests to government departments and ministers, as well as tougher rules related to cabinet confidentiality. Continue reading...",
          "feed_position": 5
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/2025/sep/02/labor-in-home-aged-care-funding-greens-crossbench-coalition",
          "published_at": "Mon, 01 Sep 2025 15:00:12 GMT",
          "title": "Labor under pressure to release immediate in-home aged care funding as opposition and crossbench senators unite",
          "standfirst": "Amendments to front-load new Support at Home system expected to be voted on this week, after inquiry told more than 121,000 people waiting on assessmentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastLabor could be forced to bring on immediate funding for new in-home aged care services as the Coalition, Greens and crossbench MPs team up in the Senate, angry the government has refused to address growing shortages before a new system begins in November.Delays in aged care services dominated federal parliament on Monday, with the Coalition using all of its questions in the House of Representatives and the Senate to press Labor over community frustration. Continue reading...",
          "content": "Amendments to front-load new Support at Home system expected to be voted on this week, after inquiry told more than 121,000 people waiting on assessmentsFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastLabor could be forced to bring on immediate funding for new in-home aged care services as the Coalition, Greens and crossbench MPs team up in the Senate, angry the government has refused to address growing shortages before a new system begins in November.Delays in aged care services dominated federal parliament on Monday, with the Coalition using all of its questions in the House of Representatives and the Senate to press Labor over community frustration. Continue reading...",
          "feed_position": 7
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/technology/2025/sep/02/under-16s-ban-how-hard-will-it-be-for-australian-social-media-users-to-prove-their-age",
          "published_at": "Mon, 01 Sep 2025 15:00:11 GMT",
          "title": "Not just under-16s: all Australian social media users will need to prove their age – and it could be complicated",
          "standfirst": "The age assurance technology trial found errors are inevitable – meaning users might have to provide other ID or appeal against wrongful bansFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIt could take just 40 seconds: that’s how long Australians might have to wait for age assurance technology to assess they’re allowed to be on social media from December, when the under-16s ban comes into effect.But the reality is, for many users, it could be a much more complicated and time-consuming process. Continue reading...",
          "content": "The age assurance technology trial found errors are inevitable – meaning users might have to provide other ID or appeal against wrongful bansFollow our Australia news live blog for latest updatesGet our breaking news email, free app or daily news podcastIt could take just 40 seconds: that’s how long Australians might have to wait for age assurance technology to assess they’re allowed to be on social media from December, when the under-16s ban comes into effect.But the reality is, for many users, it could be a much more complicated and time-consuming process. Continue reading...",
          "feed_position": 8
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/sep/01/faruqi-on-march-for-australia-racism-has-been-legitimised-by-media-and-politicians-video-ntwnfb",
          "published_at": "Mon, 01 Sep 2025 05:43:36 GMT",
          "title": "Faruqi on March for Australia: racism has been 'legitimised' by media and politicians – video",
          "standfirst": "Speaking in the Senate while moving a motion for debate on social cohesion, Greens senator Mehreen Faruqi said the far right had been 'emboldened' and was now 'on the move', saying racism has been 'legitimised' and 'normalised' by media and politicians. Faruqi said anti-immigration rallies over the weekend should be a 'wake-up call', and accused other politicians of having downplayed or fuelled racism. The senator also read out some of the abusive and violent letters that she said she receives weekly. 'Migrants like me have been told repeatedly to put up, shut up or go back to where I come from,' Faruqi saidNeo-Nazis and politicians among protesters at anti-immigration March for Australia rallies Continue reading...",
          "content": "Speaking in the Senate while moving a motion for debate on social cohesion, Greens senator Mehreen Faruqi said the far right had been 'emboldened' and was now 'on the move', saying racism has been 'legitimised' and 'normalised' by media and politicians. Faruqi said anti-immigration rallies over the weekend should be a 'wake-up call', and accused other politicians of having downplayed or fuelled racism. The senator also read out some of the abusive and violent letters that she said she receives weekly. 'Migrants like me have been told repeatedly to put up, shut up or go back to where I come from,' Faruqi saidNeo-Nazis and politicians among protesters at anti-immigration March for Australia rallies Continue reading...",
          "feed_position": 14
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/sep/01/march-for-australia-anti-immigration-demonstrators-clash-with-counter-protest-in-melbourne-video-ntwnfb",
          "published_at": "Mon, 01 Sep 2025 04:42:01 GMT",
          "title": "March for Australia anti-immigration demonstrators clash with counter-protest in Melbourne – video",
          "standfirst": "Protesters who gathered under the March for Australia banner clashed with a counter-protest that formed from the weekly pro-Palestine rally merging with an antifascist counter-demonstration in Melbourne. Police used pepper spray as they tried to keep the groups seperate ► Subscribe to Guardian Australia on YouTubeNeo-Nazis and politicians among protesters at anti-immigration March for Australia ralliesNeo-Nazis attack Indigenous protest site after anti-immigration rally in Melbourne as officer allegedly assaulted in Sydney Continue reading...",
          "content": "Protesters who gathered under the March for Australia banner clashed with a counter-protest that formed from the weekly pro-Palestine rally merging with an antifascist counter-demonstration in Melbourne. Police used pepper spray as they tried to keep the groups seperate ► Subscribe to Guardian Australia on YouTubeNeo-Nazis and politicians among protesters at anti-immigration March for Australia ralliesNeo-Nazis attack Indigenous protest site after anti-immigration rally in Melbourne as officer allegedly assaulted in Sydney Continue reading...",
          "feed_position": 15
        },
        {
          "source": "Guardian Australia",
          "url": "https://www.theguardian.com/australia-news/video/2025/sep/01/far-right-group-rushes-indigenous-camp-sovereignty-site-after-anti-immigration-march-video-ntwnfb",
          "published_at": "Mon, 01 Sep 2025 04:37:43 GMT",
          "title": "Far-right group rushes Indigenous Camp Sovereignty site after anti-immigration march – video",
          "standfirst": "Footage shows at least 50 men, including neo-Nazi Thomas Sewell, in clashes at the standing First Nations protest site Camp Sovereignty in Melbourne's Kings Domain on Sunday evening. Four people required medical attention and two were taken to hospital with severe head injuries, one with a deep gash to their head, the camp said in a statement► Subscribe to Guardian Australia on YouTubeNeo-Nazis attack Indigenous protest site after anti-immigration rally in Melbourne as officer allegedly assaulted in Sydney Continue reading...",
          "content": "Footage shows at least 50 men, including neo-Nazi Thomas Sewell, in clashes at the standing First Nations protest site Camp Sovereignty in Melbourne's Kings Domain on Sunday evening. Four people required medical attention and two were taken to hospital with severe head injuries, one with a deep gash to their head, the camp said in a statement► Subscribe to Guardian Australia on YouTubeNeo-Nazis attack Indigenous protest site after anti-immigration rally in Melbourne as officer allegedly assaulted in Sydney Continue reading...",
          "feed_position": 16
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.3116%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_314%2C$y_0/t_crop_custom/q_86%2Cf_auto/460d5261e501dcfb203ab57a8592032640c58155",
      "popularity_score": 4019.9591569444447,
      "ai_summary": [
        "Neo-Nazi Thomas Sewell was arrested outside a Melbourne court.",
        "Sewell's arrest followed an attack on an Indigenous encampment.",
        "Pro-Palestine protesters were allegedly assaulted on a Sydney train.",
        "Police are investigating incidents related to protests.",
        "The government is reinforcing social cohesion in response to rallies."
      ]
    },
    {
      "id": "cluster_7",
      "coverage": 2,
      "updated_at": "Tue, 02 Sep 2025 16:46:33 +1000",
      "title": "A smiling Tony Mokbel arrives at court in a tailored suit, looking to quash convictions",
      "neutral_headline": "Tony Mokbel Appears in Court to Appeal Convictions",
      "bullet_summary": [
        "Reported by The Age, ABC News Australia"
      ],
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/victoria/a-smiling-tony-mokbel-arrives-at-court-in-a-tailored-suit-looking-to-quash-convictions-20250902-p5mro0.html",
          "published_at": "Tue, 02 Sep 2025 16:46:33 +1000",
          "title": "A smiling Tony Mokbel arrives at court in a tailored suit, looking to quash convictions",
          "standfirst": "The former drug kingpin has front court for the first time since being bailed in his bid to overturn his drug convictions.",
          "content": "The former drug kingpin has front court for the first time since being bailed in his bid to overturn his drug convictions.",
          "feed_position": 8,
          "image_url": "https://static.ffx.io/images/$zoom_0.6547228227229475%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_792%2C$y_64/t_crop_custom/q_86%2Cf_auto/18def1e3236607ecf9318ed05b1e17b2cb25ece6"
        },
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/tony-mokbel-drug-trafficking-convictions-appeal-hearing-begins/105724400",
          "published_at": "Tue, 02 Sep 2025 03:24:42 +0000",
          "title": "Tony Mokbel's appeal begins with former prosecutor in crosshairs",
          "standfirst": "Notorious drug kingpin Tony Mokbel smiles at reporters as he arrives at Victoria's Court of Appeal where he is seeking to overturn drug trafficking convictions from two decades ago.",
          "content": "Notorious drug kingpin Tony Mokbel smiles at reporters as he arrives at Victoria's Court of Appeal where he is seeking to overturn drug trafficking convictions from two decades ago.",
          "feed_position": 9
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.6547228227229475%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_792%2C$y_64/t_crop_custom/q_86%2Cf_auto/18def1e3236607ecf9318ed05b1e17b2cb25ece6",
      "popularity_score": 2019.5519347222223,
      "ai_summary": [
        "Tony Mokbel appeared in court seeking to overturn drug convictions.",
        "He is seeking to overturn drug trafficking convictions from two decades ago.",
        "Mokbel smiled at reporters upon arriving at the court.",
        "This is his first court appearance since being bailed.",
        "He was wearing a tailored suit."
      ]
    },
    {
      "id": "cluster_12",
      "coverage": 2,
      "updated_at": "Tue, 02 Sep 2025 16:39:27 +1000",
      "title": "Former prosecutor in firing line during Tony Mokbel appeal",
      "neutral_headline": "Former Prosecutor's Role Questioned in Mokbel Appeal",
      "bullet_summary": [
        "Reported by The Age, 9News"
      ],
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/former-prosecutor-in-firing-line-during-tony-mokbel-appeal-20250902-p5mrvr.html",
          "published_at": "Tue, 02 Sep 2025 16:39:27 +1000",
          "title": "Former prosecutor in firing line during Tony Mokbel appeal",
          "standfirst": "A former prosecutor had a duty to disclose barrister Nicola Gobbo was a police informer as early as June 2012, lawyers for Tony Mokbel argued.",
          "content": "A former prosecutor had a duty to disclose barrister Nicola Gobbo was a police informer as early as June 2012, lawyers for Tony Mokbel argued.",
          "feed_position": 13,
          "image_url": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/c4958e116d1a71115229701a704dc5e70a059f29"
        },
        {
          "source": "9News",
          "url": "https://www.9news.com.au/national/drug-kingpin-tony-mokbel-court-appeal-set-to-begin/27edc650-900c-463d-9df6-01bbb3f62d44",
          "published_at": "Tue, 02 Sep 2025 05:19:22 +0000",
          "title": "Prosecutor should have said lawyer was police informer, Mokbel's legal team argues",
          "standfirst": "A former director of public prosecutions had a duty to disclose barrister Nicola Gobbo was a police informer as early as June 2012, lawyers for Tony Mokbel have argued.",
          "content": "A former director of public prosecutions had a duty to disclose barrister Nicola Gobbo was a police informer as early as June 2012, lawyers for Tony Mokbel have argued.The kingpin fronted the Victorian Court of Appeal today for the first day of his long-awaited appeal against drug trafficking and importation convictions.Mokbel, who was released on bail in April, claims he suffered a miscarriage of justice because he was represented by Gobbo while she was a police informer.READ MORE: Leading genocide scholars say Israel committing genocide in GazaThe then-barrister was registered as a Victoria Police informer from 2005 to 2009 and was acting as Mokbel&#x27;s lawyer for four years before he fled to Greece in 2006.She continued to advise him when he was extradited to Melbourne in 2008.Mokbel pleaded guilty to two counts of trafficking a drug of dependence for trafficking MDMA and methamphetamine in April 2011 after striking a deal with prosecutors.He did not find out about Gobbo&#x27;s status as an informer until the High Court lifted gag orders in 2018.In pre-appeal rulings, NSW Supreme Court Justice Elizabeth Fullerton found former director of public prosecutions and current Victorian judge John Champion was told in June 2012 that Gobbo was a registered informer.Justice Fullerton was also satisfied Justice Champion knew Victoria Police held concerns about the integrity of Gobbo&#x27;s clients&#x27; convictions at the time of the June meeting.READ MORE: Australia issues travel warning for popular tourist destination amid unrestBut Justice Fullerton ruled it was only after another meeting in September 2012 that Justice Champion had an obligation to disclose Gobbo&#x27;s status to the court.Today, Mokbel&#x27;s barrister Julie Condon KC argued Justice Fullerton should have found Justice Champion breached his duty of disclosure as early as June 1, 2012.\"The director ... was obliged to at the very least notify this court that there was a pressing matter, albeit not capable of overt disclosure, that had come into his direct knowledge,\" Condon told the Court of Appeal.\"It was of such a nature that the director couldn&#x27;t sit back and do nothing - which is, in effect, what he did.\"DOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play.",
          "feed_position": 3,
          "image_url": "https://prod.static9.net.au/fs/b2e7f79e-4710-4612-b7c3-4596a412ad4e"
        }
      ],
      "featured_image": "https://static.ffx.io/images/$width_800%2C$height_450/t_crop_fill/q_86%2Cf_jpg/c4958e116d1a71115229701a704dc5e70a059f29",
      "popularity_score": 2019.433601388889,
      "ai_summary": [
        "Lawyers for Tony Mokbel argued a prosecutor had a duty.",
        "The duty was to disclose barrister Nicola Gobbo as an informer.",
        "The disclosure should have happened as early as June 2012.",
        "A former director of public prosecutions is implicated.",
        "The legal team is arguing the prosecutor's actions."
      ]
    },
    {
      "id": "cluster_20",
      "coverage": 2,
      "updated_at": "Tue, 02 Sep 2025 16:12:50 +1000",
      "title": "Commissioners appointed to Port Hedland council after mayor resigns",
      "neutral_headline": "Commissioners Appointed to Run Port Hedland Council",
      "bullet_summary": [
        "Reported by The Age, ABC Just In"
      ],
      "items": [
        {
          "source": "The Age",
          "url": "https://www.theage.com.au/national/western-australia/commissioners-appointed-to-port-hedland-council-after-mayor-resigns-20250902-p5mruy.html",
          "published_at": "Tue, 02 Sep 2025 16:12:50 +1000",
          "title": "Commissioners appointed to Port Hedland council after mayor resigns",
          "standfirst": "The council of the Pilbara town that is home to the world’s biggest bulk export port has been dissolved and three commissioners appointed in its place.",
          "content": "The council of the Pilbara town that is home to the world’s biggest bulk export port has been dissolved and three commissioners appointed in its place.",
          "feed_position": 18,
          "image_url": "https://static.ffx.io/images/$zoom_0.1287%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_94/t_crop_custom/q_86%2Cf_auto/b70b539c41ddd6eb6f2b1d6b34acc85c687b0261"
        },
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/commissioners-appointed-port-hedland-mayor-resignation/105708408",
          "published_at": "Tue, 02 Sep 2025 04:30:31 +0000",
          "title": "Commissioners named to run Port Hedland after mayor's exit",
          "standfirst": "Two former WA MPs and a veteran mayor are tasked with getting the trouble-plagued Town of Port Hedland back on track following the resignation of its mayor.",
          "content": "Two former WA MPs and a veteran mayor are tasked with getting the trouble-plagued Town of Port Hedland back on track following the resignation of its mayor.",
          "feed_position": 17
        }
      ],
      "featured_image": "https://static.ffx.io/images/$zoom_0.1287%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_94/t_crop_custom/q_86%2Cf_auto/b70b539c41ddd6eb6f2b1d6b34acc85c687b0261",
      "popularity_score": 2018.9899902777777,
      "ai_summary": [
        "Commissioners were appointed to the Port Hedland council.",
        "The council was dissolved after the mayor's resignation.",
        "Two former WA MPs and a veteran mayor are involved.",
        "They are tasked with getting the council back on track.",
        "Port Hedland is home to the world's biggest bulk export port."
      ]
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 02:36:42 +0000",
      "title": "Travellers face heavy losses after agency and supplier go under",
      "neutral_headline": "Travelers Face Losses After Travel Agency Collapse",
      "bullet_summary": [
        "A new administrator's report has revealed Traveldream paid another company to secure flights, accommodation and tours for customers, which has now gone into administration itself",
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/traveldream-collapse-administrators-report/105723904",
          "published_at": "Tue, 02 Sep 2025 02:36:42 +0000",
          "title": "Travellers face heavy losses after agency and supplier go under",
          "standfirst": "A new administrator's report has revealed Traveldream paid another company to secure flights, accommodation and tours for customers, which has now gone into administration itself.",
          "content": "A new administrator's report has revealed Traveldream paid another company to secure flights, accommodation and tours for customers, which has now gone into administration itself.",
          "feed_position": 0
        }
      ],
      "popularity_score": 348.38776805555557,
      "ai_summary": [
        "A travel agency and its supplier have gone into administration.",
        "Traveldream paid another company for customer services.",
        "The other company secured flights, accommodation, and tours.",
        "The administrator's report revealed the situation.",
        "Customers face heavy losses due to the collapse."
      ]
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:56:34 +0000",
      "title": "Aussie apple exports to Canada easier as restrictions relaxed",
      "neutral_headline": "Australian Apple Exports to Canada Become Easier",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/australian-apple-growers-gain-easier-access-to-canadian-market/105724136",
          "published_at": "Tue, 02 Sep 2025 06:56:34 +0000",
          "title": "Aussie apple exports to Canada easier as restrictions relaxed",
          "standfirst": "Australia apple growers will have easier access to the Canadian export market following trade negotiations between the nations.",
          "content": "Australia apple growers will have easier access to the Canadian export market following trade negotiations between the nations.",
          "feed_position": 1
        }
      ],
      "popularity_score": 342.7188791666667,
      "ai_summary": [
        "Australian apple growers will have easier access to Canada.",
        "Trade negotiations between the nations led to the change.",
        "Restrictions on apple exports have been relaxed.",
        "This will benefit Australian apple producers.",
        "The change is a result of trade agreements."
      ]
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:29:47 +0000",
      "title": "Labor holds permanent migration numbers steady in wake of protest",
      "neutral_headline": "Australia Maintains Permanent Migration Numbers",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/labor-holds-permanent-migration-numbers-steady/105725862",
          "published_at": "Tue, 02 Sep 2025 05:29:47 +0000",
          "title": "Labor holds permanent migration numbers steady in wake of protest",
          "standfirst": "The permanent migration program will remain at 185,000 this year, although the number is not directly related to the contentious net migration figure, which spiked after the pandemic.",
          "content": "The permanent migration program will remain at 185,000 this year, although the number is not directly related to the contentious net migration figure, which spiked after the pandemic.",
          "feed_position": 2
        }
      ],
      "popularity_score": 331.27249027777776,
      "ai_summary": [
        "The permanent migration program will remain at 185,000.",
        "This is the number for the current year.",
        "The number is not directly related to net migration.",
        "Net migration spiked after the pandemic.",
        "The government is holding the numbers steady."
      ]
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:30:36 +0000",
      "title": "Man charged after displaying Dezi Freeman placard at anti-immigration rally",
      "neutral_headline": "Man Charged After Anti-Immigration Rally Placard",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/man-charged-over-display-of-dezi-freeman-sign-at-rally/105726036",
          "published_at": "Tue, 02 Sep 2025 05:30:36 +0000",
          "title": "Man charged after displaying Dezi Freeman placard at anti-immigration rally",
          "standfirst": "A man seen holding a placard depicting alleged police killer Dezi Freeman at an anti-immigration rally in Adelaide on Sunday has been arrested.",
          "content": "A man seen holding a placard depicting alleged police killer Dezi Freeman at an anti-immigration rally in Adelaide on Sunday has been arrested.",
          "feed_position": 4
        }
      ],
      "popularity_score": 311.2861013888889,
      "ai_summary": [
        "A man was charged after an anti-immigration rally.",
        "He displayed a placard depicting Dezi Freeman.",
        "The rally took place in Adelaide on Sunday.",
        "The man was arrested for his actions.",
        "The placard featured an alleged police killer."
      ]
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 19:14:47 +0000",
      "title": "Police reviewing 'remarkable' amount of new Dezi Freeman information",
      "neutral_headline": "Police Reviewing New Information on Dezi Freeman",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/dezi-freeman-porepunkah-shooting-police-manhunt/105721206",
          "published_at": "Mon, 01 Sep 2025 19:14:47 +0000",
          "title": "Police reviewing 'remarkable' amount of new Dezi Freeman information",
          "standfirst": "A week on from a shooting in Victoria's north east that killed two police officers, the alleged gunman remains on the run.",
          "content": "A week on from a shooting in Victoria's north east that killed two police officers, the alleged gunman remains on the run.",
          "feed_position": 3
        }
      ],
      "popularity_score": 311.02249027777776,
      "ai_summary": [
        "Police are reviewing a \"remarkable\" amount of new information.",
        "The information relates to Dezi Freeman.",
        "A shooting in Victoria's north east killed two police officers.",
        "The alleged gunman remains on the run.",
        "The shooting occurred a week prior to the report."
      ]
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 03:54:04 +0000",
      "title": "Molly Picklum becomes surfing world champion, wins WSL finals in Fiji",
      "neutral_headline": "Molly Picklum Wins Surfing World Championship in Fiji",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/molly-picklum-becomes-surfing-world-champion-winning-wsl/105725418",
          "published_at": "Tue, 02 Sep 2025 03:54:04 +0000",
          "title": "Molly Picklum becomes surfing world champion, wins WSL finals in Fiji",
          "standfirst": "Molly Picklum is Australia's newest world champion after storming to victory in the World Surf League Finals in Fiji.",
          "content": "Molly Picklum is Australia's newest world champion after storming to victory in the World Surf League Finals in Fiji.",
          "feed_position": 5
        }
      ],
      "popularity_score": 299.6772125,
      "ai_summary": [
        "Molly Picklum won the World Surf League Finals in Fiji.",
        "She is Australia's newest surfing world champion.",
        "Picklum stormed to victory in the finals.",
        "The event took place in Fiji.",
        "She is now a world champion."
      ]
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 21:22:08 +0000",
      "title": "Live: Greens call for 'repercussions' for Katter after threat to journalist",
      "neutral_headline": "Greens Seek Repercussions for Katter's Threat to Journalist",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/federal-politics-live-sept-2/105722386",
          "published_at": "Mon, 01 Sep 2025 21:22:08 +0000",
          "title": "Live: Greens call for 'repercussions' for Katter after threat to journalist",
          "standfirst": "Greens Senator Sarah Hanson-Young requests Bob Katter be referred to the Independent Parliamentary Standards Commission over his threat to a journalist in Brisbane last week. Follow live.",
          "content": "Greens Senator Sarah Hanson-Young requests Bob Katter be referred to the Independent Parliamentary Standards Commission over his threat to a journalist in Brisbane last week. Follow live.",
          "feed_position": 6
        }
      ],
      "popularity_score": 293.14499027777777,
      "ai_summary": [
        "Greens Senator Sarah Hanson-Young wants Bob Katter referred to the Independent Parliamentary Standards Commission.",
        "The referral concerns Katter's alleged threat to a journalist in Brisbane last week.",
        "The incident is currently under review by the Greens party.",
        "The Greens are seeking accountability for Katter's actions.",
        "The situation is being followed live by ABC News Australia."
      ]
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:38:43 +0000",
      "title": "'Great outcome' or simply unaffordable? Debate over Melbourne redevelopment heats up",
      "neutral_headline": "Melbourne Redevelopment Sparks Debate Over Affordability",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/queen-victoria-market-redevelopment-housing-boost/105722108",
          "published_at": "Tue, 02 Sep 2025 05:38:43 +0000",
          "title": "'Great outcome' or simply unaffordable? Debate over Melbourne redevelopment heats up",
          "standfirst": "The redevelopment of the 150-year-old Queen Victoria Market has been described as the \"biggest renewal\" in its history with thousands of new homes promised, but some critics say the plans don't do enough for affordability.",
          "content": "The redevelopment of the 150-year-old Queen Victoria Market has been described as the \"biggest renewal\" in its history with thousands of new homes promised, but some critics say the plans don't do enough for affordability.",
          "feed_position": 7
        }
      ],
      "popularity_score": 287.42137916666667,
      "ai_summary": [
        "The Queen Victoria Market redevelopment is the \"biggest renewal\" in its history.",
        "Thousands of new homes are promised as part of the redevelopment plan.",
        "Critics express concerns that the plans do not adequately address affordability.",
        "The redevelopment is of the 150-year-old Queen Victoria Market.",
        "The debate highlights differing views on the project's impact."
      ]
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:08:24 +0000",
      "title": "Fit dad, 44, reunites with saviours after shock post-workout heart attack",
      "neutral_headline": "Queensland Man Reunites with Saviors After Post-Workout Heart Attack",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/heart-attack-survivor-reunites-with-lifesaving-paramedics/105725194",
          "published_at": "Tue, 02 Sep 2025 06:08:24 +0000",
          "title": "Fit dad, 44, reunites with saviours after shock post-workout heart attack",
          "standfirst": "Queenslander Ben Ayres felt \"a bit off\" after finishing up at the gym. By the time he called a family friend for a lift to hospital, it was almost too late.",
          "content": "Queenslander Ben Ayres felt \"a bit off\" after finishing up at the gym. By the time he called a family friend for a lift to hospital, it was almost too late.",
          "feed_position": 7
        }
      ],
      "popularity_score": 281.9161013888889,
      "ai_summary": [
        "Ben Ayres, 44, experienced a heart attack after finishing a gym workout.",
        "He felt unwell and called a family friend for a ride to the hospital.",
        "Ayres was reunited with the medical team who saved his life.",
        "The incident highlights the importance of recognizing heart attack symptoms.",
        "Ayres's story serves as a reminder of the need for immediate medical attention."
      ]
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:06:05 +0000",
      "title": "Nestle dismisses CEO over 'undisclosed romantic relationship'",
      "neutral_headline": "Nestle Dismisses CEO Following Investigation of Relationship",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/nestle-dismisses-ceo-over-undisclosed-romantic-relationship/105725484",
          "published_at": "Tue, 02 Sep 2025 06:06:05 +0000",
          "title": "Nestle dismisses CEO over 'undisclosed romantic relationship'",
          "standfirst": "The company says an investigation has been ordered following the chief executive's dismissal.",
          "content": "The company says an investigation has been ordered following the chief executive's dismissal.",
          "feed_position": 8
        }
      ],
      "popularity_score": 271.8774902777778,
      "ai_summary": [
        "Nestle has dismissed its chief executive officer.",
        "The dismissal follows an investigation into an undisclosed romantic relationship.",
        "The company has ordered an investigation into the matter.",
        "Details of the relationship have not been released.",
        "The company has not released further details at this time."
      ]
    },
    {
      "id": "cluster_32",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:51:12 +0000",
      "title": "'No-one is safe': Latest GPS jamming attack could mean Russian escalation",
      "neutral_headline": "GPS Jamming Attack Concerns Rise Amid Russian Interference Allegations",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/gps-jamming-attack-russian-hybrid-warfare-tactic/105724262",
          "published_at": "Tue, 02 Sep 2025 04:51:12 +0000",
          "title": "'No-one is safe': Latest GPS jamming attack could mean Russian escalation",
          "standfirst": "The incident with Ursula von der Leyen's plane joins a growing list of alleged acts of Russian interference with GPS satellite navigation.",
          "content": "The incident with Ursula von der Leyen's plane joins a growing list of alleged acts of Russian interference with GPS satellite navigation.",
          "feed_position": 8
        }
      ],
      "popularity_score": 270.62943472222224,
      "ai_summary": [
        "An incident involving Ursula von der Leyen's plane is under scrutiny.",
        "The incident is part of a growing list of alleged Russian GPS interference.",
        "The attacks are raising concerns about potential escalation.",
        "The incidents involve alleged acts of Russian interference with GPS.",
        "The situation is being closely monitored by authorities."
      ]
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:39:36 +0000",
      "title": "Warning for parents as government vows to restrict 'nudify' apps",
      "neutral_headline": "Government Warns Parents About 'Nudify' Apps, Child Safety",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/child-safety-expert-warns-of-ai-generated-child-abuse/105724916",
          "published_at": "Tue, 02 Sep 2025 06:39:36 +0000",
          "title": "Warning for parents as government vows to restrict 'nudify' apps",
          "standfirst": "A former law enforcement worker is urging Australian parents to avoid publicly sharing photos of their children amid growing concerns over predators using AI to create child abuse material.",
          "content": "A former law enforcement worker is urging Australian parents to avoid publicly sharing photos of their children amid growing concerns over predators using AI to create child abuse material.",
          "feed_position": 14
        }
      ],
      "popularity_score": 164.4361013888889,
      "ai_summary": [
        "The government is vowing to restrict \"nudify\" apps.",
        "A former law enforcement worker is urging parents to be cautious.",
        "Concerns are growing over AI used to create child abuse material.",
        "Parents are advised to avoid publicly sharing photos of their children.",
        "The warning aims to protect children from online predators."
      ]
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:12:04 +0000",
      "title": "15yo girl and her puppy embark on record-breaking flight around Australia",
      "neutral_headline": "Fifteen-Year-Old Girl Plans Record-Breaking Flight Around Australia",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/nt-jennifer-hunt-golden-retriever-puppy-bella-flight-record/105717942",
          "published_at": "Tue, 02 Sep 2025 06:12:04 +0000",
          "title": "15yo girl and her puppy embark on record-breaking flight around Australia",
          "standfirst": "A 15-year-old girl from the Northern Territory is looking to break a record, as the youngest female to fly around Australia solo. And her golden retriever puppy, Bella, will be joining her for the ride.",
          "content": "A 15-year-old girl from the Northern Territory is looking to break a record, as the youngest female to fly around Australia solo. And her golden retriever puppy, Bella, will be joining her for the ride.",
          "feed_position": 17
        }
      ],
      "popularity_score": 161.9772125,
      "ai_summary": [
        "A 15-year-old girl from the Northern Territory plans to fly around Australia.",
        "She aims to become the youngest female to complete a solo flight around Australia.",
        "Her golden retriever puppy, Bella, will accompany her on the flight.",
        "The flight is intended to break a record.",
        "The journey is expected to be a significant achievement."
      ]
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:05:22 +0000",
      "title": "Service clubs struggling to deliver amid lack of volunteers",
      "neutral_headline": "Service Clubs Struggle Due to Declining Volunteer Numbers",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/service-clubs-suffer-as-volunteer-numbers-decline-in-sa/105698520",
          "published_at": "Tue, 02 Sep 2025 04:05:22 +0000",
          "title": "Service clubs struggling to deliver amid lack of volunteers",
          "standfirst": "Volunteer numbers have continued to drop in regional areas and service clubs are feeling the impacts as the average age of their members continues to rise.",
          "content": "Volunteer numbers have continued to drop in regional areas and service clubs are feeling the impacts as the average age of their members continues to rise.",
          "feed_position": 23
        }
      ],
      "popularity_score": 159.86554583333333,
      "ai_summary": [
        "Volunteer numbers are decreasing in regional areas.",
        "Service clubs are feeling the impact of the volunteer shortage.",
        "The average age of service club members is increasing.",
        "Service clubs are facing challenges in delivering services.",
        "The situation highlights the need for volunteer recruitment."
      ]
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:01:14 +0000",
      "title": "'$1 million an hour': Calls for urgent reform as NSW pokies losses soar",
      "neutral_headline": "NSW Pokies Losses Soar, Prompting Calls for Urgent Reform",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/pokie-losses-1-million-from-nsw-gamblers-every-hour/105723938",
          "published_at": "Tue, 02 Sep 2025 04:01:14 +0000",
          "title": "'$1 million an hour': Calls for urgent reform as NSW pokies losses soar",
          "standfirst": "Wesley Mission is calling for urgent action as new figures show the state's poker-machine players are losing more than $1 million an hour.",
          "content": "Wesley Mission is calling for urgent action as new figures show the state's poker-machine players are losing more than $1 million an hour.",
          "feed_position": 24
        }
      ],
      "popularity_score": 159.79665694444444,
      "ai_summary": [
        "New figures show NSW poker-machine players losing over $1 million hourly.",
        "Wesley Mission is calling for urgent action to address the losses.",
        "The losses are raising concerns about problem gambling.",
        "Calls for reform are increasing due to the high losses.",
        "The situation highlights the need for gambling regulation."
      ]
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:23:23 +0000",
      "title": "Black Hawks, aerial tanker boost Qld air power for bushfire season",
      "neutral_headline": "Queensland Boosts Air Power for Bushfire Season",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/black-hawk-helicopters-join-queensland-firefighting-fleet/105725026",
          "published_at": "Tue, 02 Sep 2025 04:23:23 +0000",
          "title": "Black Hawks, aerial tanker boost Qld air power for bushfire season",
          "standfirst": "The state's firefighting capabilities are bolstered with the arrival of a fleet of aircraft amid concerns about fuel loads ahead of the bushfire season.",
          "content": "The state's firefighting capabilities are bolstered with the arrival of a fleet of aircraft amid concerns about fuel loads ahead of the bushfire season.",
          "feed_position": 18
        }
      ],
      "popularity_score": 158.1658236111111,
      "ai_summary": [
        "Queensland is bolstering its firefighting capabilities.",
        "A fleet of aircraft, including Black Hawks and an aerial tanker, has arrived.",
        "Concerns exist about fuel loads ahead of the bushfire season.",
        "The aircraft will assist in fighting potential bushfires.",
        "The state is preparing for the upcoming bushfire season."
      ]
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 00:21:59 +0000",
      "title": "Labor plans to make it harder to access government information",
      "neutral_headline": "Labor Plans to Make Accessing Government Information Harder",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/labor-plans-to-weaken-foi-laws/105723992",
          "published_at": "Tue, 02 Sep 2025 00:21:59 +0000",
          "title": "Labor plans to make it harder to access government information",
          "standfirst": "A new proposal would introduce a fee for Freedom of Information requests and tighten the rules around the release of documents related to government deliberations.",
          "content": "A new proposal would introduce a fee for Freedom of Information requests and tighten the rules around the release of documents related to government deliberations.",
          "feed_position": 20
        }
      ],
      "popularity_score": 158.14249027777777,
      "ai_summary": [
        "Labor plans to introduce fees for Freedom of Information requests.",
        "The proposal would tighten rules on releasing government documents.",
        "The changes relate to documents concerning government deliberations.",
        "The changes could limit public access to government information.",
        "The proposal is generating discussion about transparency."
      ]
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:58:36 +0000",
      "title": "Battery found in Guzman Y Gomez burrito bowl, expert raises serious safety concerns",
      "neutral_headline": "Battery Found in Guzman Y Gomez Burrito Bowl, Safety Concerns Raised",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/guzman-y-gomez-battery-burrito-bowl/105725308",
          "published_at": "Tue, 02 Sep 2025 06:58:36 +0000",
          "title": "Battery found in Guzman Y Gomez burrito bowl, expert raises serious safety concerns",
          "standfirst": "A Queensland woman says she was left panicked and unable to sleep after discovering a button battery in her lunch from a popular takeaway food chain.",
          "content": "A Queensland woman says she was left panicked and unable to sleep after discovering a button battery in her lunch from a popular takeaway food chain.",
          "feed_position": 10
        }
      ],
      "popularity_score": 152.75276805555555,
      "ai_summary": [
        "A woman found a button battery in her Guzman Y Gomez burrito bowl.",
        "She experienced panic and sleeplessness after the discovery.",
        "An expert has raised serious safety concerns about the incident.",
        "The incident highlights the potential dangers of button batteries.",
        "The woman's experience underscores the importance of food safety."
      ]
    },
    {
      "id": "cluster_14",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:33:04 +0000",
      "title": "Development to continue on Gold Coast despite light rail scrapping",
      "neutral_headline": "Gold Coast Development to Continue Despite Light Rail Scrapping",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/gold-coast-development-will-continue-mayor-says/105723554",
          "published_at": "Tue, 02 Sep 2025 06:33:04 +0000",
          "title": "Development to continue on Gold Coast despite light rail scrapping",
          "standfirst": "The city's mayor says high-density development is needed in the area to match state government housing targets.",
          "content": "The city's mayor says high-density development is needed in the area to match state government housing targets.",
          "feed_position": 18
        }
      ],
      "popularity_score": 152.3272125,
      "ai_summary": [
        "Development will continue on the Gold Coast.",
        "The city's mayor supports high-density development.",
        "The development aims to meet state government housing targets.",
        "The light rail project has been scrapped.",
        "The focus is on addressing housing needs."
      ]
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 06:23:22 +0000",
      "title": "Inappropriate 'pattern of behaviours' from Optus staff revealed",
      "neutral_headline": "Optus Staff Behaviors Revealed in Court, Vulnerable Customers Targeted",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/accc-federal-court-action-against-optus-vulnerable-customers/105724206",
          "published_at": "Tue, 02 Sep 2025 06:23:22 +0000",
          "title": "Inappropriate 'pattern of behaviours' from Optus staff revealed",
          "standfirst": "The Federal Court has heard vulnerable Optus customers who were homeless, unemployed or receiving disability payments were wrongfully sold services and products.",
          "content": "The Federal Court has heard vulnerable Optus customers who were homeless, unemployed or receiving disability payments were wrongfully sold services and products.",
          "feed_position": 12
        }
      ],
      "popularity_score": 152.16554583333334,
      "ai_summary": [
        "The Federal Court heard about inappropriate Optus staff behaviors.",
        "Vulnerable customers were wrongfully sold services and products.",
        "The customers were homeless, unemployed, or receiving disability payments.",
        "The court heard about the targeting of vulnerable customers.",
        "The case highlights concerns about sales practices."
      ]
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:38:14 +0000",
      "title": "Killer stabbed woman and dumped body in ocean to be eaten by sharks, court told",
      "neutral_headline": "Man Accused of Murdering Woman, Feeding Body to Sharks",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/muhammad-mirza-murder-trial-helen-marsuk/105725254",
          "published_at": "Tue, 02 Sep 2025 05:38:14 +0000",
          "title": "Killer stabbed woman and dumped body in ocean to be eaten by sharks, court told",
          "standfirst": "A man who invited a woman to his home to have sex with him in exchange for drugs allegedly stabbed her to death and placed her body in the ocean to be eaten by sharks, a Perth court hears.",
          "content": "A man who invited a woman to his home to have sex with him in exchange for drugs allegedly stabbed her to death and placed her body in the ocean to be eaten by sharks, a Perth court hears.",
          "feed_position": 10
        }
      ],
      "popularity_score": 151.4133236111111,
      "ai_summary": [
        "A man is accused of stabbing a woman to death.",
        "The court heard he allegedly dumped her body in the ocean.",
        "The body was allegedly placed in the ocean to be eaten by sharks.",
        "The incident occurred in Perth, according to court testimony.",
        "The case involves serious allegations of murder."
      ]
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:32:00 +0000",
      "title": "All Tasmanian abattoirs have CCTV, but it's not known how much footage is watched",
      "neutral_headline": "Tasmanian Abattoirs Have CCTV, Footage Review Unclear",
      "bullet_summary": [
        "But since then, it has been revealed no record is being kept on whether the surveillance video is being reviewed",
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/tasmanian-abattoir-cctv-monitoring-records-not-kept/105724876",
          "published_at": "Tue, 02 Sep 2025 05:32:00 +0000",
          "title": "All Tasmanian abattoirs have CCTV, but it's not known how much footage is watched",
          "standfirst": "After distressing video was aired showing the shocking treatment of animals inside a Tasmanian abattoir, CCTV cameras were made mandatory. But since then, it has been revealed no record is being kept on whether the surveillance video is being reviewed.",
          "content": "After distressing video was aired showing the shocking treatment of animals inside a Tasmanian abattoir, CCTV cameras were made mandatory. But since then, it has been revealed no record is being kept on whether the surveillance video is being reviewed.",
          "feed_position": 11
        }
      ],
      "popularity_score": 151.30943472222222,
      "ai_summary": [
        "CCTV cameras are mandatory in all Tasmanian abattoirs following animal treatment concerns.",
        "There is no record of whether surveillance footage is being reviewed by authorities.",
        "The lack of review raises questions about the effectiveness of the CCTV mandate.",
        "The initial mandate followed the airing of distressing videos from an abattoir.",
        "The situation highlights potential gaps in animal welfare oversight within Tasmania."
      ]
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:22:11 +0000",
      "title": "Beachside residents say they're 'sitting ducks' as seawall proceeds",
      "neutral_headline": "Beachside Residents Face Erosion, Seek Protection Measures",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/central-coast-residents-proceed-with-seawall/105595660",
          "published_at": "Tue, 02 Sep 2025 05:22:11 +0000",
          "title": "Beachside residents say they're 'sitting ducks' as seawall proceeds",
          "standfirst": "Residents of one Central Coast beach have gained permission to build a rock wall to protect their homes, while in another notorious erosion hotspot there is still no solution.",
          "content": "Residents of one Central Coast beach have gained permission to build a rock wall to protect their homes, while in another notorious erosion hotspot there is still no solution.",
          "feed_position": 13
        }
      ],
      "popularity_score": 151.1458236111111,
      "ai_summary": [
        "Residents on one Central Coast beach received approval for a rock wall.",
        "Another erosion hotspot still lacks a solution to protect homes.",
        "Residents feel vulnerable to coastal erosion and its effects.",
        "The differing situations highlight the complexities of coastal management.",
        "The rock wall aims to protect homes from further damage."
      ]
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 05:04:42 +0000",
      "title": "Nauru was once the second-wealthiest nation. Here's how it lost everything",
      "neutral_headline": "Nauru's Economic History: From Wealth to Current Deal",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/nauru-economy-wealth-sources-of-revenue/105720686",
          "published_at": "Tue, 02 Sep 2025 05:04:42 +0000",
          "title": "Nauru was once the second-wealthiest nation. Here's how it lost everything",
          "standfirst": "Experts say Nauru's new deal with Australia to take non-citizens is the latest episode in an unconventional economic story — one featuring phenomenal growth, a mining bust, and a failed musical about a Renaissance genius.",
          "content": "Experts say Nauru's new deal with Australia to take non-citizens is the latest episode in an unconventional economic story — one featuring phenomenal growth, a mining bust, and a failed musical about a Renaissance genius.",
          "feed_position": 15
        }
      ],
      "popularity_score": 150.8544347222222,
      "ai_summary": [
        "Nauru's new deal with Australia involves taking non-citizens.",
        "Nauru was once the second-wealthiest nation globally.",
        "The nation's economic story includes rapid growth and a mining bust.",
        "A failed musical about a Renaissance genius also played a role.",
        "Experts are analyzing the unconventional economic trajectory of Nauru."
      ]
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:22:37 +0000",
      "title": "No immediate prison time for mother of twin girls killed in car crash",
      "neutral_headline": "Mother Avoids Immediate Prison Time After Fatal Crash",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/van-oyen-sentence-appeal-supreme-court/105724640",
          "published_at": "Tue, 02 Sep 2025 04:22:37 +0000",
          "title": "No immediate prison time for mother of twin girls killed in car crash",
          "standfirst": "Perth woman Rachel Van Oyen, whose careless driving caused the death of her daughters in a crash in country WA, successfully appeals her original sentence.",
          "content": "Perth woman Rachel Van Oyen, whose careless driving caused the death of her daughters in a crash in country WA, successfully appeals her original sentence.",
          "feed_position": 19
        }
      ],
      "popularity_score": 150.15304583333332,
      "ai_summary": [
        "Rachel Van Oyen's careless driving caused her twin daughters' deaths.",
        "She successfully appealed her original prison sentence.",
        "The crash occurred in country Western Australia.",
        "The case involves the legal consequences of a tragic event.",
        "The appeal resulted in a change to the initial sentencing."
      ]
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:16:50 +0000",
      "title": "Value of Australian agriculture, fishing and forestry set to top $101b",
      "neutral_headline": "Australian Agriculture, Fishing, Forestry Value to Exceed $101 Billion",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/abares-australian-agriculture-value-record-101-billion-farming/105724064",
          "published_at": "Tue, 02 Sep 2025 04:16:50 +0000",
          "title": "Value of Australian agriculture, fishing and forestry set to top $101b",
          "standfirst": "A federal government forecaster says the value of Australia's agriculture, fisheries and forestry is on track to reach a record value of $101 billion this financial year, a target previously set for 2030.",
          "content": "A federal government forecaster says the value of Australia's agriculture, fisheries and forestry is on track to reach a record value of $101 billion this financial year, a target previously set for 2030.",
          "feed_position": 20
        }
      ],
      "popularity_score": 150.05665694444446,
      "ai_summary": [
        "The value of these sectors is set to reach a record $101 billion.",
        "This target was previously set for the year 2030.",
        "The forecast comes from a federal government forecaster.",
        "The financial year in question is the current one.",
        "The sectors include agriculture, fisheries, and forestry."
      ]
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:07:38 +0000",
      "title": "Israel has killed 12 senior Houthi figures. Has this weakened the rebel group?",
      "neutral_headline": "Israel's Actions Against Houthis: Impact on Rebel Group",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/israel-kills-houthi-senior-officials-has-this-weakened-group/105719402",
          "published_at": "Tue, 02 Sep 2025 04:07:38 +0000",
          "title": "Israel has killed 12 senior Houthi figures. Has this weakened the rebel group?",
          "standfirst": "This latest attack from Israel is a \"significant blow\" to the Iran-backed rebel group. But how much has it actually weakened the Houthis?",
          "content": "This latest attack from Israel is a \"significant blow\" to the Iran-backed rebel group. But how much has it actually weakened the Houthis?",
          "feed_position": 11
        }
      ],
      "popularity_score": 149.90332361111112,
      "ai_summary": [
        "Israel has killed twelve senior Houthi figures.",
        "The attack is considered a significant blow to the group.",
        "The Houthis are an Iran-backed rebel group.",
        "The article explores the impact of the attack on the group.",
        "The analysis considers the weakening of the rebel group."
      ]
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 04:07:13 +0000",
      "title": "'Walking on eggshells': When parental discipline is actually coercive control",
      "neutral_headline": "Coercive Control in Parenting: Impact on Children",
      "bullet_summary": [
        "Reported by ABC Just In"
      ],
      "items": [
        {
          "source": "ABC Just In",
          "url": "https://www.abc.net.au/news/2025-09-02/when-parental-discipline-is-actually-coercive-control/105641030",
          "published_at": "Tue, 02 Sep 2025 04:07:13 +0000",
          "title": "'Walking on eggshells': When parental discipline is actually coercive control",
          "standfirst": "New research shows children who experience coercive control from parents often believe it is normal parental discipline, making help-seeking particularly difficult.",
          "content": "New research shows children who experience coercive control from parents often believe it is normal parental discipline, making help-seeking particularly difficult.",
          "feed_position": 22
        }
      ],
      "popularity_score": 149.89637916666666,
      "ai_summary": [
        "New research explores coercive control in parental discipline.",
        "Children may perceive coercive control as normal discipline.",
        "This perception makes seeking help particularly difficult for children.",
        "The research focuses on the effects of coercive control.",
        "The study highlights the challenges faced by affected children."
      ]
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 02:40:26 +0000",
      "title": "Trump to award Rudy Giuliani the highest US civilian order",
      "neutral_headline": "Trump to Award Giuliani Presidential Medal of Freedom",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/trump-to-award-rudy-giuliani-the-presidential-medal-of-freedom/105724440",
          "published_at": "Tue, 02 Sep 2025 02:40:26 +0000",
          "title": "Trump to award Rudy Giuliani the highest US civilian order",
          "standfirst": "The decision awards the United States' Presidential Medal of Freedom to a man once lauded for leading New York after the 2001 September 11 attacks, and later sanctioned by courts for amplifying false election claims.",
          "content": "The decision awards the United States' Presidential Medal of Freedom to a man once lauded for leading New York after the 2001 September 11 attacks, and later sanctioned by courts for amplifying false election claims.",
          "feed_position": 23
        }
      ],
      "popularity_score": 148.44999027777777,
      "ai_summary": [
        "Donald Trump will award Rudy Giuliani the Medal of Freedom.",
        "Giuliani was once lauded for leading New York after 9/11.",
        "He was later sanctioned for amplifying false election claims.",
        "The award is the highest US civilian honor.",
        "The decision has drawn criticism due to Giuliani's actions."
      ]
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Tue, 02 Sep 2025 01:59:01 +0000",
      "title": "Your guide to Formula 1 and Oscar Piastri as the championship race heats up",
      "neutral_headline": "Formula 1 and Oscar Piastri: Championship Race Update",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/your-shortcut-guide-to-f1-oscar-piastri-and-drive-to-survive/105581626",
          "published_at": "Tue, 02 Sep 2025 01:59:01 +0000",
          "title": "Your guide to Formula 1 and Oscar Piastri as the championship race heats up",
          "standfirst": "Formula 1 is having a moment — and so is Oscar Piastri, the Australian driver who is currently topping the leaderboard. As the race to the championship heats up, now is the perfect time to get up to speed.",
          "content": "Formula 1 is having a moment — and so is Oscar Piastri, the Australian driver who is currently topping the leaderboard. As the race to the championship heats up, now is the perfect time to get up to speed.",
          "feed_position": 22
        }
      ],
      "popularity_score": 147.7597125,
      "ai_summary": [
        "Formula 1 is currently experiencing a surge in popularity.",
        "Oscar Piastri is an Australian driver topping the leaderboard.",
        "The article provides a guide to Formula 1.",
        "The championship race is heating up.",
        "The article aims to bring readers up to speed."
      ]
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 23:00:00 +0000",
      "title": "As her marriage collapsed, this surprising PM became Princess Diana's closest confidant",
      "neutral_headline": "Princess Diana's Confidant: A New Book's Revelations",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/royal-family-diana-queen-valentine-low-power-and-palace-major/105714708",
          "published_at": "Mon, 01 Sep 2025 23:00:00 +0000",
          "title": "As her marriage collapsed, this surprising PM became Princess Diana's closest confidant",
          "standfirst": "From detailing Princess Diana's secret counselling sessions with the queen's favourite PM, to meddling in Australia's biggest political scandal, this new book lays bare the relationship between Crown and State",
          "content": "From detailing Princess Diana's secret counselling sessions with the queen's favourite PM, to meddling in Australia's biggest political scandal, this new book lays bare the relationship between Crown and State",
          "feed_position": 16
        }
      ],
      "popularity_score": 144.7761013888889,
      "ai_summary": [
        "A new book details Princess Diana's relationship with a PM.",
        "The PM was a surprising confidant to Princess Diana.",
        "The book details secret counselling sessions.",
        "The book also covers a major Australian political scandal.",
        "The relationship between Crown and State is explored."
      ]
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 21:18:36 +0000",
      "title": "Calls for attack on Aboriginal site to be declared hate crime",
      "neutral_headline": "Calls for Hate Crime Declaration After Aboriginal Site Attack",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/iat-camp-sovereignty-follow/105722830",
          "published_at": "Mon, 01 Sep 2025 21:18:36 +0000",
          "title": "Calls for attack on Aboriginal site to be declared hate crime",
          "standfirst": "The attack on Aboriginal protest site Camp Sovereignty is just the latest attack on First Nations sites and people. Indigenous leaders want it declared an act of terror.",
          "content": "The attack on Aboriginal protest site Camp Sovereignty is just the latest attack on First Nations sites and people. Indigenous leaders want it declared an act of terror.",
          "feed_position": 19
        }
      ],
      "popularity_score": 143.0861013888889,
      "ai_summary": [
        "An attack occurred at the Aboriginal protest site Camp Sovereignty.",
        "Indigenous leaders want the attack declared a hate crime.",
        "The attack is the latest against First Nations sites.",
        "The attack targeted Aboriginal sites and people.",
        "The incident has prompted calls for a specific legal response."
      ]
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 19:18:55 +0000",
      "title": "As Australia's corporate cop gets its act together, US comes undone",
      "neutral_headline": "US Federal Reserve Under Pressure, Australia's Cop Improves",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/trump-loyalist-appointed-to-pursue-corporate-crime/105722354",
          "published_at": "Mon, 01 Sep 2025 19:18:55 +0000",
          "title": "As Australia's corporate cop gets its act together, US comes undone",
          "standfirst": "The US president has taken another step in his unrelenting campaign to undermine the US Federal Reserve's credibility and install loyalists to the board to deliver him control of US, and by default, global interest rates.",
          "content": "The US president has taken another step in his unrelenting campaign to undermine the US Federal Reserve's credibility and install loyalists to the board to deliver him control of US, and by default, global interest rates.",
          "feed_position": 21
        }
      ],
      "popularity_score": 141.09137916666666,
      "ai_summary": [
        "The US president is undermining the US Federal Reserve.",
        "The goal is to install loyalists to control interest rates.",
        "Australia's corporate cop is improving its performance.",
        "The US president seeks control of global interest rates.",
        "The article contrasts the situations in the US and Australia."
      ]
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Mon, 01 Sep 2025 17:40:43 +0000",
      "title": "Earthquake survivors say children remain trapped as Taliban calls for help",
      "neutral_headline": "Earthquake Survivors Trapped, Taliban Seeks International Aid",
      "bullet_summary": [
        "Reported by ABC News Australia"
      ],
      "items": [
        {
          "source": "ABC News Australia",
          "url": "https://www.abc.net.au/news/2025-09-02/afghanistan-earthquake-prompts-call-for-help-from-taliban/105723244",
          "published_at": "Mon, 01 Sep 2025 17:40:43 +0000",
          "title": "Earthquake survivors say children remain trapped as Taliban calls for help",
          "standfirst": "The Taliban has joined locals in calling for international help to rescue those caught up in an earthquake that has killed at least 800 people and injured thousands of others.",
          "content": "The Taliban has joined locals in calling for international help to rescue those caught up in an earthquake that has killed at least 800 people and injured thousands of others.",
          "feed_position": 24
        }
      ],
      "popularity_score": 139.4547125,
      "ai_summary": [
        "An earthquake has killed at least 800 people.",
        "Thousands of others have been injured in the earthquake.",
        "The Taliban is calling for international assistance.",
        "Survivors report children remain trapped.",
        "The earthquake has caused widespread devastation."
      ]
    }
  ]
}