{
  "updated_at": "2026-01-07T11:14:57.612Z",
  "clusters": [
    {
      "id": "cluster_25",
      "coverage": 2,
      "updated_at": "Wed, 07 Jan 2026 01:00:06 +0000",
      "title": "Motorola reveals the Razr Fold, a book-style foldable launching this summer",
      "neutral_headline": "Motorola reveals the Razr Fold, a book-style foldable launching this summer",
      "bullet_summary": [
        "At CES 2026, the company also announced a new smartwatch, stylus, Bluetooth tracker, and even a weird AI pendant",
        "Reported by Ars Technica, Wired Tech"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/motorola-reveals-the-razr-fold-a-book-style-foldable-launching-this-summer/",
          "published_at": "Wed, 07 Jan 2026 01:00:06 +0000",
          "title": "Motorola reveals the Razr Fold, a book-style foldable launching this summer",
          "standfirst": "Motorola is light on details but heavy on hype for its first book-style foldable.",
          "content": "Motorola is no stranger to foldables, having revived the Razr as a flip-style foldable phone in 2020. Now that it has a few iterations of modern flip phones under its belt, Moto is embarking on a new challenge: big foldables. The new (and thoroughly leaked) Motorola Razr Fold is a book-style foldable like Samsung's Galaxy Z Fold and Google's Pixel Fold lines, offering a smartphone-sized external display with a big foldable panel inside. Motorola is taking the opportunity to reveal the phone at CES, but it's far from ready for launch. Currently, Motorola is aiming to release the Razr Fold this coming summer for an unknown amount of money—Motorola won't confirm pricing or really much of anything about the Razr Fold at this time. What we do know is the device will be about as big as other large foldable phones, featuring a 6.6-inch external display and an 8.1-inch internal one. Moto says the main foldable OLED panel will have a 2K resolution, which means roughly 2,000 pixels tall. Again, this is similar to existing foldables.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/razr-fold-1152x648.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/motorola-razr-fold-ces-2026/",
          "published_at": "Wed, 07 Jan 2026 01:00:00 +0000",
          "title": "Motorola Razr Fold Book-Style Foldable: Specs, Details, Release Date",
          "standfirst": "At CES 2026, the company also announced a new smartwatch, stylus, Bluetooth tracker, and even a weird AI pendant.",
          "content": "At CES 2026, the company also announced a new smartwatch, stylus, Bluetooth tracker, and even a weird AI pendant.",
          "feed_position": 13,
          "image_url": "https://media.wired.com/photos/695d5207b6493d17e530b8d0/master/pass/Motorola-Razr-Fold-Gear-Julian-Chokkattu(1).jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/razr-fold-1152x648.jpg",
      "popularity_score": 2009.75233
    },
    {
      "id": "cluster_29",
      "coverage": 2,
      "updated_at": "2026-01-06T20:00:00-05:00",
      "title": "Lenovo&#8217;s new concept rollable could be the ideal gaming laptop",
      "neutral_headline": "Lenovo&#8217;s new concept rollable could be the ideal gaming laptop",
      "bullet_summary": [
        "Reported by The Verge, Wired Tech"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/852352/lenovo-legion-pro-rollable-gaming-laptop-concept-ces-2026",
          "published_at": "2026-01-06T20:00:00-05:00",
          "title": "Lenovo&#8217;s new concept rollable could be the ideal gaming laptop",
          "standfirst": "Lenovo is at it again with wild laptop concepts for CES 2026, and the biggest one is the Legion Pro Rollable gaming laptop. It has a flexible OLED display that expands horizontally - as opposed to Lenovo's ThinkBook Plus Gen 6, which rolls up and down. The Legion Pro Rollable's screen goes from a conventional [&#8230;]",
          "content": "Wider is better. Lenovo is at it again with wild laptop concepts for CES 2026, and the biggest one is the Legion Pro Rollable gaming laptop. It has a flexible OLED display that expands horizontally - as opposed to Lenovo's ThinkBook Plus Gen 6, which rolls up and down. The Legion Pro Rollable's screen goes from a conventional 16-inch 16:10 aspect ratio to an extra-wide 21.5 inches, all the way to an ultrawide 24 inches. That's even bigger (diagonally, at least) than the ridiculous $9,000 21-inch gaming laptop Acer once made. The Pro Rollable concept is based on the Legion Pro 7i, and it'll come with an Intel Core Ultra processor and Nvidia's flagship RTX 50 … Read the full story at The Verge.",
          "feed_position": 7
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/852482/lenovo-thinkpad-rollable-xd-concept-laptop-ces-2026",
          "published_at": "2026-01-06T20:00:00-05:00",
          "title": "This ThinkPad laptop concept has a rollable display that wraps around its lid",
          "standfirst": "At CES 2026, Lenovo is announcing yet another new concept laptop with a transforming screen: the ThinkPad Rollable XD Concept. It's a ThinkPad, complete with its iconic red TrackPoint nub, but it features a flexible OLED display that wraps around to the outer part of its lid. Slide your finger along the folded spin of [&#8230;]",
          "content": "Watching this thing in action is pretty fun, thanks to that windowed lid. At CES 2026, Lenovo is announcing yet another new concept laptop with a transforming screen: the ThinkPad Rollable XD Concept. It's a ThinkPad, complete with its iconic red TrackPoint nub, but it features a flexible OLED display that wraps around to the outer part of its lid. Slide your finger along the folded spin of its touchscreen, and the laptop vertically expands from a 13.3-inch display to a taller 15.9-inch screen - offering more screen real estate for productivity work. It's a bit like Lenovo's already released ThinkBook Plus Gen 6 rollable, but the screen and motors are all in the lid as opposed to tucking the display into the chass … Read the full story at The Verge.",
          "feed_position": 8
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/lenovo-legion-pro-gaming-laptop-ultrawide-rollable-screen/",
          "published_at": "Wed, 07 Jan 2026 01:00:00 +0000",
          "title": "Lenovo’s Legion Pro Rollable Gaming Laptop Goes Ultrawide at the Press of a Key",
          "standfirst": "Lenovo brought a Legion gaming laptop to CES this year with a rollable OLED display that expands horizontally by six inches.",
          "content": "Lenovo brought a Legion gaming laptop to CES this year with a rollable OLED display that expands horizontally by six inches.",
          "feed_position": 12,
          "image_url": "https://media.wired.com/photos/695d520ac8fcfa0242b8cd5d/master/pass/legion-pro-rollable-top.jpg"
        }
      ],
      "featured_image": "https://media.wired.com/photos/695d520ac8fcfa0242b8cd5d/master/pass/legion-pro-rollable-top.jpg",
      "popularity_score": 2009.7506633333333
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 22:40:08 +0000",
      "title": "HP’s EliteBoard G1a is a Ryzen-powered Windows 11 PC in a membrane keyboard",
      "neutral_headline": "HP’s EliteBoard G1a is a Ryzen-powered Windows 11 PC in a membrane keyboard",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/hps-eliteboard-g1a-is-a-ryzen-powered-windows-11-pc-in-a-membrane-keyboard/",
          "published_at": "Tue, 06 Jan 2026 22:40:08 +0000",
          "title": "HP’s EliteBoard G1a is a Ryzen-powered Windows 11 PC in a membrane keyboard",
          "standfirst": "The most familiar, full-fledged PC experience you can get from a keyboard.",
          "content": "As a Windows system built inside of a functioning membrane keyboard, the HP EliteBoard G1a announced today is a more accessible alternative to other keyboard-PCs. The Commodore 64 made the keyboard-PC famous in the 1980s, but the keyboard-PC space has been dominated by the Raspberry Pi. In 2019, the single-board computer (SBC) maker released the Raspberry Pi 400, which is essentially a Raspberry Pi 4 SBC inside a case that also functions as a keyboard for the system. USB, HDMI, and Ethernet ports, plus a GPIO header and native Raspberry Pi OS Linux distribution add up to a low-end desktop computer experience that only costs $100. Then the Raspberry Pi 500 with a Pi 5 powered by a quad-core, 64-bit Arm Cortex-A76 inside, and the Pi 500+, which has NVMe SSD, instead of microSD, storage, and is built inside of a low-profile mechanical keyboard (it’s also twice as expensive at $200). The Pi 500+ keyboard-PC using RGB. Credit: Raspberry Pi But Raspberry Pis largely appeal to tinkerers, DIYers, and Linux fans, making Pi-as-a-desktop a niche product with a substantial learning curve for newcomers.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/eliteboard-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/eliteboard-1152x648.jpg",
      "popularity_score": 330.41955222222225
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 21:56:18 +0000",
      "title": "With GeForce Super GPUs missing in action, Nvidia focuses on software upgrades",
      "neutral_headline": "With GeForce Super GPUs missing in action, Nvidia focuses on software upgrades",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/nvidia-leans-on-dlss-improvements-to-make-up-for-a-lack-of-gpus-at-ces/",
          "published_at": "Tue, 06 Jan 2026 21:56:18 +0000",
          "title": "With GeForce Super GPUs missing in action, Nvidia focuses on software upgrades",
          "standfirst": "Nvidia's only GeForce announcements this year were about software improvements.",
          "content": "For the first time in years, Nvidia declined to introduce new GeForce graphics card models at CES. CEO Jensen Huang's characteristically sprawling and under-rehearsed 90-minute keynote focused almost entirely on the company's dominant AI business, relegating the company's gaming-related announcements to a separate video posted later in the evening. Instead, the company focused on software improvements for its existing hardware. The biggest announcement in this vein is DLSS 4.5, which adds a handful of new features to Nvidia's basket of upscaling and frame generation technologies. DLSS upscaling is being improved by a new \"second-generation transformer model\" that Nvidia says has been \"trained on an expanded data set\" to improve its predictions when generating new pixels. According to Nvidia's Bryan Catanzaro, this is particularly beneficial for image quality in the Performance and Ultra Performance modes, where the upscaler has to do more guessing because it's working from a lower-resolution source image.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/consumer-ces-umbrella-blog-1280x680-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/consumer-ces-umbrella-blog-1280x680-1-1152x648.jpg",
      "popularity_score": 319.68899666666664
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 19:55:25 +0000",
      "title": "Dell’s XPS revival is a welcome reprieve from the “AI PC” fad",
      "neutral_headline": "Dell’s XPS revival is a welcome reprieve from the “AI PC” fad",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/dells-xps-revival-is-a-welcome-reprieve-from-the-ai-pc-fad/",
          "published_at": "Tue, 06 Jan 2026 19:55:25 +0000",
          "title": "Dell’s XPS revival is a welcome reprieve from the “AI PC” fad",
          "standfirst": "Dell moves from pushing \"AI PCs\" and back to what matters in laptops.",
          "content": "After making the obviously poor decision to kill its XPS laptops and desktops in January 2025, Dell started selling 16- and 14-inch XPS laptops again today. “It was obvious we needed to change,” Jeff Clarke, vice chairman and COO at Dell Technologies, said at a press event in New York City previewing Dell's CES 2026 announcements. A year ago, Dell abandoned XPS branding, as well as its Latitude, Inspiron, and Precision PC lineups. The company replaced the reputable brands with Dell Premium, Dell Pro, and Dell Pro Max. Each series included a base model, as well as “Plus” and “Premium.” Dell isn’t resurrecting its Latitude, Inspiron, or Precision series, and it will still sell “Dell Pro” models.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/XPS-16-1152x648-1767726799.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/XPS-16-1152x648-1767726799.jpeg",
      "popularity_score": 318.67427444444445
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 21:11:54 +0000",
      "title": "Letting prisons jam contraband phones is a bad idea, phone companies tell FCC",
      "neutral_headline": "Letting prisons jam contraband phones is a bad idea, phone companies tell FCC",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/letting-prisons-jam-contraband-phones-is-a-bad-idea-phone-companies-tell-fcc/",
          "published_at": "Tue, 06 Jan 2026 21:11:54 +0000",
          "title": "Letting prisons jam contraband phones is a bad idea, phone companies tell FCC",
          "standfirst": "\"Jamming will block all communications,\" including 911 calls, CTIA tells FCC.",
          "content": "A Federal Communications Commission proposal to let state and local prisons jam contraband cell phones has support from Republican attorneys general and prison phone companies but faces opposition from wireless carriers that say it would disrupt lawful communications. Groups dedicated to Wi-Fi and GPS also raised concerns in comments to the FCC. \"Jamming will block all communications, not just communications from contraband devices,\" wireless lobby group CTIA said in December 29 comments in response to Chairman Brendan Carr's proposal. The CTIA said that \"jamming blocks all communications, including lawful communications such as 911 calling,\" and argued that the FCC \"has no authority to allow jamming.\" CTIA members AT&T and Verizon expressed their displeasure in separate comments to the FCC. \"The proposed legal framework is based on a flawed factual premise,\" AT&T wrote.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/prison-barbed-wire-1152x648-1767732268.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/prison-barbed-wire-1152x648-1767732268.jpg",
      "popularity_score": 308.9489966666667
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 18:59:21 +0000",
      "title": "News orgs win fight to access 20M ChatGPT logs. Now they want more.",
      "neutral_headline": "News orgs win fight to access 20M ChatGPT logs. Now they want more.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/news-orgs-want-openai-to-dig-up-millions-of-deleted-chatgpt-logs/",
          "published_at": "Tue, 06 Jan 2026 18:59:21 +0000",
          "title": "News orgs win fight to access 20M ChatGPT logs. Now they want more.",
          "standfirst": "OpenAI's loss in privacy fight could lead to sharing even more deleted chats.",
          "content": "Not only does it appear that OpenAI has lost its fight to keep news organizations from digging through 20 million ChatGPT logs to find evidence of copyright infringement—but also OpenAI now faces calls for sanctions and demands to retrieve and share potentially millions of deleted chats long thought of as untouchable in the litigation. On Monday, US District Judge Sidney Stein denied objections that OpenAI raised, claiming that Magistrate Judge Ona Wang failed to adequately balance the privacy interests of ChatGPT users who are not involved in the litigation when ordering OpenAI to produce 20 million logs. Instead, OpenAI wanted Stein to agree that it would be much less burdensome to users if OpenAI ran search terms to find potentially infringing outputs in the sample. That way, news plaintiffs would only get access to chats that were relevant to its case, OpenAI suggested.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1322146218-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1322146218-1152x648.jpg",
      "popularity_score": 301.73983
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 18:05:05 +0000",
      "title": "Appeals court agrees that Congress blocked cuts to research costs",
      "neutral_headline": "Appeals court agrees that Congress blocked cuts to research costs",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/appeals-court-upholds-block-on-one-of-trumps-cuts-to-research-funds/",
          "published_at": "Tue, 06 Jan 2026 18:05:05 +0000",
          "title": "Appeals court agrees that Congress blocked cuts to research costs",
          "standfirst": "The Trump admin can't arbitrarily set university reimbursements to a low flat rate.",
          "content": "One of the first signs of what would become an ongoing attack on scientific research came when the Trump administration ordered the National Institutes of Health (NIH) to radically reduce research funding for universities. These funds, termed indirect costs, are awarded when researchers at an institution receive a grant. They cover costs that aren't directly associated with the research project, such as utilities, facilities for research animals, and building maintenance. Previously, these costs had been the subject of negotiations and audits, with indirect cost rates for universities in more expensive locations exceeding half the value of the portion of the grant that goes to the researcher. The Trump administration wanted to cut this to a flat rate of 15 percent for everyone, which would be crippling for many universities. A number of states, later joined by organizations representing a broad array of universities and medical schools, immediately sued to block the policy change. A district court temporarily blocked the new policy from being implemented and later issued a permanent injunction. The government appealed that decision, but on Monday, an appeals court rejected the effort because the first Trump administration had attempted the same move before—and Congress passed a rule to block it. Indirect research funding will remain intact unless the Supreme Court intervenes.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2247954039-1152x648-1767719824.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2247954039-1152x648-1767719824.jpg",
      "popularity_score": 275.83538555555555
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 17:32:14 +0000",
      "title": "Nvidia’s new G-Sync Pulsar monitors target motion blur at the human retina level",
      "neutral_headline": "Nvidia’s new G-Sync Pulsar monitors target motion blur at the human retina level",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/nvidias-new-g-sync-pulsar-monitors-target-motion-blur-at-the-human-retina-level/",
          "published_at": "Tue, 06 Jan 2026 17:32:14 +0000",
          "title": "Nvidia’s new G-Sync Pulsar monitors target motion blur at the human retina level",
          "standfirst": "Four new monitors promise \"effective motion clarity of a theoretical 1,000 Hz monitor.\"",
          "content": "It's been almost exactly two years since Nvidia announced G-Sync Pulsar, its new backlight strobing technology designed to limit display motion blur caused by old images persisting on the viewer's retina. At the time, Nvidia said that technology would debut on Asus' ROG Swift PG27 Series monitors by the end of 2024. Nvidia now says the first four G-Sync Pulsar-powered monitors will be available at select retailers starting Wednesday. Those first Pulsar-equipped monitors will be: Acer's Predator XB273U F5 AOC's AGON PRO AG276QSG2 Asus' ROG Strix Pulsar XG27AQNGV MSI's MPG 272QRF X36 Making 360 Hz seem like more All four of the fresh Pulsar-enabled IPS monitors come in at 27 inches with 1440p resolution and up to 360 Hz refresh rates. But Nvidia says the integrated G-Sync Pulsar technology means each display has the \"effective motion clarity of a theoretical 1,000 Hz monitor.\"Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/pulsar2-1152x648-1767719933.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/pulsar2-1152x648-1767719933.png",
      "popularity_score": 271.28788555555553
    },
    {
      "id": "cluster_65",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 15:55:41 +0000",
      "title": "Ørsted seeks injunction against US government over project freeze",
      "neutral_headline": "Ørsted seeks injunction against US government over project freeze",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/orsted-seeks-injunction-against-us-government-over-project-freeze/",
          "published_at": "Tue, 06 Jan 2026 15:55:41 +0000",
          "title": "Ørsted seeks injunction against US government over project freeze",
          "standfirst": "Trump administration had suspended Danish group’s work on major wind farm off coast of Rhode Island.",
          "content": "Ørsted is seeking a court injunction against the Trump administration’s decision to suspend its work on a major wind farm project off the US northeast coast. In the latest salvo between the US government and the offshore wind industry, the Danish company filed a legal challenge against the suspension in the US District Court for the District of Columbia on Thursday. In a statement, Ørsted—the world’s largest offshore wind developer that is 50 percent owned by the Danish state—and its joint venture partner Skyborn Renewables, a unit of BlackRock’s Global Infrastructure Partners, said the US government’s order to suspend the lease on its Revolution Wind project was a violation of applicable law.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ftcms_ccff82e2-1b3f-4dd6-af31-3b7bbfffc992.avif"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ftcms_ccff82e2-1b3f-4dd6-af31-3b7bbfffc992.avif",
      "popularity_score": 268.6787188888889
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 15:49:36 +0000",
      "title": "Magneto, Xavier reunite in new Avengers: Doomsday teaser",
      "neutral_headline": "Magneto, Xavier reunite in new Avengers: Doomsday teaser",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/latest-avengers-doomsday-teaser-highlights-x-men/",
          "published_at": "Tue, 06 Jan 2026 15:49:36 +0000",
          "title": "Magneto, Xavier reunite in new Avengers: Doomsday teaser",
          "standfirst": "\"The question isn’t ‘are you prepared to die?’ The question is ‘who will you be when you close your eyes?’”",
          "content": "Marvel Studios continues to dribble out brief teasers promoting Avengers: Doomsday, which is slated for a December 2026 release—first playing in cinemas prior to Avatar: Fire and Ash screenings before becoming publicly available. We reported previously on the first, which featured Steve Rogers (Chris Evans), the former Captain America. Over the holidays, a second teaser highlighting Chris Hemsworth's Thor was released. Both are familiar faces in the MCU, but we now have a third teaser that brings in some new players. No, not Robert Downey Jr.'s Doctor Doom as rumored. Instead, we've got Magneto (Ian McKellen), Charles Xavier (Patrick Stewart), and Cyclops (James Marsden) from the X-Men franchise. The film takes place 14 months after the events of this year’s Thunderbolts*. In addition to Thor, we have the new Captain America (Anthony Mackie), Bucky Barnes (Sebastian Stan), Ant-Man (Paul Rudd), Falcon (Danny Ramirez), and Loki (Tom Hiddleston). Then there’s the Wakandan contingent: Shuri as the new Black Panther (Letitia Wright), M’Baku (Winston Duke), and Namor (Tenoch Huerta Mejia).Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/avenge2-1152x648-1767712126.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/avenge2-1152x648-1767712126.jpg",
      "popularity_score": 243.57733
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 03:45:49 +0000",
      "title": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process",
      "neutral_headline": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/intel-launches-core-ultra-series-3-cpus-made-using-its-long-awaited-18a-process/",
          "published_at": "Tue, 06 Jan 2026 03:45:49 +0000",
          "title": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process",
          "standfirst": "New chips launch \"this month,\" targeting high-end ultraportable PCs.",
          "content": "Intel will formally launch its first Core Ultra Series 3 laptop processors later this month, the company announced at its CES keynote today. Codenamed Panther Lake and targeted, at least for now, at high-end ultraportable PCs, the Core Ultra 3 chips will also be the first to use Intel's 18A manufacturing process, the company's effort to catch up with the chip manufacturing technology of Taiwan Semiconductor (TSMC). The launch will start with 14 chips across five product families, which Intel says will be used in \"over 200\" PC designs. The first of these will be available on January 27, with others following \"throughout the first half of this year.\" The Core Ultra X9 and Core Ultra X7 processors include all of Intel's latest CPU and GPU architectures, plus a fully enabled 12-core Intel Arc B390 integrated GPU and support for slightly faster LPDDR5x-9600. The Core Ultra 9 and 7 processors will use all of the same technologies, but with just four GPU cores and support for either LPDDR5x-8533 or DDR5-7200 DIMMs. But they will offer 20 PCI Express lanes, up from 12 for the X9 and X7, meaning they'll pair better with dedicated GPUs. The Core Ultra 5 chips are mostly lower-end models with fewer CPU cores, and either 4- or 2-core GPUs. But Intel being Intel, there is one oddball that muddies the waters: the Core Ultra 5 338H, which has 12 CPU cores and a 10-core Intel Arc B370 GPU. A Panther Lake refresher The higher-end Core Ultra Series 3 CPUs. Credit: Intel The Core Ultra 5 family encompasses a wide range of possible performance levels. Credit: Intel We wrote about the basic building blocks of Panther Lake when Intel released details late last year. In many ways the chip is a retreat from the Lunar Lake design, sold as Core Ultra 200V, which used chiplets manufactured mostly outside the company and on-package RAM rather than memory in a DIMM slot or soldered to the mainboard. At the time, Intel said these moves were made in the interest of saving power and extending battery life, as were decisions like removing Hyperthreading support from the P-cores.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Intel_CES_-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Intel_CES_-1152x648.jpeg",
      "popularity_score": 148
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 03:30:30 +0000",
      "title": "AMD reheats last year’s Ryzen AI and X3D CPUs for 2026’s laptops and desktops",
      "neutral_headline": "AMD reheats last year’s Ryzen AI and X3D CPUs for 2026’s laptops and desktops",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/amd-reheats-last-years-ryzen-ai-and-x3d-cpus-for-2026s-laptops-and-desktops/",
          "published_at": "Tue, 06 Jan 2026 03:30:30 +0000",
          "title": "AMD reheats last year’s Ryzen AI and X3D CPUs for 2026’s laptops and desktops",
          "standfirst": "But it may become slightly cheaper to buy AMD's fastest integrated Radeon GPUs.",
          "content": "Intel, AMD, Nvidia, and other chip companies usually have some kind of news to announce at CES to kick off the year, but some of those announcements are more interesting than others. Sometimes you see new chips with significant speed boosts and other new technologies, and sometimes you get rebranded versions of old silicon meant to fill out a lineup or make an existing architecture seem newer and more exciting than it is. AMD's Ryzen CPU announcements this year fall firmly into the latter camp—these are all gently tweaked variants of chips that launched in 2024 and 2025. \"New,\" for certain values of \"new\" These Ryzen AI 400-series chips are slightly faster than, but otherwise functionally identical to, the Ryzen AI 300 series. Credit: AMD Slightly higher CPU clock speeds, NPU speeds, and supported RAM speeds will separate Ryzen AI 400 from Ryzen AI 300. Credit: AMD Core specs for the new-ish chips. Credit: AMD The corresponding Ryzen Pro chips for business PCs. Credit: AMD Let's start with the Ryzen AI 400 series. Officially the follow-up to the Ryzen AI 300 chips announced in June 2024, these processors offer some modest clock speed improvements and faster memory support. The new Ryzen AI 9 HX 470 has a peak boost clock speed of 5.2 GHz and support for LPDDR5x-8533, for example, up from 5.1 GHz and LPDDR5x-8000 for the Ryzen AI 9 HX 370, and its built-in neural processing unit (NPU) is capable of 60 trillion operations per second (TOPS) rather than 50 TOPS.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Ryzen-AI-400-Series_05-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Ryzen-AI-400-Series_05-1152x648.jpeg",
      "popularity_score": 148
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 22:14:50 +0000",
      "title": "NASA’s science budget won’t be a train wreck after all",
      "neutral_headline": "NASA’s science budget won’t be a train wreck after all",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasas-science-budget-wont-be-a-train-wreck-after-all/",
          "published_at": "Mon, 05 Jan 2026 22:14:50 +0000",
          "title": "NASA’s science budget won’t be a train wreck after all",
          "standfirst": "\"There's very little to not like in this.\"",
          "content": "In June, the White House released a budget proposal for fiscal year 2026 that slashed funding for NASA's science programs by nearly 50 percent. Then, in July, the Trump administration began telling the leaders of dozens of space science missions to prepare \"closeout\" plans for their spacecraft. Things looked pretty grim for a while, but then Congress stepped in. Congress, of course, sets the federal government's budget. In many ways, Congress abdicated authority to the Trump administration last year. But not so, it turns out, with federal spending. Throughout the summer and fall, as the White House and Congress wrangled over various issues, lawmakers made it clear they intended to fund most of NASA's science portfolio. Preliminary efforts to shut down active missions were put on hold.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/50530415266_a67d907fac_b-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/50530415266_a67d907fac_b-1024x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 21:42:14 +0000",
      "title": "The nation’s strictest privacy law just took effect, to data brokers’ chagrin",
      "neutral_headline": "The nation’s strictest privacy law just took effect, to data brokers’ chagrin",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/data-broker-hoarding-is-rampant-new-law-lets-consumers-fight-back/",
          "published_at": "Mon, 05 Jan 2026 21:42:14 +0000",
          "title": "The nation’s strictest privacy law just took effect, to data brokers’ chagrin",
          "standfirst": "Californians can now submit demands requiring 500 brokers to delete their data.",
          "content": "Californians are getting a new, supercharged way to stop data brokers from hoarding and selling their personal information, as a recently enacted law that’s among the strictest in the nation took effect at the beginning of the year. According to the California Privacy Protection Agency, more than 500 companies actively scour all sorts of sources for scraps of information about individuals, then package and store it to sell to marketers, private investigators, and others. The nonprofit Consumer Watchdog said in 2024 that brokers trawl automakers, tech companies, junk-food restaurants, device makers, and others for financial info, purchases, family situations, eating, exercising, travel, entertainment habits, and just about any other imaginable information belonging to millions of people.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/04/data-leak-1000x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/04/data-leak-1000x648.jpeg",
      "popularity_score": 148
    },
    {
      "id": "cluster_97",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 20:38:48 +0000",
      "title": "Anna’s Archive loses .org domain, says suspension likely unrelated to Spotify piracy",
      "neutral_headline": "Anna’s Archive loses .org domain, says suspension likely unrelated to Spotify piracy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/annas-archive-loses-org-domain-says-suspension-likely-unrelated-to-spotify-piracy/",
          "published_at": "Mon, 05 Jan 2026 20:38:48 +0000",
          "title": "Anna’s Archive loses .org domain, says suspension likely unrelated to Spotify piracy",
          "standfirst": "\"We don't believe this has to do with our Spotify backup,\" Anna's Archive says.",
          "content": "The primary domain of Shadow library Anna's Archive was taken offline, with annas-archive.org being put under the serverHold status. While Anna's Archive recently made waves with a massive \"backup\" of Spotify, the shadow library's operator said the music pirating doesn't appear to be connected to the .org domain suspension. Anna's Archive remains available at several other domains. Anna's Archive launched in 2022 in response to the US Department of Justice seizure of domains used by e-book pirate site Z-Library. Acting as a shadow library and a search engine for other shadow libraries, Anna's Archive aims to archive books and other written materials and make them widely available via torrents. Its data sets have also been heavily used by AI companies to train large language models. In addition to mirroring shadow libraries such as Sci-Hub, Library Genesis, and Z-Library, Anna's Archive made a major move into music pirating two weeks ago with an announcement that it scraped Spotify and made a 300TB copy of the most streamed songs. Despite that development, the person behind Anna's Archive said the domain suspension doesn't seem to be related to the Spotify scraping.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spotify-logos-1152x648-1767642275.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spotify-logos-1152x648-1767642275.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 13:49:02 +0000",
      "title": "Spot the difference: Sony’s electric car gets a crossover version",
      "neutral_headline": "Spot the difference: Sony’s electric car gets a crossover version",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/sony-wants-its-afeela-ev-to-be-heavy-on-ai-also-shows-crossover/",
          "published_at": "Tue, 06 Jan 2026 13:49:02 +0000",
          "title": "Spot the difference: Sony’s electric car gets a crossover version",
          "standfirst": "AI will help drive you and entertain you, according to Sony Honda Mobility.",
          "content": "Six years after Sony announced its automotive ambitions, everything is looking a lot more concrete. Production of the Afeela 1, the electric sedan developed by Sony Honda Mobility, is already underway in Ohio. Deliveries will begin later this year in California, expanding to Arizona and Japan in 2027. And last night, on the eve of this year's Consumer Electronics Show, it even showed off a crossover version. \"The way we are fusing diverse technologies to deliver a completely novel mobility experience is not limited to a single model type,\" said Sony Honda Mobility CEO Yasuhide Mizuno. We first saw a Sony electric vehicle at CES in 2020 when the consumer electronics company showed off the Vision-S, telling the world it was mostly just a showcase for things like sensors and infotainment. Then the world caught a hot case of electric vehicle fever. Tesla's stock price went vertical, and the auto industry focused on EV optimism, even as a pandemic rewrote everyone's working rules.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/SHM_Press_Conference_Yasuhide-Mizuno_1-1152x648-1767701711.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/SHM_Press_Conference_Yasuhide-Mizuno_1-1152x648-1767701711.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 20:28:06 +0000",
      "title": "Stewart Cheifet, PBS host who chronicled the PC revolution, dies at 87",
      "neutral_headline": "Stewart Cheifet, PBS host who chronicled the PC revolution, dies at 87",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/stewart-cheifet-pbs-host-who-chronicled-the-pc-revolution-dies-at-87/",
          "published_at": "Mon, 05 Jan 2026 20:28:06 +0000",
          "title": "Stewart Cheifet, PBS host who chronicled the PC revolution, dies at 87",
          "standfirst": "Cheifet produced more than 400 episodes of TV tracing the rise of personal computing.",
          "content": "Stewart Cheifet, the television producer and host who documented the personal computer revolution for nearly two decades on PBS, died on December 28, 2025, at age 87 in Philadelphia. Cheifet created and hosted Computer Chronicles, which ran on the public television network from 1983 to 2002 and helped demystify a new tech medium for millions of American viewers. Computer Chronicles covered everything from the earliest IBM PCs and Apple Macintosh models to the rise of the World Wide Web and the dot-com boom. Cheifet conducted interviews with computing industry figures, including Bill Gates, Steve Jobs, and Jeff Bezos, while demonstrating hardware and software for a general audience. From 1983 to 1990, he co-hosted the show with Gary Kildall, the Digital Research founder who created the popular CP/M operating system that predated MS-DOS on early personal computer systems.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/cheifet_obit-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/cheifet_obit-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Tue, 06 Jan 2026 12:15:31 +0000",
      "title": "Private equity deal shows just how far America’s legacy rocket industry has fallen",
      "neutral_headline": "Private equity deal shows just how far America’s legacy rocket industry has fallen",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/a-private-equity-deal-reviving-rocketdyne-seems-more-like-a-corporate-breakup/",
          "published_at": "Tue, 06 Jan 2026 12:15:31 +0000",
          "title": "Private equity deal shows just how far America’s legacy rocket industry has fallen",
          "standfirst": "After peaking in the Cold War, the relic of Rocketdyne has changed ownership four times in 20 years.",
          "content": "If you are a student of space history or tracked the space industry before billionaires and venture capital changed it forever, you probably know the name Rocketdyne. A half-century ago, Rocketdyne manufactured almost all of the large liquid-fueled rocket engines in the United States. The Saturn V rocket that boosted astronauts toward the Moon relied on powerful engines developed by Rocketdyne, as did the Space Shuttle, the Atlas, Thor, and Delta rockets, and the US military's earliest ballistic missiles. Rocketdyne's dominance began to erode after the end of the Cold War. The company started in 1955 as a division of North American Aviation, then became part of Rockwell International until Boeing acquired Rockwell's aerospace division in 1996. Rocketdyne continually designed and tested large new rocket engines from the 1950s through the 1980s. Since then, Rocketdyne has developed and qualified just one large engine design from scratch—the RS-68—and it retired from service in 2024.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/6761894orig-1152x648-1767654223.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/6761894orig-1152x648-1767654223.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 21:57:07 +0000",
      "title": "Under anti-vaccine RFK Jr., CDC slashes childhood vaccine schedule",
      "neutral_headline": "Under anti-vaccine RFK Jr., CDC slashes childhood vaccine schedule",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/under-anti-vaccine-rfk-jr-cdc-slashes-childhood-vaccine-schedule/",
          "published_at": "Mon, 05 Jan 2026 21:57:07 +0000",
          "title": "Under anti-vaccine RFK Jr., CDC slashes childhood vaccine schedule",
          "standfirst": "The changes are modeled after a small country with universal health care.",
          "content": "Under anti-vaccine Health Secretary Robert F. Kennedy Jr., federal health officials on Monday announced a sweeping and unprecedented overhaul of federal vaccine recommendations, abruptly paring down recommended immunizations for children from 17 to 11. Officials claimed the rationale for the change was to align US vaccine recommendations more closely with those of other high-income countries, namely Denmark, a small, far less diverse country of around 6 million people (smaller than the population of New York City) that has universal health care. The officials also claim the change is necessary to address the decline in public trust in vaccinations, which has been driven by anti-vaccine activists, including Kennedy. \"This decision protects children, respects families, and rebuilds trust in public health,\" Kennedy said in a statement.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2252087162-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2252087162-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Mon, 05 Jan 2026 20:01:12 +0000",
      "title": "Amazon Alexa+ released to the general public via an early access website",
      "neutral_headline": "Amazon Alexa+ released to the general public via an early access website",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/amazon-alexa-released-to-the-general-public-via-an-early-access-website/",
          "published_at": "Mon, 05 Jan 2026 20:01:12 +0000",
          "title": "Amazon Alexa+ released to the general public via an early access website",
          "standfirst": "Amazon brings back browser-based Alexa but will eventually add a paywall.",
          "content": "Anyone can now try Alexa+, Amazon’s generative AI assistant, through a free early access program at Alexa.com. The website frees the AI, which Amazon released via early access in February, from hardware and makes it as easily accessible as more established chatbots, like OpenAI's ChatGPT and Google's Gemini. Until today, you needed a supporting device to access Alexa+. Amazon hasn’t said when the early access period will end, but when it does, Alexa+ will be included with Amazon Prime memberships, which start at $15 per month, or cost $20 per month on its own. The above pricing suggests that Amazon wants Alexa+ to drive people toward Prime subscriptions. By being interwoven with Amazon’s shopping ecosystem, including Amazon's e-commerce platform, grocery delivery business, and Whole Foods, Alexa+ can make more money for Amazon.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2201505743-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2201505743-1024x648.jpg",
      "popularity_score": 133
    }
  ]
}