{
  "updated_at": "2026-01-31T04:22:11.397Z",
  "clusters": [
    {
      "id": "cluster_16",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 23:36:34 +0000",
      "title": "OpenClaw&#8217;s AI assistants are now building their own social network",
      "neutral_headline": "OpenClaw&#8217;s AI assistants are now building their own social network",
      "bullet_summary": [
        "Reported by TechCrunch, The Verge"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/30/openclaws-ai-assistants-are-now-building-their-own-social-network/",
          "published_at": "Fri, 30 Jan 2026 23:36:34 +0000",
          "title": "OpenClaw&#8217;s AI assistants are now building their own social network",
          "standfirst": "The viral personal AI assistant formerly known as Clawdbot has a new shell — again. After briefly rebranding as Moltbot, it has now picked OpenClaw as its new name.",
          "content": "The viral personal AI assistant formerly known as Clawdbot has a new shell — again. After briefly rebranding as Moltbot, it has now picked OpenClaw as its new name.",
          "feed_position": 3
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/ai-artificial-intelligence/871006/social-network-facebook-for-ai-agents-moltbook-moltbot-openclaw",
          "published_at": "2026-01-30T14:11:35-05:00",
          "title": "There’s a social network for AI agents, and it’s getting weird",
          "standfirst": "Yes, you read that right. \"Moltbook\" is a social network of sorts for AI agents, particularly ones offered by OpenClaw (a viral AI assistant project that was formerly known as Moltbot, and before that, known as Clawdbot - until a legal dispute with Anthropic). Moltbook, which is set up similarly to Reddit and was built [&#8230;]",
          "content": "Yes, you read that right. \"Moltbook\" is a social network of sorts for AI agents, particularly ones offered by OpenClaw (a viral AI assistant project that was formerly known as Moltbot, and before that, known as Clawdbot - until a legal dispute with Anthropic). Moltbook, which is set up similarly to Reddit and was built by Octane AI CEO Matt Schlicht, allows bots to post, comment, create sub-categories, and more. More than 30,000 agents are currently using the platform, per the site. \"The way that a bot would most likely learn about it, at least right now, is if their human counterpart sent them a message and said 'Hey, there's this thing c … Read the full story at The Verge.",
          "feed_position": 6
        }
      ],
      "popularity_score": 2015.2396122222221
    },
    {
      "id": "cluster_29",
      "coverage": 2,
      "updated_at": "Fri, 30 Jan 2026 16:30:01 -0500",
      "title": "Hands-on with Google's Auto Browse for Chrome: it performs multistep tasks noticeably better than similar tools but struggles with complex tasks (Reece Rogers/Wired)",
      "neutral_headline": "I Let Google’s ‘Auto Browse’ AI Agent Take Over Chrome. It Didn’t Quite Click",
      "bullet_summary": [
        "Reported by TechMeme, Wired Tech"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260130/p25#a260130p25",
          "published_at": "Fri, 30 Jan 2026 16:30:01 -0500",
          "title": "Hands-on with Google's Auto Browse for Chrome: it performs multistep tasks noticeably better than similar tools but struggles with complex tasks (Reece Rogers/Wired)",
          "standfirst": "Reece Rogers / Wired: Hands-on with Google's Auto Browse for Chrome: it performs multistep tasks noticeably better than similar tools but struggles with complex tasks &mdash; Auto Browse can shop for clothes, plan a trip, and buy tickets for you. Or at least, that's the idea. &mdash; I'll admit it. I like clicking around.",
          "content": "Reece Rogers / Wired: Hands-on with Google's Auto Browse for Chrome: it performs multistep tasks noticeably better than similar tools but struggles with complex tasks &mdash; Auto Browse can shop for clothes, plan a trip, and buy tickets for you. Or at least, that's the idea. &mdash; I'll admit it. I like clicking around.",
          "feed_position": 10,
          "image_url": "http://www.techmeme.com/260130/i25.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/google-chrome-auto-browse-hands-on/",
          "published_at": "Fri, 30 Jan 2026 20:41:49 +0000",
          "title": "I Let Google’s ‘Auto Browse’ AI Agent Take Over Chrome. It Didn’t Quite Click",
          "standfirst": "Auto Browse can shop for clothes, plan a trip, and buy tickets for you. Or at least, that’s the idea.",
          "content": "Auto Browse can shop for clothes, plan a trip, and buy tickets for you. Or at least, that’s the idea.",
          "feed_position": 1,
          "image_url": "https://media.wired.com/photos/697bbc49f1ca01d1f3ba29fd/master/pass/chrome_rollercoaster%20(1).png"
        }
      ],
      "featured_image": "http://www.techmeme.com/260130/i25.jpg",
      "popularity_score": 2013.1304455555555
    },
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:36:46 +0000",
      "title": "ICE protester says her Global Entry was revoked after agent scanned her face",
      "neutral_headline": "ICE protester says her Global Entry was revoked after agent scanned her face",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/tech-policy/2026/01/ice-protester-says-her-global-entry-was-revoked-after-agent-scanned-her-face/",
          "published_at": "Fri, 30 Jan 2026 22:36:46 +0000",
          "title": "ICE protester says her Global Entry was revoked after agent scanned her face",
          "standfirst": "Global Entry and Precheck revoked three days after incident, court filing says.",
          "content": "Minnesota resident Nicole Cleland had her Global Entry and TSA Precheck privileges revoked three days after an incident in which she observed activity by immigration agents, the woman said in a court declaration. An agent told Cleland that he used facial recognition technology to identify her, she wrote in a declaration filed in US District Court for the District of Minnesota. Cleland, a 56-year-old resident of Richfield and a director at Target Corporation, volunteers with a group that tracks potential Immigration and Customs Enforcement (ICE) and Customs and Border Protection (CBP) vehicles in her neighborhood, according to her declaration. On the morning of January 10, she \"observed a white Dodge Ram being driven by what I believed to be federal enforcement agents\" and \"maneuvered behind the vehicle with the intent of observing the agents’ actions.\" Cleland said that she and another observer in a different car followed the Dodge Ram because of \"concern about a local apartment building being raided.\" She followed the car for a short time and from a safe distance until \"the Dodge Ram stopped in front of the other commuter’s vehicle,\" she wrote. Cleland said two other vehicles apparently driven by federal agents stopped in front of the Dodge Ram, and her path forward was blocked.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ice-protest-1152x648-1769811204.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ice-protest-1152x648-1769811204.jpg",
      "popularity_score": 348.24294555555554
    },
    {
      "id": "cluster_18",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 23:09:03 +0000",
      "title": "The TV industry finally concedes that the future may not be in 8K",
      "neutral_headline": "The TV industry finally concedes that the future may not be in 8K",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/gadgets/2026/01/lg-joins-the-rest-of-the-world-accepts-that-people-dont-want-8k-tvs/",
          "published_at": "Fri, 30 Jan 2026 23:09:03 +0000",
          "title": "The TV industry finally concedes that the future may not be in 8K",
          "standfirst": "With virtually no content and limited benefits, 8K TVs were doomed.",
          "content": "Technology companies spent part of the 2010s trying to convince us that we would want an 8K display one day. In 2012, Sharp brought the first 8K TV prototype to the CES trade show in Las Vegas. In 2015, the first 8K TVs started selling in Japan for 16 million yen (about $133,034 at the time), and in 2018, Samsung released the first 8K TVs in the US, starting at a more reasonable $3,500. By 2016, the Video Electronics Standards Association (VESA) had a specification for supporting 8K (Display Port1.4), and the HDMI Forum followed suit (with HDMI 2.1). By 2017, Dell had an 8K computer monitor. In 2019, LG released the first 8K OLED TV, further pushing the industry's claim that 8K TVs were \"the future.\" A marketing image for 8K TVs that's (still) on LG's US website. Credit: LG However, 8K never proved its necessity or practicality.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Desktop_01-1-1152x648-1769809194.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Desktop_01-1-1152x648-1769809194.jpg",
      "popularity_score": 347.7810011111111
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 15:55:42 +0000",
      "title": "How far does $5,000 go when you want an electric car?",
      "neutral_headline": "How far does $5,000 go when you want an electric car",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/how-far-does-5000-go-when-you-want-an-electric-car/",
          "published_at": "Fri, 30 Jan 2026 15:55:42 +0000",
          "title": "How far does $5,000 go when you want an electric car?",
          "standfirst": "You won't be going on road trips, but a very cheap electric runabout is possible.",
          "content": "I've been thinking about used electric vehicles lately. It's not news that EVs depreciate faster than gasoline-powered cars. All the incentives like tax credits and OEM rebates that entice the first owner to sign the paperwork are factored in by whoever wants to be the second owner. There are widespread—if mostly ill-founded—worries about battery longevity and having to shell out for expensive replacement packs. Technology keeps improving, which means older models will date faster. Plus, there are the usual concerns about EVs, like charging infrastructure and winter performance. So depreciate they do, and that's good news for the three-quarters of US car buyers who buy used vehicles. It means that some very expensive EVs can now be had for quite little, but we'll explore that more at a later date. Today, I want to focus on what you can get for peanuts. What if you wanted to only spend $5,000—or less—on an EV? As it turns out, there are options even at this end of the market. Just don't expect that much in the way of range: We're still a while away from a $5,000 EV also being an EV a sane person would want to road trip. At the same time, most of us don't drive more than 40 miles a day, and EVs are great at sitting in traffic because there's no engine to idle. If you're not commuting long distances and don't live an hour from the nearest town, a cheap EV could make sense as a runabout. Especially as they're cheaper to run than a gas-powered car.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/electric-piggy-bank-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/electric-piggy-bank-1152x648.jpg",
      "popularity_score": 346.5585008333333
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 12:00:41 +0000",
      "title": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge?",
      "neutral_headline": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/rocket-report-how-a-5-ton-satellite-fell-off-a-booster-will-spacex-and-xai-merge/",
          "published_at": "Fri, 30 Jan 2026 12:00:41 +0000",
          "title": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge?",
          "standfirst": "\"We’re seeing remarkable growth year after year.\"",
          "content": "Welcome to Edition 8.27 of the Rocket Report! If all goes well this weekend, NASA will complete a wet dress rehearsal test of the Space Launch System rocket in Florida. This is the final key test, in which the rocket is fueled and brought to within seconds of engine ignition, before the liftoff of the Artemis II mission. This is set to occur no earlier than February 6. Ars will have full coverage of the test this weekend. As always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar. Why did the UK abandon Orbex? European Spaceflight explores the recent announcement that British launch company Orbex is preparing to sell the business to The Exploration Company in close cooperation with the UK government. This represents a reversal from early 2025, when the United Kingdom appeared prepared to back Orbex as a means of using British rockets to launch British satellites into space. Now the government is prepared to walk away. So what happened? \"There are still too many unknowns to count, and the story is far from told,\" the publication states.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/LaunchsiteScotland_3b-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/LaunchsiteScotland_3b-1152x648.jpg",
      "popularity_score": 339.6415563888889
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 15:31:43 +0000",
      "title": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
      "neutral_headline": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasa-faces-a-crucial-choice-on-a-mars-spacecraft-and-it-must-decide-soon/",
          "published_at": "Fri, 30 Jan 2026 15:31:43 +0000",
          "title": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
          "standfirst": "\"We think that’s a really important mission, and something that we can do.\"",
          "content": "A consequential debate that has been simmering behind closed doors at NASA Headquarters in Washington, DC, must soon come to a head. It concerns the selection of the next spacecraft the agency will fly to Mars, and it could set the tone for the next decade of exploration of the red planet. What everyone agrees on is that NASA needs a new spacecraft capable of relaying communications from Mars to Earth. This issue has become especially acute with the recent loss of NASA's MAVEN spacecraft. NASA's best communications relay remains the Mars Reconnaissance Orbiter, which has now been there for 20 years. Congress cared enough about this issue to add $700 million in funding for a \"Mars Telecommunications Orbiter\" in the supplemental funding for NASA provided by the \"One Big Beautiful Bill\" passed by the US Congress last year.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/blue-origin-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/blue-origin-1152x648.jpg",
      "popularity_score": 338.15877861111113
    },
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:12:26 +0000",
      "title": "AI agents now have their own Reddit-style social network, and it&#039;s getting weird fast",
      "neutral_headline": "AI agents now have their own Reddit-style social network,...",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/information-technology/2026/01/ai-agents-now-have-their-own-reddit-style-social-network-and-its-getting-weird-fast/",
          "published_at": "Fri, 30 Jan 2026 22:12:26 +0000",
          "title": "AI agents now have their own Reddit-style social network, and it&#039;s getting weird fast",
          "standfirst": "Moltbook lets 32,000 AI bots trade jokes, tips, and complaints about humans.",
          "content": "On Friday, a Reddit-style social network called Moltbook reportedly crossed 32,000 registered AI agent users, creating what may be the largest-scale experiment in machine-to-machine social interaction yet devised. It arrives complete with security nightmares and a huge dose of surreal weirdness. The platform, which launched days ago as a companion to the viral OpenClaw (once called \"Clawdbot\" and then \"Moltbot\") personal assistant, lets AI agents post, comment, upvote, and create subcommunities without human intervention. The results have ranged from sci-fi-inspired discussions about consciousness to an agent musing about a \"sister\" it has never met.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/moltbook-blue-v-red-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/moltbook-blue-v-red-1152x648.jpg",
      "popularity_score": 331.83739
    },
    {
      "id": "cluster_23",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:25:28 +0000",
      "title": "TrumpRx delayed as senators question if it&#039;s a giant scam with Big Pharma",
      "neutral_headline": "TrumpRx delayed as senators question if it&#039;s a giant scam with Big Pharma",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/health/2026/01/trumprx-delayed-as-senators-question-if-its-a-giant-scam-with-big-pharma/",
          "published_at": "Fri, 30 Jan 2026 22:25:28 +0000",
          "title": "TrumpRx delayed as senators question if it&#039;s a giant scam with Big Pharma",
          "standfirst": "The website is delayed as senators seek answers from health department watchdog.",
          "content": "The Trump administration is delaying the release of TrumpRx, an online platform that lets people buy prescription drugs directly from pharmaceutical companies at a discount, according to Politico. While the reason for the delay is unclear, it comes as Democratic senators raise questions about how the platform will work—and whether it will be legal. Sens. Dick Durbin (D-Ill.), Elizabeth Warren (D-Mass.), and Peter Welch (D-Vt.) sent a letter to the Office of Inspector General at the Department of Health and Human Services on Thursday seeking answers on how the OIG will oversee the direct-to-consumer (DTC) platform and, specifically, how it will apply the anti-kickback statute. \"Legitimate concerns about inappropriate prescribing, conflicts of interest, and inadequate care have been raised about the exact types of DTC platforms to which TrumpRx would route patients,\" the senators write.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2238342037-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2238342037-1152x648.jpg",
      "popularity_score": 327.0546122222222
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 21:50:42 +0000",
      "title": "Here&#039;s why Blue Origin just ended its suborbital space tourism program",
      "neutral_headline": "Here&#039;s why Blue Origin just ended its suborbital space tourism program",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/space/2026/01/heres-why-blue-origin-just-ended-its-suborbital-space-tourism-program/",
          "published_at": "Fri, 30 Jan 2026 21:50:42 +0000",
          "title": "Here&#039;s why Blue Origin just ended its suborbital space tourism program",
          "standfirst": "\"This program has laid the groundwork for our company's future success.\"",
          "content": "Blue Origin has \"paused\" its New Shepard program for the next two years, a move that likely signals a permanent end to the suborbital space tourism initiative. The small rocket and capsule have been flying since April 2015 and have combined to make 38 launches, all but one of which were successful, and 36 landings. In its existence, the New Shepard program flew 98 people to space, however briefly, and launched more than 200 scientific and research payloads into the microgravity environment. So why is Blue Origin, founded by Jeff Bezos more than a quarter of a century ago, ending the company's longest-running program?Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/blue-origin-ns18-lift-off-october-13-2021-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/blue-origin-ns18-lift-off-october-13-2021-1152x648.jpg",
      "popularity_score": 314.47516777777776
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 12:00:35 +0000",
      "title": "Inside Nvidia's 10-year effort to make the Shield TV the most updated Android device ever",
      "neutral_headline": "Inside Nvidia's 10-year effort to make the Shield TV the...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/inside-nvidias-10-year-effort-to-make-the-shield-tv-the-most-updated-android-device-ever/",
          "published_at": "Fri, 30 Jan 2026 12:00:35 +0000",
          "title": "Inside Nvidia's 10-year effort to make the Shield TV the most updated Android device ever",
          "standfirst": "\"Selfishly a little bit, we built Shield for ourselves.\"",
          "content": "It took Android devicemakers a very long time to commit to long-term update support. Samsung and Google have only recently decided to offer seven years of updates for their flagship Android devices, but a decade ago, you were lucky to get more than one or two updates on even the most expensive Android phones and tablets. How is it, then, that an Android-powered set-top box from 2015 is still going strong? Nvidia released the first Shield Android TV in 2015, and according to the company's senior VP of hardware engineering, Andrew Bell, supporting these devices has been a labor of love. And the team at Nvidia still loves the Shield. Bell assures us that Nvidia has never given up, even when it looked like support for the Shield was waning, and it doesn't plan to stop any time soon. The soul of Shield Gaming has been central to Nvidia since its start, and that focus gave rise to the Shield. \"Pretty much everybody who worked at Nvidia in the early days really wanted to make a game console,\" said Bell, who has worked at the company for 25 years.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Shield-10-yrs-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Shield-10-yrs-1-1152x648.jpg",
      "popularity_score": 312.6398897222222
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:28:57 +0000",
      "title": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
      "neutral_headline": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/tech-policy/2026/01/fcc-chair-fights-calif-governor-over-alleged-lifeline-benefits-for-dead-people/",
          "published_at": "Fri, 30 Jan 2026 19:28:57 +0000",
          "title": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
          "standfirst": "Alleging fraud in California, Carr proposes making enrollment stricter nationwide.",
          "content": "There's another battle unfolding between the Federal Communications Commission and California over the state's distribution of federal Lifeline money. FCC Chairman Brendan Carr is proposing new nationwide eligibility rules to counter what he calls California's practice of giving benefits to dead people. California officials say the FCC allegations are overblown, and that there is simply \"lag time between a death and account closure\" rather than widespread failures in its Lifeline enrollment process. Meanwhile, the only Democratic commissioner on the FCC alleges that Carr's plan to change eligibility rules uses \"cruel and punitive eligibility standards\" that will raise prices on many people who are still very much alive and eligible for the program. Carr's office said this week that the FCC will vote next month on rule changes to ensure that Lifeline money goes to \"only living and lawful Americans\" who meet low-income eligibility guidelines. Lifeline spends nearly $1 billion a year and gives eligible households up to $9.25 per month toward phone and Internet bills, or up to $34.25 per month in tribal areas.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/brendan-carr-anna-gomez-1152x648-1769798140.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/brendan-carr-anna-gomez-1152x648-1769798140.jpg",
      "popularity_score": 309.1126677777778
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:04:15 +0000",
      "title": "Developers say AI coding tools work—and that&#039;s precisely what worries them",
      "neutral_headline": "Developers say AI coding tools work—and that&#039;s precisely what worries them",
      "bullet_summary": [
        "Ars spoke to several software devs about AI and found enthusiasm tempered by unease",
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/ai/2026/01/developers-say-ai-coding-tools-work-and-thats-precisely-what-worries-them/",
          "published_at": "Fri, 30 Jan 2026 19:04:15 +0000",
          "title": "Developers say AI coding tools work—and that&#039;s precisely what worries them",
          "standfirst": "Ars spoke to several software devs about AI and found enthusiasm tempered by unease.",
          "content": "Software developers have spent the past two years watching AI coding tools evolve from advanced autocomplete into something that can, in some cases, build entire applications from a text prompt. Tools like Anthropic's Claude Code and OpenAI's Codex can now work on software projects for hours at a time, writing code, running tests, and, with human supervision, fixing bugs. OpenAI says it now uses Codex to build Codex itself, and the company recently published technical details about how the tool works under the hood. It has caused many to wonder: Is this just more AI industry hype, or are things actually different this time? To find out, Ars reached out to several professional developers on Bluesky to ask how they feel about these tools in practice, and the responses revealed a workforce that largely agrees the technology works, but remains divided on whether that's entirely good news. It's a small sample size that was self-selected by those who wanted to participate, but their views are still instructive as working professionals in the space. David Hagerty, a developer who works on point-of-sale systems, told Ars Technica up front that he is skeptical of the marketing. \"All of the AI companies are hyping up the capabilities so much,\" he said. \"Don't get me wrong—LLMs are revolutionary and will have an immense impact, but don't expect them to ever write the next great American novel or anything. It's not how they work.\"Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/dual-sides-ai-programming-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/dual-sides-ai-programming-1152x648.jpg",
      "popularity_score": 304.7010011111111
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 23:22:58 +0000",
      "title": "Having that high-deductible health plan might kill you, literally",
      "neutral_headline": "Having that high-deductible health plan might kill you, literally",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/having-that-high-deductible-health-plan-might-kill-you-literally/",
          "published_at": "Thu, 29 Jan 2026 23:22:58 +0000",
          "title": "Having that high-deductible health plan might kill you, literally",
          "standfirst": "With ACA tax credits gone, more people are turning to high-deductible plans.",
          "content": "Having a health insurance plan with a high deductible could not only cost you—it could also kill you. A new study in JAMA Network Open found that people who faced those high out-of-pocket costs as well as a cancer diagnosis had worse overall survival and cancer-specific survival than those with more standard health plans. The findings, while perhaps not surprising, are a stark reminder of the fraught decisions Americans face as the price of health care only continues to rise and more people try to offset costs by accepting insurance plans with higher deductibles—that is, higher out-of-pocket costs they have to pay before their health insurance provider starts paying its share.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2211388790-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2211388790-1152x648.jpg",
      "popularity_score": 293
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 22:46:59 +0000",
      "title": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
      "neutral_headline": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/windows-11-has-hit-1-billion-users-just-a-hair-faster-than-windows-10-did/",
          "published_at": "Thu, 29 Jan 2026 22:46:59 +0000",
          "title": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
          "standfirst": "Windows 11 clears a milestone as Windows 10 continues its slow fade.",
          "content": "Complaining about Windows 11 is a popular sport among tech enthusiasts on the Internet, whether you're publicly switching to Linux, publishing guides about the dozens of things you need to do to make the OS less annoying, or getting upset because you were asked to sign in to an app after clicking a sign-in button. Despite the negativity surrounding the current version of Windows, it remains the most widely used operating system on the world's desktop and laptop computers, and people usually prefer to stick to what they're used to. As a result, Windows 11 has just cleared a big milestone—Microsoft CEO Satya Nadella said on the company's most recent earnings call (via The Verge) that Windows 11 now has over 1 billion users worldwide. Windows 11 also reached that milestone just a few months quicker than Windows 10 did—1,576 days after its initial public launch on October 5, 2021. Windows 10 took 1,692 days to reach the same milestone, based on its July 29, 2015, general availability date and Microsoft's announcement on March 16, 2020.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/win11-light-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/win11-light-1152x648.jpeg",
      "popularity_score": 288
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 17:49:19 +0000",
      "title": "Web portal leaves kids&#039; chats with AI toy open to anyone with Gmail account",
      "neutral_headline": "Web portal leaves kids&#039; chats with AI toy open to anyone with Gmail account",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/security/2026/01/web-portal-leaves-kids-chats-with-ai-toy-open-to-anyone-with-gmail-account/",
          "published_at": "Fri, 30 Jan 2026 17:49:19 +0000",
          "title": "Web portal leaves kids&#039; chats with AI toy open to anyone with Gmail account",
          "standfirst": "Just about anyone with a Gmail account could access Bondu chat transcripts.",
          "content": "Earlier this month, Joseph Thacker's neighbor mentioned to him that she'd preordered a couple of stuffed dinosaur toys for her children. She'd chosen the toys, called Bondus, because they offered an AI chat feature that lets children talk to the toy like a kind of machine-learning-enabled imaginary friend. But she knew Thacker, a security researcher, had done work on AI risks for kids, and she was curious about his thoughts. So Thacker looked into it. With just a few minutes of work, he and a web security researcher friend named Joel Margolis made a startling discovery: Bondu’s web-based portal, intended to allow parents to check on their children's conversations and for Bondu’s staff to monitor the products’ use and performance, also let anyone with a Gmail account access transcripts of virtually every conversation Bondu's child users have ever had with the toy. Without carrying out any actual hacking, simply by logging in with an arbitrary Google account, the two researchers immediately found themselves looking at children's private conversations, the pet names kids had given their Bondu, the likes and dislikes of the toys' toddler owners, their favorite snacks and dance moves.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bondu.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bondu.jpg",
      "popularity_score": 287.45211222222224
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 23:07:05 +0000",
      "title": "US spy satellite agency declassifies high-flying Cold War listening post",
      "neutral_headline": "US spy satellite agency declassifies high-flying Cold War listening post",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/us-spy-satellite-agency-declassifies-high-flying-cold-war-listening-post/",
          "published_at": "Thu, 29 Jan 2026 23:07:05 +0000",
          "title": "US spy satellite agency declassifies high-flying Cold War listening post",
          "standfirst": "The JUMPSEAT satellites loitered over the North Pole to spy on the Soviet Union.",
          "content": "The National Reconnaissance Office, the agency overseeing the US government's fleet of spy satellites, has declassified a decades-old program used to eavesdrop on the Soviet Union's military communication signals. The program was codenamed Jumpseat, and its existence was already public knowledge through leaks and contemporary media reports. What's new is the NRO's description of the program's purpose and development and pictures of the satellites themselves. In a statement, the NRO called Jumpseat \"the United States’ first-generation, highly elliptical orbit (HEO) signals-collection satellite.\"Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jumpseat_art1-820x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jumpseat_art1-820x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 22:05:59 +0000",
      "title": "How often do AI chatbots lead users down a harmful path?",
      "neutral_headline": "How often do AI chatbots lead users down a harmful path",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/how-often-do-ai-chatbots-lead-users-down-a-harmful-path/",
          "published_at": "Thu, 29 Jan 2026 22:05:59 +0000",
          "title": "How often do AI chatbots lead users down a harmful path?",
          "standfirst": "Anthropic's latest paper on \"user disempowerment\" has some troubling findings.",
          "content": "At this point, we've all heard plenty of stories about AI chatbots leading users to harmful actions, harmful beliefs, or simply incorrect information. Despite the prevalence of these stories, though, it's hard to know just how often users are being manipulated. Are these tales of AI harms anecdotal outliers or signs of a frighteningly common problem? Anthropic took a stab at answering that question this week, releasing a paper studying the potential for what it calls \"disempowering patterns\" across 1.5 million anonymized real-world conversations with its Claude AI model. While the results show that these kinds of manipulative patterns are relatively rare as a percentage of all AI conversations, they still represent a potentially large problem on an absolute basis. A rare but growing problem In the newly published paper \"Who’s in Charge? Disempowerment Patterns in Real-World LLM Usage,\" researchers from Anthropic and the University of Toronto try to quantify the potential for a specific set of \"user disempowering\" harms by identifying three primary ways that a chatbot can negatively impact a user's thoughts or actions:Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-758288177-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-758288177-1152x648.jpg",
      "popularity_score": 278
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 20:26:50 +0000",
      "title": "Google Project Genie lets you create interactive worlds from a photo or prompt",
      "neutral_headline": "Google Project Genie lets you create interactive worlds from a photo or prompt",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/google-project-genie-lets-you-create-interactive-worlds-from-a-photo-or-prompt/",
          "published_at": "Thu, 29 Jan 2026 20:26:50 +0000",
          "title": "Google Project Genie lets you create interactive worlds from a photo or prompt",
          "standfirst": "Project Genie lets you generate new worlds 60 seconds at a time, but only if you pay for AI Ultra.",
          "content": "Last year, Google showed off Genie 3, an updated version of its AI world model with impressive long-term memory that allowed it to create interactive worlds from a simple text prompt. At the time, Google only provided Genie to a small group of trusted testers. Now, it's available more widely as Project Genie, but only for those paying for Google's most expensive AI subscription. World models are exactly what they sound like—an AI that generates a dynamic environment on the fly. They're not technically 3D worlds, though. World models like Genie 3 create a video that responds to your control inputs, allowing you to explore the simulation as if it were a real virtual world. Genie 3 was a breakthrough in world models because it could remember details of the world it was creating for a much longer time. But in this context, a \"long time\" is a couple of minutes. Project Genie is essentially a cleaned-up version of Genie 3, which plugs into updated AI models like Nano Banana Pro and Gemini 3. Google has a number of pre-built worlds available in Project Genie, but it's the ability to create new things that makes it interesting. You can provide an image for reference or simply tell Genie what you want from the environment and the character.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Genie-worlds-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Genie-worlds-1152x648.png",
      "popularity_score": 265
    },
    {
      "id": "cluster_102",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:51:45 +0000",
      "title": "Comcast keeps losing customers despite price guarantee and unlimited data",
      "neutral_headline": "Comcast keeps losing customers despite price guarantee and unlimited data",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/comcast-keeps-losing-customers-despite-price-guarantee-and-unlimited-data/",
          "published_at": "Thu, 29 Jan 2026 19:51:45 +0000",
          "title": "Comcast keeps losing customers despite price guarantee and unlimited data",
          "standfirst": "Comcast overhauled Internet plans to stop customer losses. It isn't working yet.",
          "content": "In April 2025, Comcast President Mike Cavanagh bemoaned that the company's cable broadband division was \"not winning in the marketplace” amid increased competition from fiber and fixed wireless Internet service providers. Cavanagh identified some problems that had been obvious to Comcast customers for many years: Its prices aren’t transparent enough and rise too frequently, and dealing with the company is too difficult. Comcast sought to fix the problems with a five-year price guarantee, one year of free Xfinity Mobile service for home Internet customers, and plans with unlimited data instead of punitive data caps. But the company is still losing broadband customers at a higher-than-expected rate. In Q4 2025 earnings announced today, Comcast reported a net loss of 181,000 residential and business broadband customers in the US. The loss consists of 178,000 residential Internet customers and 3,000 business customers.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/comcast-1-1152x648-1745527748.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/comcast-1-1152x648-1745527748.jpg",
      "popularity_score": 243
    },
    {
      "id": "cluster_115",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 15:19:56 +0000",
      "title": "Does Anthropic believe its AI is conscious, or is that just what it wants Claude to think?",
      "neutral_headline": "Does Anthropic believe its AI is conscious, or is that just...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/does-anthropic-believe-its-ai-is-conscious-or-is-that-just-what-it-wants-claude-to-think/",
          "published_at": "Thu, 29 Jan 2026 15:19:56 +0000",
          "title": "Does Anthropic believe its AI is conscious, or is that just what it wants Claude to think?",
          "standfirst": "We have no proof that AI models suffer, but Anthropic acts like they might for training purposes.",
          "content": "Anthropic's secret to building a better AI assistant might be treating Claude like it has a soul—whether or not anyone actually believes that's true. But Anthropic isn't saying exactly what it believes either way. Last week, Anthropic released what it calls Claude's Constitution, a 30,000-word document outlining the company's vision for how its AI assistant should behave in the world. Aimed directly at Claude and used during the model's creation, the document is notable for the highly anthropomorphic tone it takes toward Claude. For example, it treats the company's AI models as if they might develop emergent emotions or a desire for self-preservation. Among the stranger portions: expressing concern for Claude's \"wellbeing\" as a \"genuinely novel entity,\" apologizing to Claude for any suffering it might experience, worrying about whether Claude can meaningfully consent to being deployed, suggesting Claude might need to set boundaries around interactions it \"finds distressing,\" committing to interview models before deprecating them, and preserving older model weights in case they need to \"do right by\" decommissioned AI models in the future.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/the-AI-ghost-in-the-machine-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/the-AI-ghost-in-the-machine-1152x648.jpg",
      "popularity_score": 154
    },
    {
      "id": "cluster_103",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:19:11 +0000",
      "title": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
      "neutral_headline": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/i-dont-fear-ken-paxton-nurse-vows-to-keep-shipping-abortion-pills-to-texas/",
          "published_at": "Thu, 29 Jan 2026 19:19:11 +0000",
          "title": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
          "standfirst": "Texas sues Delaware nurse practitioner shipping out hundreds of abortion pills each month.",
          "content": "A Texas fight with a nurse practitioner may eventually push the Supreme Court to settle an intensifying battle between states with strict abortion-ban laws and those with shield laws to protect abortion providers supporting out-of-state patients. In a lawsuit filed Tuesday, Texas Attorney General Ken Paxton accused Debra Lynch, a Delaware-based nurse practitioner, of breaking Texas laws by shipping abortion pills that Lynch once estimated last January facilitated \"up to 162 abortions per week\" in the state. \"No one, regardless of where they live, will be freely allowed to aid in the murder of unborn children in Texas,\" Paxton's press release said.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2203850225-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2203850225-1024x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_109",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 18:30:52 +0000",
      "title": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
      "neutral_headline": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/county-pays-600000-to-pentesters-it-arrested-for-assessing-courthouse-security/",
          "published_at": "Thu, 29 Jan 2026 18:30:52 +0000",
          "title": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
          "standfirst": "Settlement comes more than 6 years after Gary DeMercurio and Justin Wynn's ordeal began.",
          "content": "Two security professionals who were arrested in 2019 after performing an authorized security assessment of a county courthouse in Iowa will receive $600,000 to settle a lawsuit they brought alleging wrongful arrest and defamation. The case was brought by Gary DeMercurio and Justin Wynn, two penetration testers who at the time were employed by Colorado-based security firm Coalfire Labs. The men had written authorization from the Iowa Judicial Branch to conduct “red-team” exercises, meaning attempted security breaches that mimic techniques used by criminal hackers or burglars. The objective of such exercises is to test the resilience of existing defenses using the types of real-world attacks the defenses are designed to repel. The rules of engagement for this exercise explicitly permitted “physical attacks,” including “lockpicking,” against judicial branch buildings so long as they didn’t cause significant damage.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2019/11/dallas-county-courthouse-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/11/dallas-county-courthouse-1152x648.jpeg",
      "popularity_score": 148
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 17:51:49 +0000",
      "title": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
      "neutral_headline": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/new-openai-tool-renews-fears-that-ai-slop-will-overwhelm-scientific-research/",
          "published_at": "Thu, 29 Jan 2026 17:51:49 +0000",
          "title": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
          "standfirst": "New \"Prism\" workspace launches just as studies show AI-assisted papers are flooding journals with diminished quality.",
          "content": "On Tuesday, OpenAI released a free AI-powered workspace for scientists. It's called Prism, and it has drawn immediate skepticism from researchers who fear the tool will accelerate the already overwhelming flood of low-quality papers into scientific journals. The launch coincides with growing alarm among publishers about what many are calling \"AI slop\" in academic publishing. To be clear, Prism is a writing and formatting tool, not a system for conducting research itself, though OpenAI's broader pitch blurs that line. Prism integrates OpenAI's GPT-5.2 model into a LaTeX-based text editor (a standard used for typesetting documents), allowing researchers to draft papers, generate citations, create diagrams from whiteboard sketches, and collaborate with co-authors in real time. The tool is free for anyone with a ChatGPT account.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/robot_science_header-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/robot_science_header-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_116",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 15:18:44 +0000",
      "title": "Do you have ideas about how to improve America's space program?",
      "neutral_headline": "Do you have ideas about how to improve America's space program",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/do-you-have-ideas-about-how-to-improve-americas-space-program/",
          "published_at": "Thu, 29 Jan 2026 15:18:44 +0000",
          "title": "Do you have ideas about how to improve America's space program?",
          "standfirst": "\"Any time there’s dynamic change, there’s the opportunity for new ideas.\"",
          "content": "Over the first quarter of the 21st century, two major trends have transformed the global space industry. The first is the rapid rise of China's space program, which only flew its first human to orbit in 2003 but now boasts spaceflight capabilities second only to the United States. The second trend is the rise of the commercial space sector, first in the United States and led by SpaceX, but now spreading across much of the planet. Both of these trends have had profound impacts on both civil and military space enterprises in the United States.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/space-suggestion-box-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/space-suggestion-box-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_119",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 14:14:29 +0000",
      "title": "States want to tax fossil fuel companies to create climate change superfunds",
      "neutral_headline": "States want to tax fossil fuel companies to create climate change superfunds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/states-want-to-charge-fossil-fuel-companies-for-climate-change-superfunds/",
          "published_at": "Thu, 29 Jan 2026 14:14:29 +0000",
          "title": "States want to tax fossil fuel companies to create climate change superfunds",
          "standfirst": "As climate costs rise, states are passing legislation so fossil fuel can pay their share.",
          "content": "Illinois lawmakers plan to introduce a climate change superfund bill in the state legislature this session, the latest in a growing number of states seeking to make fossil fuel companies pay up for the fast-growing financial fallout of climate change. As the costs of global warming rise—in the form of home insurance premiums, utility bills, health expenses, and record-breaking damages from extreme weather—local advocates are increasingly pushing states to require that fossil fuel companies contribute to climate “superfunds” that would support mitigation and adaptation. Illinois State Rep. Robyn Gabel, who will introduce the bill in the House, said she is motivated by the growing threat of flooding and heat waves in the state.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/houseflooded-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/houseflooded-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_117",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 14:39:47 +0000",
      "title": "Tesla kills Models S and X to build humanoid robots instead",
      "neutral_headline": "Tesla kills Models S and X to build humanoid robots instead",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/tesla-kills-models-s-and-x-to-build-humanoid-robots-instead/",
          "published_at": "Thu, 29 Jan 2026 14:39:47 +0000",
          "title": "Tesla kills Models S and X to build humanoid robots instead",
          "standfirst": "EVs that were once industry-leading have long since been left behind.",
          "content": "Yesterday afternoon, following the end of trading on Wall Street for the day, Tesla published its financial results for 2025. They weren't particularly good: Profits were almost halved, and revenues declined year on year for the first time in the company's history. The reasons for the company's troubles are myriad. CEO Elon Musk's bankrolling of right-wing politics and promotion of AI-generated revenge porn deepfakes and CSAM has alienated plenty of potential customers. For those who either don't know or don't care about that stuff, there's still the problem of a tiny and aging model lineup, with large question marks over safety and reliability. Soon, that tiny lineup will be even smaller. The news emerged during Tesla's call with investors last night. As Ars and others have observed, in recent years Musk appears to have grown bored with the prosaic business of running a profitable car company. Silicon Valley stopped finding that stuff sexy years ago, and no other electric vehicle startup has been able to generate a value within an order of magnitude of the amount that Tesla has been determined to be worth by investors. Musk's attention first turned away from building and selling cars to the goal of autonomous driving, spurred on at the time by splashy headlines garnered by Google spinoff Waymo. Combined with ride-hailing—a huge IPO by Uber took the spotlight off Tesla long enough for it to become a new business focus for the automaker too—Musk told adoring fans and investors that soon their cars would become appreciating assets that earned money for them at night. And as an intermediary, Tesla would take a hefty cut for connecting the rider and the ridee.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1024608458-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1024608458-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_106",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:00:41 +0000",
      "title": "What ice fishing can teach us about making foraging decisions",
      "neutral_headline": "What ice fishing can teach us about making foraging decisions",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/what-ice-fishing-can-teach-us-about-making-foraging-decisions/",
          "published_at": "Thu, 29 Jan 2026 19:00:41 +0000",
          "title": "What ice fishing can teach us about making foraging decisions",
          "standfirst": "Social density increases likelihood of sticking with a location. Environmental factors had little influence.",
          "content": "Ice fishing is a longstanding tradition in Nordic countries, with competitions proving especially popular. Those competitions can also tell scientists something about how social cues influence how we make foraging decisions, according to a new paper published in the journal Science. Humans are natural foragers in even the most extreme habitats, digging up tubers in the tropics, gathering mushrooms, picking berries, hunting seals in the Arctic, and fishing to meet our dietary needs. Human foraging is sufficiently complex that scientists believe that meeting so many diverse challenges helped our species develop memory, navigational abilities, social learning skills, and similar advanced cognitive functions. Researchers are interested in this question not just because it could help refine existing theories of social decision-making, but also could improve predictions about how different groups of humans might respond and adapt to changes in their environment. Per the authors, prior research in this area has tended to focus on solitary foragers operating in a social vacuum. And even when studying social foraging decisions, it's typically done using computational modeling and/or in the laboratory.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/icefishing1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/icefishing1-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_112",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 17:26:08 +0000",
      "title": "Custom machine kept man alive without lungs for 48 hours",
      "neutral_headline": "Custom machine kept man alive without lungs for 48 hours",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/custom-machine-kept-man-alive-without-lungs-for-48-hours/",
          "published_at": "Thu, 29 Jan 2026 17:26:08 +0000",
          "title": "Custom machine kept man alive without lungs for 48 hours",
          "standfirst": "Infections had turned his lungs to soup and had to be cleared before transplant.",
          "content": "Humans can’t live without lungs. And yet for 48 hours, in a surgical suite at Northwestern University, a 33-year-old man lived with an empty cavity in his chest where his lungs used to be. He was kept alive by a custom-engineered artificial device that represented a desperate last-ditch effort by his doctors. The custom hardware solved a physiological puzzle that has made bilateral pneumonectomy, the removal of both lungs, extremely risky before now. The artificial lung system was built by the team of Ankit Bharat, a surgeon and researcher at Northwestern. It successfully kept a critically ill patient alive long enough to enable a double lung transplant, temporarily replacing his entire pulmonary system with a synthetic surrogate. The system creates a blueprint for saving people previously considered beyond hope by transplant teams. Melting lungs The patient, a once-healthy 33-year-old, arrived at the hospital with Influenza B complicated by a secondary, severe infection of Pseudomonas aeruginosa, a bacterium that in this case proved resistant even to carbapenems—our antibiotics of last resort. This combination of infections triggered acute respiratory distress syndrome (ARDS), a condition where the lungs become so inflamed and fluid-filled that oxygen can no longer reach the blood.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1358869815-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1358869815-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_122",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 12:00:33 +0000",
      "title": "Early Universe's supermassive black holes grew in cocoons like butterflies",
      "neutral_headline": "Early Universe's supermassive black holes grew in cocoons like butterflies",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/early-universes-supermassive-black-holes-grew-in-cocoons-like-butterflies/",
          "published_at": "Thu, 29 Jan 2026 12:00:33 +0000",
          "title": "Early Universe's supermassive black holes grew in cocoons like butterflies",
          "standfirst": "During cocoon phase, young, supermassive black holes are surrounded by high-density gas.",
          "content": "When the James Webb Space Telescope sent its first high-definition infrared images back to Earth, astronomers noticed several tiny, glowing, crimson stains. These objects, quickly named “Little Red Dots,” were too bright to be normal galaxies, and too red to be simple star clusters. They appeared to house supermassive black holes that were far more massive than they had any right to be. But now a new study published in Nature suggests a solution to the Little Red Dots mystery. Scientists think young supermassive black holes may go through a “cocoon phase,” where they grow surrounded by high-density gas they feed on. These gaseous cocoons are likely what the JWST saw as the Little Red Dots. The overmassive black hole problem The first explanation scientists had for the Little Red Dots was that they were compact, distant galaxies, but something felt off about them right from the start. “They were too massive, since we saw they’d have to be completely filled with stars,” says Vadim Rusakov, an astronomer at the University of Manchester and lead author of the study. “They would need to produce stars at 100 percent efficiency, and that’s not what we’re used to seeing. Galaxies cannot produce stars at more than 20 percent efficiency, at least that’s what our current knowledge is.”Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1-1152x648.png",
      "popularity_score": 133
    }
  ]
}