{
  "updated_at": "2026-01-29T11:25:37.946Z",
  "clusters": [
    {
      "id": "cluster_84",
      "coverage": 2,
      "updated_at": "Wed, 28 Jan 2026 18:00:14 +0000",
      "title": "Google begins rolling out Chrome's \"Auto Browse\" AI agent today",
      "neutral_headline": "Google begins rolling out Chrome's \"Auto Browse\" AI agent today",
      "bullet_summary": [
        "Reported by Ars Technica, TechCrunch"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/google-begins-rolling-out-chromes-auto-browse-ai-agent-today/",
          "published_at": "Wed, 28 Jan 2026 18:00:14 +0000",
          "title": "Google begins rolling out Chrome's \"Auto Browse\" AI agent today",
          "standfirst": "The Auto Browse agent is available to AI Pro and AI Ultra subscribers, but there are some limits.",
          "content": "Google began stuffing Gemini into its dominant Chrome browser several months ago, and today the AI is expanding its capabilities considerably. Google says the chatbot will be easier to access and connect to more Google services, but the biggest change is the addition of Google's autonomous browsing agent, which it has dubbed Auto Browse. Similar to tools like OpenAI Atlas, Auto Browse can handle tedious tasks in Chrome so you don't have to. The newly unveiled Gemini features in Chrome are accessible from the omnipresent AI button that has been lurking at the top of the window for the last few months. Initially, that button only opened Gemini in a pop-up window, but Google now says it will default to a split-screen or \"Sidepanel\" view. Google confirmed the update began rolling out over the past week, so you may already have it. You can still pop Gemini out into a floating window, but the split-view gives Gemini more room to breathe while manipulating a page with AI. This is also helpful when calling other apps in the Chrome implementation of Gemini. The chatbot can now access Gmail, Calendar, YouTube, Maps, Google Shopping, and Google Flights right from the Chrome window. Google technically added this feature around the middle of January, but it's only talking about it now.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/chrome_rollercoaster-1-1152x648.png"
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/28/chrome-takes-on-ai-browsers-with-tighter-gemini-integration-agentic-features-for-autonomous-tasks/",
          "published_at": "Wed, 28 Jan 2026 18:00:00 +0000",
          "title": "Chrome takes on AI browsers with tighter Gemini integration, agentic features for autonomous tasks",
          "standfirst": "Google Chrome is adding Gemini in the sidebar and is rolling out an agentic feature for AI Pro and Ultra users.",
          "content": "Google Chrome is adding Gemini in the sidebar and is rolling out an agentic feature for AI Pro and Ultra users.",
          "feed_position": 17
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/chrome_rollercoaster-1-1152x648.png",
      "popularity_score": 2002.5766819444445
    },
    {
      "id": "cluster_89",
      "coverage": 2,
      "updated_at": "Wed, 28 Jan 2026 17:22:26 +0000",
      "title": "Meta blocks links to ICE List across Facebook, Instagram, and Threads",
      "neutral_headline": "Meta blocks links to ICE List across Facebook, Instagram, and Threads",
      "bullet_summary": [
        "Reported by Ars Technica, Wired Tech"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/meta-blocks-links-to-ice-list-across-facebook-instagram-and-threads/",
          "published_at": "Wed, 28 Jan 2026 17:22:26 +0000",
          "title": "Meta blocks links to ICE List across Facebook, Instagram, and Threads",
          "standfirst": "Mark Zuckerberg's social media platforms are assisting the Trump administration.",
          "content": "Meta has started blocking its users from sharing links to ICE List, a website that has compiled the names of what it claims are Department of Homeland Security employees, a project the creators say is designed to hold those employees accountable. Dominick Skinner, the creator of ICE List, tells WIRED that links to the website have been shared without issue on Meta’s platforms for more than six months. “I think it's no surprise that a company run by a man who sat behind Trump at his inauguration, and donated to the destruction of the White House, has taken a stance that helps ICE agents retain anonymity,” says Skinner.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/zuck-trump-1152x648.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/meta-is-blocking-links-to-ice-list-on-facebook-instagram-and-threads/",
          "published_at": "Tue, 27 Jan 2026 18:18:39 +0000",
          "title": "Meta Is Blocking Links to ICE List on Facebook, Instagram, and Threads",
          "standfirst": "Users of Meta’s social platforms can no longer share links to ICE List, a website listing what it claims are the names of thousands of DHS employees.",
          "content": "Users of Meta’s social platforms can no longer share links to ICE List, a website listing what it claims are the names of thousands of DHS employees.",
          "feed_position": 31,
          "image_url": "https://media.wired.com/photos/6978e52c82bc9b499ef3afed/master/pass/pol-meta-icelist-2233062247.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/zuck-trump-1152x648.jpg",
      "popularity_score": 2001.9466819444444
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 22:28:19 +0000",
      "title": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
      "neutral_headline": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/2025-sees-teslas-annual-revenue-fall-for-the-first-time/",
          "published_at": "Wed, 28 Jan 2026 22:28:19 +0000",
          "title": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
          "standfirst": "More than half its profit came from emissions credits as sales fell 8.6 percent.",
          "content": "Tesla published its financial results for 2025 this afternoon. If 2024 was a bad year for the electric automaker, 2025 was far worse: For the first time in Tesla's history, revenues fell year over year. A bad quarter Earlier this month, Tesla revealed its sales and production numbers for the fourth quarter of 2025, with a 16 percent decline compared to Q4 2024. Now we know the cost of those lost sales: Automotive revenues fell by 11 percent to $17.7 billion. Happily for Tesla, double-digit growth in its energy storage business ($3.8 billion, an increase of 25 percent) and services ($3.4 billion, an increase of 18 percent) made up some of the shortfall.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2205801667-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2205801667-1152x648.jpg",
      "popularity_score": 346.0447375
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 21:53:57 +0000",
      "title": "Seven things to know about how Apple's Creator Studio subscriptions work",
      "neutral_headline": "Seven things to know about how Apple's Creator Studio subscriptions work",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/seven-things-to-know-about-how-apples-creator-studio-subscriptions-work/",
          "published_at": "Wed, 28 Jan 2026 21:53:57 +0000",
          "title": "Seven things to know about how Apple's Creator Studio subscriptions work",
          "standfirst": "For the Mac versions of pro apps, things aren't actually changing much (yet).",
          "content": "Apple's new Creator Studio subscription bundle officially launches today, offering access to a wide range of updated professional apps for an all-or-nothing price of $12.99 a month or $129 a year. Teachers and students can get the same apps for $2.99 a month, or $29.99 a year. The bundle includes either access to or enhanced features for a total of 10 Apple apps, though the base versions of several of these are available for free to all Mac and iPad owners: Final Cut Pro Logic Pro Pixelmator Pro Keynote, Pages, and Numbers Freeform Motion, Compressor, and MainStage (Mac only) When companies introduce a subscription-based model for long-standing apps with an established user base, they often shift exclusively to a subscription model, offering continuous updates in return for a more consistent revenue stream. But these aren't always popular with subscription-fatigued users, who have seen virtually all major paid software shift to a subscription model in the last 10 or 15 years, and who in recent years have had to deal with prices that are continuously being ratcheted upward.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-28-at-4.09.33-PM-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-28-at-4.09.33-PM-1152x648.jpeg",
      "popularity_score": 337.4719597222222
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 22:06:41 +0000",
      "title": "Site catering to online criminals has been seized by the FBI",
      "neutral_headline": "Site catering to online criminals has been seized by the FBI",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/site-catering-to-online-criminals-has-been-seized-by-the-fbi/",
          "published_at": "Wed, 28 Jan 2026 22:06:41 +0000",
          "title": "Site catering to online criminals has been seized by the FBI",
          "standfirst": "One of the last holdouts for ransomware discussions, RAMP is taken down.",
          "content": "RAMP—the predominantly Russian-language online bazaar that billed itself as the “only place ransomware allowed”—had its dark web and clear web sites seized by the FBI as the agency tries to combat the growing scourge threatening critical infrastructure and organizations around the world. Visits to both sites on Wednesday returned pages that said the FBI had taken control of the RAMP domains, which mirrored each other. RAMP has been among the dwindling number of online crime forums to operate with impunity, following the takedown of other forums such as XSS, which saw its leader arrested last year by Europol. The vacuum left RAMP as one of the leading places for people pushing ransomware and other online threats to buy, sell, or trade products and services. I regret to inform you “The Federal Bureau of Investigation has seized RAMP,” a banner carrying the seals of the FBI and the Justice Department said. “This action has been taken in coordination with the United States Attorney’s Office for the Southern District of Florida and the Computer Crime and Intellectual Property Section of the Department of Justice.” The banner included a graphic that appeared on the RAMP site, before it was seized, that billed itself as the “only place ransomware allowed.”Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/network-outage.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/network-outage.jpg",
      "popularity_score": 329.68418194444445
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 21:37:37 +0000",
      "title": "Stranded boys struggle to survive in Lord of the Flies trailer",
      "neutral_headline": "Stranded boys struggle to survive in Lord of the Flies trailer",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/bbcs-lord-of-the-flies-miniseries-gets-a-trailer/",
          "published_at": "Wed, 28 Jan 2026 21:37:37 +0000",
          "title": "Stranded boys struggle to survive in Lord of the Flies trailer",
          "standfirst": "“We need to think about food and shelter. We need to help each other and be good camp mates.”",
          "content": "BBC One has adapted William Golding's classic 1954 novel Lord of the Flies into a new miniseries and just dropped the first trailer. The book has been adapted for film three times since its publication and also inspired the Emmy-nominated TV series Yellowjackets (renewed for its fourth and final season this year). This BBC miniseries apparently has the support of the Golding family and is expected to hew quite closely to the novel. (Spoilers for the 1954 novel below.) Golding was inspired to write Lord of the Flies by a popular, pro-colonialism children's novel called The Coral Island, whose central theme was the civilizing influence of British colonial efforts and Christianity on a \"savage\" people. Golding wanted to write a book about children on an island who \"behave the way children really would behave.\"Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/flies1-1152x648-1769625327.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/flies1-1152x648-1769625327.jpg",
      "popularity_score": 324.1997375
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 21:02:21 +0000",
      "title": "SpaceX sends list of demands to US states giving broadband grants to Starlink",
      "neutral_headline": "SpaceX sends list of demands to US states giving broadband grants to Starlink",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/starlink-demands-grant-money-from-states-even-when-residents-dont-buy-service/",
          "published_at": "Wed, 28 Jan 2026 21:02:21 +0000",
          "title": "SpaceX sends list of demands to US states giving broadband grants to Starlink",
          "standfirst": "SpaceX won't make specific promises on Starlink network capacity or subscribers.",
          "content": "SpaceX has made a new set of demands on state governments that would ensure Starlink receives federal grant money even when residents don't purchase Starlink broadband service. SpaceX said it will provide \"all necessary equipment\" to receive broadband \"at no cost to subscribers requesting service,\" which will apparently eliminate the up-front hardware fee for Starlink equipment. But SpaceX isn't promising lower-than-usual monthly prices to consumers in those subsidized areas. SpaceX pledged to make broadband available for $80 or less a month, plus taxes and fees, to people with low incomes in the subsidized areas. For comparison, the normal Starlink residential prices advertised on its website range from $50 to $120 a month. SpaceX's demands would also guarantee that it gets paid by the government even if it doesn't reserve \"large portions\" of Starlink network capacity for homes in the areas that are supposed to receive government-subsidized Internet service. Moreover, SpaceX would not be responsible for ensuring that Starlink equipment is installed correctly at each customer location.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/03/starlink-snow-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/03/starlink-snow-1152x648.jpg",
      "popularity_score": 306.6119597222222
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 19:56:44 +0000",
      "title": "US cyber defense chief accidentally uploaded secret government info to ChatGPT",
      "neutral_headline": "US cyber defense chief accidentally uploaded secret government info to ChatGPT",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/us-cyber-defense-chief-accidentally-uploaded-secret-government-info-to-chatgpt/",
          "published_at": "Wed, 28 Jan 2026 19:56:44 +0000",
          "title": "US cyber defense chief accidentally uploaded secret government info to ChatGPT",
          "standfirst": "Congress recently grilled the acting chief on mass layoffs and a failed polygraph.",
          "content": "Alarming critics, the acting director of the Cybersecurity and Infrastructure Security Agency (CISA), Madhu Gottumukkala, accidentally uploaded sensitive information to a public version of ChatGPT last summer, Politico reported. According to \"four Department of Homeland Security officials with knowledge of the incident,\" Gottumukkala's uploads of sensitive CISA contracting documents triggered multiple internal cybersecurity warnings designed to \"stop the theft or unintentional disclosure of government material from federal networks.\" Gottumukkala's uploads happened soon after he joined the agency and sought special permission to use OpenAI's popular chatbot, which most DHS staffers are blocked from accessing, DHS confirmed to Ars. Instead, DHS staffers use approved AI-powered tools, like the agency's DHSChat, which \"are configured to prevent queries or documents input into them from leaving federal networks,\" Politico reported.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2202418998-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2202418998-1152x648.jpg",
      "popularity_score": 292.5183486111111
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 20:06:43 +0000",
      "title": "Angry Norfolk residents lose lawsuit to stop Flock license plate scanners",
      "neutral_headline": "Angry Norfolk residents lose lawsuit to stop Flock license plate scanners",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/angry-norfolk-residents-lose-lawsuit-to-stop-flock-license-plate-scanners/",
          "published_at": "Wed, 28 Jan 2026 20:06:43 +0000",
          "title": "Angry Norfolk residents lose lawsuit to stop Flock license plate scanners",
          "standfirst": "Plaintiffs called Norfolk's Flock camera network a “dragnet.\"",
          "content": "A federal judge in Virginia ruled Tuesday that the City of Norfolk’s use of nearly 200 automated license plate readers (ALPRs) from Flock is constitutional and can continue, dismissing the entire case just days before a bench trial was set to begin. The case, Schmidt v. City of Norfolk, was originally filed in October 2024 by two Virginians who claimed that their rights were violated when the Flock network of cameras captured their cars hundreds of times, calling the entire setup a “dragnet surveillance program.” However, in a 51-page ruling, US District Court Judge Mark S. Davis disagreed, finding that the “...plaintiffs are unable to demonstrate that Defendants’ ALPR system is capable of tracking the whole of a person’s movements.”Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Flock-camera-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Flock-camera-1152x648.jpg",
      "popularity_score": 287.6847375
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 18:48:26 +0000",
      "title": "Why reviving the shuttered Anthem is turning out tougher than expected",
      "neutral_headline": "Why reviving the shuttered Anthem is turning out tougher than expected",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/why-reviving-the-shuttered-anthem-is-turning-out-tougher-than-expected/",
          "published_at": "Wed, 28 Jan 2026 18:48:26 +0000",
          "title": "Why reviving the shuttered Anthem is turning out tougher than expected",
          "standfirst": "Despite proof-of-concept video, EA's Frostbite Engine servers are difficult to pick apart.",
          "content": "On January 12, EA shut down the official servers for Anthem, making Bioware's multiplayer sci-fi adventure completely unplayable for the first time since its troubled 2019 launch. Last week, though, the Anthem community woke up to a new video showing the game at least partially loading on what appears to be a simulated background server. The people behind that video—and the Anthem revival project that made it possible—told Ars they were optimistic about their efforts to coerce EA's temperamental Frostbite engine into running the game without access to EA's servers. That said, the team also wants to temper expectations that may have risen a bit too high in the wake of what is just a proof-of-concept video. Andersson799's early proof-of-concept video showing Anthem partially loading on emulated local servers. \"People are getting excited [about the video], and naturally people are going to get their hopes up,\" project administrator Laurie told Ars. \"I don't want to be the person that's going to have to deal with the aftermath if it turns out that we can't actually get anywhere.\"Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anthem-1152x648-1769624814.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anthem-1152x648-1769624814.jpg",
      "popularity_score": 272.3800152777778
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 18:07:35 +0000",
      "title": "I bought \"Remove Before Flight\" tags on eBay in 2010—it turns out they're from Challenger",
      "neutral_headline": "I bought \"Remove Before Flight\" tags on eBay in 2010—it...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/attached-to-tragedy-tracing-challenger-remove-before-flight-tags/",
          "published_at": "Wed, 28 Jan 2026 18:07:35 +0000",
          "title": "I bought \"Remove Before Flight\" tags on eBay in 2010—it turns out they're from Challenger",
          "standfirst": "\"This is an attempt to learn more...\"",
          "content": "Forty years ago, a stack of bright red tags shared a physical connection with what would become NASA's first space shuttle disaster. The small tags, however, were collected before the ill-fated launch of Challenger, as was instructed in bold \"Remove Before Flight\" lettering on the front of each. What happened to the tags after that is largely unknown. This is an attempt to learn more about where those \"Remove Before Flight\" tags went after they were detached from the space shuttle and before they arrived on my doorstep. If their history can be better documented, they can be provided to museums, educational centers, and astronautical archives for their preservation and display.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/news-012826a-lg-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/news-012826a-lg-1152x648.jpg",
      "popularity_score": 255.69918194444443
    },
    {
      "id": "cluster_90",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 17:21:29 +0000",
      "title": "Report: China approves import of high-end Nvidia AI chips after weeks of uncertainty",
      "neutral_headline": "Report: China approves import of high-end Nvidia AI chips after weeks of uncertainty",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/report-china-approves-import-of-high-end-nvidia-ai-chips-after-weeks-of-uncertainty/",
          "published_at": "Wed, 28 Jan 2026 17:21:29 +0000",
          "title": "Report: China approves import of high-end Nvidia AI chips after weeks of uncertainty",
          "standfirst": "Over 400,000 H200 chips coming to tech giants as China tries to balance tech needs with self-reliance.",
          "content": "On Wednesday, China approved imports of Nvidia's H200 artificial intelligence chips for three of its largest technology companies, Reuters reported. ByteDance, Alibaba, and Tencent received approval to purchase more than 400,000 H200 chips in total, marking a shift in Beijing's stance after weeks of holding up shipments despite US export clearance. The move follows Beijing's temporary halt to H200 shipments earlier this month after Washington cleared exports on January 13. Chinese customs authorities had told agents that the H200 chips were not permitted to enter China, Reuters reported earlier this month, even as Chinese technology companies placed orders for more than two million of the chips. The H200, Nvidia's second most powerful AI chip after the B200, delivers roughly six times the performance of the company's H20 chip, which was previously the most capable chip Nvidia could sell to China. While Chinese companies such as Huawei now have products that rival the H20's performance, they still lag far behind the H200.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2131985696-1536x864-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2131985696-1536x864-1-1152x648.jpg",
      "popularity_score": 149.93084861111112
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 12:30:44 +0000",
      "title": "Users flock to open source Moltbot for always-on AI, despite major risks",
      "neutral_headline": "Users flock to open source Moltbot for always-on AI, despite major risks",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/viral-ai-assistant-moltbot-rapidly-gains-popularity-but-poses-security-risks/",
          "published_at": "Wed, 28 Jan 2026 12:30:44 +0000",
          "title": "Users flock to open source Moltbot for always-on AI, despite major risks",
          "standfirst": "The open source \"Jarvis\" chats via WhatsApp but requires access to your files and accounts.",
          "content": "An open source AI assistant called Moltbot (formerly \"Clawdbot\") recently crossed 69,000 stars on GitHub after a month, making it one of the fastest-growing AI projects of 2026. Created by Austrian developer Peter Steinberger, the tool lets users run a personal AI assistant and control it through messaging apps they already use. While some say it feels like the AI assistant of the future, running the tool as currently designed comes with serious security risks. Among the dozens of unofficial AI bot apps that never rise above the fray, Moltbot is perhaps most notable for its proactive communication with the user. The assistant works with WhatsApp, Telegram, Slack, Discord, Google Chat, Signal, iMessage, Microsoft Teams, and other platforms. It can reach out to users with reminders, alerts, or morning briefings based on calendar events or other triggers. The project has drawn comparisons to Jarvis, the AI assistant from the Iron Man films, for its ability to actively attempt to manage tasks across a user's digital life. However, we'll tell you up front that there are plenty of drawbacks to the still-hobbyist software: While the organizing assistant code runs on a local machine, the tool effectively requires a subscription to Anthropic or OpenAI for model access (or using an API key). Users can run local AI models with the bot, but they are currently less effective at carrying out tasks than the best commercial models. Claude Opus 4.5, which is Anthropic's flagship large language model (LLM), is a popular choice.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/clawdbot_1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/clawdbot_1-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 16:41:40 +0000",
      "title": "Ryzen 9850X3D review: AMD's bragging-rights gaming CPU gets more to brag about",
      "neutral_headline": "Ryzen 9850X3D review: AMD's bragging-rights gaming CPU gets more to brag about",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/review-amds-ryzen-7-9850x3d-is-a-little-faster-and-a-lot-more-power-hungry/",
          "published_at": "Wed, 28 Jan 2026 16:41:40 +0000",
          "title": "Ryzen 9850X3D review: AMD's bragging-rights gaming CPU gets more to brag about",
          "standfirst": "The tradeoffs in the $499 9850X3D make it hard to get excited about.",
          "content": "AMD has released three distinct generations of its 3D V-Cache technology, which initially appeared in the Ryzen 7 5800X3D in 2022. The kernel of the idea has remained the same throughout AMD's efforts: take an existing desktop processor design and graft 64MB of additional L3 cache onto it. This approach disproportionately helps apps that benefit from more cache, particularly games, and the size of the boost that 3D V-Cache gives to game performance has always been enough to offset any downsides these chips have come with. In the four years since the 5800X3D was released, AMD also has steadily chipped away at those disadvantages, adding more CPU cores, improving power consumption and temperatures, and re-adding the typical Ryzen range of overclocking controls. AMD's new Ryzen 7 9850X3D, which launches for $499 starting tomorrow, is the very definition of a mild upgrade. It's the year-old Ryzen 7 9800X3D but with an extra 400 MHz of turbo boost speed. That's it. That's the chip.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/IMG_7105-1152x648-1769617334.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/IMG_7105-1152x648-1769617334.jpeg",
      "popularity_score": 145.2672375
    },
    {
      "id": "cluster_114",
      "coverage": 1,
      "updated_at": "Tue, 27 Jan 2026 22:34:40 +0000",
      "title": "There's a rash of scam spam coming from a real Microsoft address",
      "neutral_headline": "There's a rash of scam spam coming from a real Microsoft address",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/theres-a-rash-of-scam-spam-coming-from-a-real-microsoft-address/",
          "published_at": "Tue, 27 Jan 2026 22:34:40 +0000",
          "title": "There's a rash of scam spam coming from a real Microsoft address",
          "standfirst": "Abusing Microsoft's reputation may make scam harder to spot.",
          "content": "There are reports that a legitimate Microsoft email address—which Microsoft explicitly says customers should add to their allow list—is delivering scam spam. The emails originate from no-reply-powerbi@microsoft.com, an address tied to Power BI. The Microsoft platform provides analytics and business intelligence from various sources that can be integrated into a single dashboard. Microsoft documentation says that the address is used to send subscription emails to mail-enabled security groups. To prevent spam filters from blocking the address, the company advises users to add it to allow lists. From Microsoft, with malice According to an Ars reader, the address on Tuesday sent her an email claiming (falsely) that a $399 charge had been made to her. \"It provided a phone number to call to dispute the transaction. A man who answered a call asking to cancel the sale directed me to download and install a remote access application, presumably so he could then take control of my Mac or Windows machine (Linux wasn’t allowed),\" she said. The email, captured in the two screenshots below, looked like this:Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/social-engineering-scam-call-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/social-engineering-scam-call-1152x648.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 17:02:48 +0000",
      "title": "South Carolina tops Texas measles outbreak record—with no end in sight",
      "neutral_headline": "South Carolina tops Texas measles outbreak record—with no end in sight",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/sc-measles-23-schools-hit-over-550-quarantined-as-outbreak-hits-record/",
          "published_at": "Wed, 28 Jan 2026 17:02:48 +0000",
          "title": "South Carolina tops Texas measles outbreak record—with no end in sight",
          "standfirst": "Since start of the year, South Carolina's outbreak has accelerated dramatically.",
          "content": "The explosive measles outbreak in South Carolina has now reached 789 cases, breaking Texas's outbreak record last year of 762 cases, which at the time was the largest outbreak in the US since measles was declared eliminated from the US in 2000. The country is at grave risk of losing its elimination status in the coming months due to continuous spread. With Texas' outbreak last year—which spanned January to August and spread to additional states—the US saw the largest measles case total since 1991, with 2,255 confirmed cases. Now, with South Carolina's unbridled outbreak, 2026 is already looking like it will be another record year. Though South Carolina's outbreak began in October, the spread of the disease has dramatically accelerated this month, with cases jumping from 218 on December 28 to 789 on January 27.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2257300982-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2257300982-1152x648.jpg",
      "popularity_score": 134.61945972222222
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 14:55:58 +0000",
      "title": "The origin story of syphilis goes back far longer than we thought",
      "neutral_headline": "The origin story of syphilis goes back far longer than we thought",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/the-origin-story-of-syphilis-goes-back-far-longer-than-we-thought/",
          "published_at": "Wed, 28 Jan 2026 14:55:58 +0000",
          "title": "The origin story of syphilis goes back far longer than we thought",
          "standfirst": "A 5,500-year-old fossil from Colombia has scientists rethinking syphilis origins.",
          "content": "When King Charles VIII of France occupied Naples in 1495, his army of nearly 20,000 mercenaries became the ground zero of the “Great Pox,” the first massive venereal syphilis pandemic in Europe, which went on to cause up to 5 million deaths. For a long time, the siege of Naples was considered the first time syphilis entered European accounts and culture. “But the evolutionary history of Treponema pallidum, the lineage of bacteria including the one that causes syphilis, goes way deeper in time,” says Elizabeth Nelson, an anthropologist at Southern Methodist University. Nelson and her colleagues found a 5,500-year-old Treponema pallidum genome in an individual excavated from a rock shelter in Colombia—a discovery that shows pathogens causing treponemal diseases like syphilis, bejel, or yaws are several millennia older than we thought. And this means we might have been thinking about the origins of syphilis in an entirely wrong way. The blame game While the French occupation of Naples did not introduce syphilis to the world, it created the perfect storm that shaped the perception of this disease and its origins for centuries to come. The first ingredient of this storm was the French army and its leader. Charles VIII invaded Naples with a vast melting pot of brigands and mercenaries from all over Europe, including the French, Swiss, Poles, and Spaniards. The king himself wasn’t exactly the epitome of morality. Chroniclers like Johannes Burckard noted his “fondness of copulation” and reported that, once he’d been with a woman, he “cared no more about her” and immediately sought another partner—a behavior eagerly mirrored by his soldiers.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2013/02/3f05379v-e1360003011507-634x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2013/02/3f05379v-e1360003011507-634x648.jpeg",
      "popularity_score": 133
    },
    {
      "id": "cluster_103",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 12:15:54 +0000",
      "title": "Japan lost a 5-ton navigation satellite when it fell off a rocket during launch",
      "neutral_headline": "Japan lost a 5-ton navigation satellite when it fell off a rocket during launch",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/heres-the-story-of-how-japans-h3-rocket-lost-its-cargo-and-just-kept-going/",
          "published_at": "Wed, 28 Jan 2026 12:15:54 +0000",
          "title": "Japan lost a 5-ton navigation satellite when it fell off a rocket during launch",
          "standfirst": "Imagine: You lost your car's cargo rack, but didn't notice until you reached your destination.",
          "content": "If you're in the space business long enough, you learn there are numerous ways a rocket can fail. I've written my share of stories about misbehaving rockets and the extensive investigations that usually—but not always—reveal what went wrong. But I never expected to write this story. Maybe this was a failure of my own imagination. I'm used to writing about engine malfunctions, staging issues, guidance glitches, or structural failures. Last April, Ars reported on the bizarre failure of Firefly Aerospace's commercial Alpha rocket. Japan's H3 rocket found a new way to fail last month, apparently eluding the imaginations of its own designers and engineers.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jaxa_h3_f8_anim1.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jaxa_h3_f8_anim1.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_112",
      "coverage": 1,
      "updated_at": "Tue, 27 Jan 2026 23:28:02 +0000",
      "title": "Dozens of CDC vaccination databases have been frozen under RFK Jr.",
      "neutral_headline": "Dozens of CDC vaccination databases have been frozen under RFK Jr.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/rfk-jr-lets-cdc-vaccination-data-rot-dozens-of-databases-frozen/",
          "published_at": "Tue, 27 Jan 2026 23:28:02 +0000",
          "title": "Dozens of CDC vaccination databases have been frozen under RFK Jr.",
          "standfirst": "Anti-vaccine Kennedy may be \"enacting a self-fulfilling prophecy,\" expert says.",
          "content": "Nearly half of the databases that public health officials at the Centers for Disease Control and Prevention were updating on a monthly basis have been frozen without notice or explanation, according to a study published in the Annals of Internal Medicine. The study—led by Janet Freilich, a law expert at Boston University, and Jeremy Jacobs, a medical professor at Vanderbilt University—examined the status of all CDC databases, finding a total of 82 that had, as of early 2025, been receiving updates at least monthly. But, of those 82, only 44 were still being regularly updated as of October 2025, with 38 (46 percent) having their updates paused without public notice or explanation. Examining the databases' content, it appeared that vaccination data was most affected by the stealth data freezes. Of the 38 outdated databases, 33 (87 percent) included data related to vaccination. In contrast, none of the 44 still-updated databases relate to vaccination. Other frozen databases included data on infectious disease burden, such as data on hospitalizations from respiratory syncytial virus (RSV).Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/GettyImages-2201503706-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/GettyImages-2201503706-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_113",
      "coverage": 1,
      "updated_at": "Tue, 27 Jan 2026 23:17:17 +0000",
      "title": "TikTok users “absolutely justified” in fearing MAGA makeover, experts say",
      "neutral_headline": "TikTok users “absolutely justified” in fearing MAGA makeover, experts say",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/tiktok-claimed-bugs-blocked-anti-ice-videos-epstein-mentions-experts-call-bs/",
          "published_at": "Tue, 27 Jan 2026 23:17:17 +0000",
          "title": "TikTok users “absolutely justified” in fearing MAGA makeover, experts say",
          "standfirst": "TikTok’s tech issues abound as censorship fears drive users to delete app.",
          "content": "TikTok wants users to believe that errors blocking uploads of anti-ICE videos or direct messages mentioning Jeffrey Epstein are due to technical errors—not the platform shifting to censor content critical of Donald Trump after he hand-picked the US owners who took over the app last week. However, experts say that TikTok users' censorship fears are justified, whether the bugs are to blame or not. Ioana Literat, an associate professor of technology, media, and learning at Teachers College, Columbia University, has studied TikTok's politics since the app first shot to popularity in the US in 2018. She told Ars that \"users' fears are absolutely justified\" and explained why the \"bugs\" explanation is \"insufficient.\"Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/tik-tok-maga-hat-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/tik-tok-maga-hat-1152x648.jpg",
      "popularity_score": 133
    }
  ]
}