{
  "updated_at": "2026-02-17T07:45:11.013Z",
  "clusters": [
    {
      "id": "cluster_10",
      "coverage": 2,
      "updated_at": "Mon, 16 Feb 2026 22:40:00 -0500",
      "title": "Valve says the Steam Deck OLED may be \"intermittently\" out of stock due to memory and storage shortages; it has been out of stock in the US for a few days (Jay Peters/The Verge)",
      "neutral_headline": "Valve’s Steam Deck OLED will be ‘intermittently’ out of stock...",
      "bullet_summary": [
        "Reported by TechMeme, The Verge"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260216/p34#a260216p34",
          "published_at": "Mon, 16 Feb 2026 22:40:00 -0500",
          "title": "Valve says the Steam Deck OLED may be \"intermittently\" out of stock due to memory and storage shortages; it has been out of stock in the US for a few days (Jay Peters/The Verge)",
          "standfirst": "Jay Peters / The Verge: Valve says the Steam Deck OLED may be &ldquo;intermittently&rdquo; out of stock due to memory and storage shortages; it has been out of stock in the US for a few days &mdash; The PC gaming handheld has been out of stock in the US for a few days. &hellip; Valve has updated the Steam Deck OLED website &hellip;",
          "content": "Jay Peters / The Verge: Valve says the Steam Deck OLED may be &ldquo;intermittently&rdquo; out of stock due to memory and storage shortages; it has been out of stock in the US for a few days &mdash; The PC gaming handheld has been out of stock in the US for a few days. &hellip; Valve has updated the Steam Deck OLED website &hellip;",
          "feed_position": 8,
          "image_url": "http://www.techmeme.com/260216/i34.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/games/879845/valve-steam-deck-oled-out-of-stock-memory-storage-ram-crisis",
          "published_at": "2026-02-16T21:57:56-05:00",
          "title": "Valve’s Steam Deck OLED will be ‘intermittently’ out of stock because of the RAM crisis",
          "standfirst": "Valve has updated the Steam Deck website to say that the Steam Deck OLED may be out of stock \"intermittently in some regions due to memory and storage shortages.\" The PC gaming handheld has been out of stock in the US and other parts of the world for a few days, and thanks to this [&#8230;]",
          "content": "Valve has updated the Steam Deck website to say that the Steam Deck OLED may be out of stock \"intermittently in some regions due to memory and storage shortages.\" The PC gaming handheld has been out of stock in the US and other parts of the world for a few days, and thanks to this update, we now know why. The update comes shortly after Valve delayed the Steam Machine, Steam Frame, and Steam Controller from a planned shipping window of early 2026 because of the memory and storage crunch. \"We have work to do to land on concrete pricing and launch dates that we can confidently announce, being mindful of how quickly the circumstances around bot … Read the full story at The Verge.",
          "feed_position": 0
        }
      ],
      "featured_image": "http://www.techmeme.com/260216/i34.jpg",
      "popularity_score": 2015.9136075
    },
    {
      "id": "cluster_30",
      "coverage": 2,
      "updated_at": "Mon, 16 Feb 2026 20:01:26 +0000",
      "title": "The best noise-canceling earbuds for 2026",
      "neutral_headline": "The best noise-canceling earbuds for 2026",
      "bullet_summary": [
        "Apple still hasn’t officially announced a foldable iPhone, but the rumor mill hasn’t slowed down",
        "As always with unreleased Apple hardware, nothing here is confirmed",
        "The goal is a display with a nearly invisible crease, something Apple reportedly considers essential before entering the foldable market",
        "Liquidmetal is said to be stronger and more resistant to deformation than titanium, while remaining relatively lightweight"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/headphones/best-noise-canceling-earbuds-150026857.html",
          "published_at": "Mon, 16 Feb 2026 20:01:26 +0000",
          "title": "The best noise-canceling earbuds for 2026",
          "standfirst": "Noise-canceling earbuds have become an everyday essential for a lot of people, whether you’re trying to survive a noisy commute, concentrate in a shared workspace or just carve out a little quiet time. Advances in active noise cancellation and audio processing mean today’s best earbuds do a much better job of cutting through background noise, without forcing you to move up to bulky over-ear headphones.The latest models also balance sound quality with convenience, offering stable Bluetooth connections, comfortable fits and battery life that can last through a full day with help from their charging cases. From premium options with the strongest ANC to more affordable picks that still get the basics right, there’s no shortage of solid choices depending on what you value most. Best noise-cancelling earbuds for 2026 How to choose the best noise-canceling earbuds for you Design Most true wireless earbuds these days have a “traditional” design that’s a round bud that fits in your ear canals. However, there are some variations on the formula in terms of shape, size and additional fitting elements. Some companies include fins or fit wings to help hold their in-ear earbuds in place while others opt for an over-the-ear hook on more sporty models. You’ll want to pay attention to these things to make sure they align with how you plan to use them. Also consider overall size and weight since those two factors can impact the fit. A less-than-ideal seal due to a weird fit will affect the performance of active noise-canceling earbuds. Type of noise cancellation Next, you’ll want to look at the type of ANC a set of earbuds offer. You’ll see terms like “hybrid active noise cancellation” or “hybrid adaptive active noise cancellation,” and there are key differences between the two. A hybrid ANC setup uses microphones on the inside and the outside of the device to detect ambient noise. By analyzing input from both mics, a hybrid system can combat more sounds than “regular” ANC, but it’s at a constant level that doesn’t change. Adaptive ANC takes the hybrid configuration a step further by continuously adjusting the noise cancellation for changes in your environment and any leakage around the padding of the ear cups or ear tips. Adaptive ANC is also better at combating wind noise, which can really kill your vibe while using earbuds outdoors. For this top pick list of the best noise-canceling earbuds, I’m only considering products with hybrid ANC or adaptive ANC setups because those are the most effective at blocking noise in noisy environments. Customization You’ll also want to check to see if the ANC system on a prospective set of earbuds offers presets or adjustable levels of noise reduction. These can help you dial in the amount of ANC you need for various environments, but it can also help save battery life. Master & Dynamic, for example, has ANC presets that either provide maximum noise-blocking or prioritize energy efficiency. Other companies may include a slider in their companion apps that let you adjust the ANC level. How we test noise-canceling earbuds The primary way we test earbuds is to wear them as much as possible. I prefer to do this over a one-to-two-week period, but sometimes deadlines don’t allow it. During this time, I listen to a mix of music and podcasts, while also using the earbuds to take both voice and video calls. Since battery life for ANC earbuds is typically 6-10 hours, I drain the battery with looping music and the volume set at a comfortable level (usually around 75 percent). When necessary, I’ll power the headphones off during a review without putting them back in the case. This simulates real-world use and keeps me from having to wear them for an entire day. To test ANC performance specifically, I use the earbuds in a variety of environments, from noisy coffee shops to quiet home offices. When my schedule allows, I also use them during air travel, since plane noise is a massive distraction to both work and relaxation. Even if I’m not slated to hop on a flight, I simulate a constant roar with white noise machines, bathroom fans, vacuums and more. I also make note of how well earbuds block human voices, which are a key stumbling block for a lot of ANC setups. I also do a thorough review of companion apps, testing each feature as I work through the software. Any holdovers from previous models are double-checked for improvements or regression. If the earbuds I’m testing are an updated version of a previous model, I’ll spend time getting reacquainted with the older set, and revisit the closest competition as well.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/best-noise-canceling-earbuds-150026857.html?src=rss",
          "content": "Noise-canceling earbuds have become an everyday essential for a lot of people, whether you’re trying to survive a noisy commute, concentrate in a shared workspace or just carve out a little quiet time. Advances in active noise cancellation and audio processing mean today’s best earbuds do a much better job of cutting through background noise, without forcing you to move up to bulky over-ear headphones.The latest models also balance sound quality with convenience, offering stable Bluetooth connections, comfortable fits and battery life that can last through a full day with help from their charging cases. From premium options with the strongest ANC to more affordable picks that still get the basics right, there’s no shortage of solid choices depending on what you value most. Best noise-cancelling earbuds for 2026 How to choose the best noise-canceling earbuds for you Design Most true wireless earbuds these days have a “traditional” design that’s a round bud that fits in your ear canals. However, there are some variations on the formula in terms of shape, size and additional fitting elements. Some companies include fins or fit wings to help hold their in-ear earbuds in place while others opt for an over-the-ear hook on more sporty models. You’ll want to pay attention to these things to make sure they align with how you plan to use them. Also consider overall size and weight since those two factors can impact the fit. A less-than-ideal seal due to a weird fit will affect the performance of active noise-canceling earbuds. Type of noise cancellation Next, you’ll want to look at the type of ANC a set of earbuds offer. You’ll see terms like “hybrid active noise cancellation” or “hybrid adaptive active noise cancellation,” and there are key differences between the two. A hybrid ANC setup uses microphones on the inside and the outside of the device to detect ambient noise. By analyzing input from both mics, a hybrid system can combat more sounds than “regular” ANC, but it’s at a constant level that doesn’t change. Adaptive ANC takes the hybrid configuration a step further by continuously adjusting the noise cancellation for changes in your environment and any leakage around the padding of the ear cups or ear tips. Adaptive ANC is also better at combating wind noise, which can really kill your vibe while using earbuds outdoors. For this top pick list of the best noise-canceling earbuds, I’m only considering products with hybrid ANC or adaptive ANC setups because those are the most effective at blocking noise in noisy environments. Customization You’ll also want to check to see if the ANC system on a prospective set of earbuds offers presets or adjustable levels of noise reduction. These can help you dial in the amount of ANC you need for various environments, but it can also help save battery life. Master & Dynamic, for example, has ANC presets that either provide maximum noise-blocking or prioritize energy efficiency. Other companies may include a slider in their companion apps that let you adjust the ANC level. How we test noise-canceling earbuds The primary way we test earbuds is to wear them as much as possible. I prefer to do this over a one-to-two-week period, but sometimes deadlines don’t allow it. During this time, I listen to a mix of music and podcasts, while also using the earbuds to take both voice and video calls. Since battery life for ANC earbuds is typically 6-10 hours, I drain the battery with looping music and the volume set at a comfortable level (usually around 75 percent). When necessary, I’ll power the headphones off during a review without putting them back in the case. This simulates real-world use and keeps me from having to wear them for an entire day. To test ANC performance specifically, I use the earbuds in a variety of environments, from noisy coffee shops to quiet home offices. When my schedule allows, I also use them during air travel, since plane noise is a massive distraction to both work and relaxation. Even if I’m not slated to hop on a flight, I simulate a constant roar with white noise machines, bathroom fans, vacuums and more. I also make note of how well earbuds block human voices, which are a key stumbling block for a lot of ANC setups. I also do a thorough review of companion apps, testing each feature as I work through the software. Any holdovers from previous models are double-checked for improvements or regression. If the earbuds I’m testing are an updated version of a previous model, I’ll spend time getting reacquainted with the older set, and revisit the closest competition as well.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/best-noise-canceling-earbuds-150026857.html?src=rss",
          "feed_position": 3
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/iphone-fold-rumors-everything-we-know-so-far-including-the-leaked-design-upgrades-price-and-more-details-130000074.html",
          "published_at": "Mon, 16 Feb 2026 18:20:53 +0000",
          "title": "iPhone Fold rumors: Everything we know so far, including the leaked design, upgrades, price and more details",
          "standfirst": "Apple still hasn’t officially announced a foldable iPhone, but the rumor mill hasn’t slowed down. Over the past few months, analysts, supply-chain watchers and leakers have continued to sketch out what Apple’s first folding phone might look like and when it could finally arrive. Most signs still point to a late-2026 debut, though plenty could change between now and then.As always with unreleased Apple hardware, nothing here is confirmed. Plans can shift, features can be reworked and timelines can slip. Still, the volume and consistency of recent reporting gives us a better sense than ever of how the so-called iPhone Fold could take shape.Below, we’ve rounded up the most credible rumors so far, and we’ll keep this guide updated as new details emerge.When could the iPhone Fold launch?Rumors of a foldable iPhone date back as far as 2017, but more recent reporting suggests Apple has finally locked onto a realistic window. Most sources now point to fall 2026, likely alongside the iPhone 18 lineup.Mark Gurman has gone back and forth on timing, initially suggesting Apple could launch “as early as 2026,” before later writing that the device would ship at the end of 2026 and sell primarily in 2027. Analyst Ming-Chi Kuo has also repeatedly cited the second half of 2026 as Apple’s target.Some reports still claim the project could slip into 2027 if Apple runs into manufacturing or durability issues, particularly around the hinge or display. Given Apple’s history of delaying products that it feels aren’t ready, that remains a real possibility.What will the iPhone Fold look like?Current consensus suggests Apple has settled on a book-style foldable design, similar to Samsung’s Galaxy Z Fold series, rather than a clamshell flip phone.When unfolded, the iPhone Fold is expected to resemble a small tablet like the iPad mini (8.3 inches). Based on the rumor mill, though, the iPhone Fold may be a touch smaller, with an internal display measuring around 7.7 to 7.8 inches. When closed, it should function like a conventional smartphone, with an outer display in the 5.5-inch range.CAD leaks and alleged case-maker molds suggest the device may be shorter and wider than a standard iPhone when folded, creating a squarer footprint that better matches the aspect ratio of the inner display. Several reports have also pointed to the iPhone Air as a potential preview of Apple’s foldable design work, with its unusually thin chassis widely interpreted as a look at what one half of a future foldable iPhone could resemble.If that theory holds, it could help explain the Fold’s rumored dimensions. Thickness is expected to land between roughly 4.5 and 5.6mm when unfolded, putting it in a similar range to the iPhone Air, and just over 9 to 11mm when folded, depending on the final hinge design and internal layering.iPhone 17 Pro, iPhone AirEngadgetDisplay and the crease questionThe display is arguably the biggest challenge for any foldable phone, and it’s an area where Apple appears to have invested years of development.Multiple reports say Apple will rely on Samsung Display as its primary supplier. At CES 2026, Samsung showcased a new crease-less foldable OLED panel, which several sources — including Bloomberg — suggested could be the same technology Apple plans to use.According to these reports, the panel combines a flexible OLED with a laser-drilled metal support plate that disperses stress when folding. The goal is a display with a nearly invisible crease, something Apple reportedly considers essential before entering the foldable market.If Apple does use this panel, it would mark a notable improvement over current foldables, which still show visible creasing under certain lighting conditions.Cameras and biometricsCamera rumors suggest Apple is planning a four-camera setup. That may include:Two rear cameras (main and ultra-wide, both rumored at 48MP)One punch-hole camera on the outer displayOne under-display camera on the inner screenSeveral sources claim Apple will avoid Face ID entirely on the iPhone Fold. Instead, it’s expected to rely on Touch ID built into the power button, similar to recent iPad models. This would allow Apple to keep both displays free of notches or Dynamic Island cutouts.Under-display camera technology has historically produced lower image quality, but a rumored 24MP sensor would be a significant step up compared to existing foldables, which typically use much lower-resolution sensors.iPhone Fold’s hinge and materialsThe hinge is another area where Apple may diverge from competitors. Multiple reports claim Apple will use Liquidmetal, which is a long-standing trade name for a metallic glass alloy the company has previously used in smaller components. While often referred to as “liquid metal” or “Liquid Metal” in reports, Liquidmetal is the branding Apple has historically associated with the material.Liquidmetal is said to be stronger and more resistant to deformation than titanium, while remaining relatively lightweight. If accurate, this could help improve long-term durability and reduce wear on the foldable display.Leaks from Jon Prosser also reference a metal plate beneath the display that works in tandem with the hinge to minimize creasing — a claim that aligns with reporting from Korean and Chinese supply-chain sources.Battery and other components Battery life is another potential differentiator. According to Ming-Chi Kuo and multiple Asian supply-chain reports, Apple is testing high-density battery cells in the 5,000 to 5,800mAh range.That would make it the largest battery ever used in an iPhone, and competitive with (or larger than) batteries in current Android foldables. The device is also expected to use a future A-series chip and Apple’s in-house modem.PriceNone of this will come cheap, that’s for certain. Nearly every report agrees that the iPhone Fold will be Apple’s most expensive iPhone ever.Estimates currently place the price between $2,000 and $2,500 in the US. Bloomberg has said the price will be “at least $2,000,” while other analysts have narrowed the likely range to around $2,100 and $2,300. That positions the iPhone Fold well above the iPhone Pro Max and closer to Apple’s high-end Macs and iPads.Despite years of rumors, there’s still plenty that remains unclear. Apple hasn’t confirmed the name “iPhone Fold,” final dimensions, software features or how iOS would adapt to a folding form factor. Durability, repairability and long-term reliability are also open questions. For now, the safest assumption is that Apple is taking its time and that many of these details could still change before launch. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/iphone-fold-rumors-everything-we-know-so-far-including-the-leaked-design-upgrades-price-and-more-details-130000074.html?src=rss",
          "content": "Apple still hasn’t officially announced a foldable iPhone, but the rumor mill hasn’t slowed down. Over the past few months, analysts, supply-chain watchers and leakers have continued to sketch out what Apple’s first folding phone might look like and when it could finally arrive. Most signs still point to a late-2026 debut, though plenty could change between now and then.As always with unreleased Apple hardware, nothing here is confirmed. Plans can shift, features can be reworked and timelines can slip. Still, the volume and consistency of recent reporting gives us a better sense than ever of how the so-called iPhone Fold could take shape.Below, we’ve rounded up the most credible rumors so far, and we’ll keep this guide updated as new details emerge.When could the iPhone Fold launch?Rumors of a foldable iPhone date back as far as 2017, but more recent reporting suggests Apple has finally locked onto a realistic window. Most sources now point to fall 2026, likely alongside the iPhone 18 lineup.Mark Gurman has gone back and forth on timing, initially suggesting Apple could launch “as early as 2026,” before later writing that the device would ship at the end of 2026 and sell primarily in 2027. Analyst Ming-Chi Kuo has also repeatedly cited the second half of 2026 as Apple’s target.Some reports still claim the project could slip into 2027 if Apple runs into manufacturing or durability issues, particularly around the hinge or display. Given Apple’s history of delaying products that it feels aren’t ready, that remains a real possibility.What will the iPhone Fold look like?Current consensus suggests Apple has settled on a book-style foldable design, similar to Samsung’s Galaxy Z Fold series, rather than a clamshell flip phone.When unfolded, the iPhone Fold is expected to resemble a small tablet like the iPad mini (8.3 inches). Based on the rumor mill, though, the iPhone Fold may be a touch smaller, with an internal display measuring around 7.7 to 7.8 inches. When closed, it should function like a conventional smartphone, with an outer display in the 5.5-inch range.CAD leaks and alleged case-maker molds suggest the device may be shorter and wider than a standard iPhone when folded, creating a squarer footprint that better matches the aspect ratio of the inner display. Several reports have also pointed to the iPhone Air as a potential preview of Apple’s foldable design work, with its unusually thin chassis widely interpreted as a look at what one half of a future foldable iPhone could resemble.If that theory holds, it could help explain the Fold’s rumored dimensions. Thickness is expected to land between roughly 4.5 and 5.6mm when unfolded, putting it in a similar range to the iPhone Air, and just over 9 to 11mm when folded, depending on the final hinge design and internal layering.iPhone 17 Pro, iPhone AirEngadgetDisplay and the crease questionThe display is arguably the biggest challenge for any foldable phone, and it’s an area where Apple appears to have invested years of development.Multiple reports say Apple will rely on Samsung Display as its primary supplier. At CES 2026, Samsung showcased a new crease-less foldable OLED panel, which several sources — including Bloomberg — suggested could be the same technology Apple plans to use.According to these reports, the panel combines a flexible OLED with a laser-drilled metal support plate that disperses stress when folding. The goal is a display with a nearly invisible crease, something Apple reportedly considers essential before entering the foldable market.If Apple does use this panel, it would mark a notable improvement over current foldables, which still show visible creasing under certain lighting conditions.Cameras and biometricsCamera rumors suggest Apple is planning a four-camera setup. That may include:Two rear cameras (main and ultra-wide, both rumored at 48MP)One punch-hole camera on the outer displayOne under-display camera on the inner screenSeveral sources claim Apple will avoid Face ID entirely on the iPhone Fold. Instead, it’s expected to rely on Touch ID built into the power button, similar to recent iPad models. This would allow Apple to keep both displays free of notches or Dynamic Island cutouts.Under-display camera technology has historically produced lower image quality, but a rumored 24MP sensor would be a significant step up compared to existing foldables, which typically use much lower-resolution sensors.iPhone Fold’s hinge and materialsThe hinge is another area where Apple may diverge from competitors. Multiple reports claim Apple will use Liquidmetal, which is a long-standing trade name for a metallic glass alloy the company has previously used in smaller components. While often referred to as “liquid metal” or “Liquid Metal” in reports, Liquidmetal is the branding Apple has historically associated with the material.Liquidmetal is said to be stronger and more resistant to deformation than titanium, while remaining relatively lightweight. If accurate, this could help improve long-term durability and reduce wear on the foldable display.Leaks from Jon Prosser also reference a metal plate beneath the display that works in tandem with the hinge to minimize creasing — a claim that aligns with reporting from Korean and Chinese supply-chain sources.Battery and other components Battery life is another potential differentiator. According to Ming-Chi Kuo and multiple Asian supply-chain reports, Apple is testing high-density battery cells in the 5,000 to 5,800mAh range.That would make it the largest battery ever used in an iPhone, and competitive with (or larger than) batteries in current Android foldables. The device is also expected to use a future A-series chip and Apple’s in-house modem.PriceNone of this will come cheap, that’s for certain. Nearly every report agrees that the iPhone Fold will be Apple’s most expensive iPhone ever.Estimates currently place the price between $2,000 and $2,500 in the US. Bloomberg has said the price will be “at least $2,000,” while other analysts have narrowed the likely range to around $2,100 and $2,300. That positions the iPhone Fold well above the iPhone Pro Max and closer to Apple’s high-end Macs and iPads.Despite years of rumors, there’s still plenty that remains unclear. Apple hasn’t confirmed the name “iPhone Fold,” final dimensions, software features or how iOS would adapt to a folding form factor. Durability, repairability and long-term reliability are also open questions. For now, the safest assumption is that Apple is taking its time and that many of these details could still change before launch. This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/iphone-fold-rumors-everything-we-know-so-far-including-the-leaked-design-upgrades-price-and-more-details-130000074.html?src=rss",
          "feed_position": 5,
          "image_url": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/a476c2e0-9780-11f0-bd4b-d87caa240702"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/security/machine-identities-missing-link-ransomware-playbooks",
          "published_at": "Mon, 16 Feb 2026 18:00:00 GMT",
          "title": "Most ransomware playbooks don't address machine credentials. Attackers know it.",
          "standfirst": "The gap between ransomware threats and the defenses meant to stop them is getting worse, not better. Ivanti’s 2026 State of Cybersecurity Report found that the preparedness gap widened by an average of 10 points year over year across every threat category the firm tracks. Ransomware hit the widest spread: 63% of security professionals rate it a high or critical threat, but just 30% say they are “very prepared” to defend against it. That’s a 33-point gap, up from 29 points a year ago.CyberArk’s 2025 Identity Security Landscape puts numbers to the problem: 82 machine identities for every human in organizations worldwide. Forty-two percent of those machine identities have privileged or sensitive access. The most authoritative playbook framework has the same blind spotGartner’s ransomware preparation guidance, the April 2024 research note “How to Prepare for Ransomware Attacks” that enterprise security teams reference when building incident response procedures, specifically calls out the need to reset “impacted user/host credentials” during containment. The accompanying Ransomware Playbook Toolkit walks teams through four phases: containment, analysis, remediation, and recovery. The credential reset step instructs teams to ensure all affected user and device accounts are reset.Service accounts are absent. So are API keys, tokens, and certificates. The most widely used playbook framework in enterprise security stops at human and device credentials. The organizations following it inherit that blind spot without realizing it.The same research note identifies the problem without connecting it to the solution. Gartner warns that “poor identity and access management (IAM) practices” remain a primary starting point for ransomware attacks, and that previously compromised credentials are being used to gain access through initial access brokers and dark web data dumps. In the recovery section, the guidance is explicit: updating or removing compromised credentials is essential because, without that step, the attacker will regain entry. Machine identities are IAM. Compromised service accounts are credentials. But the playbook’s containment procedures address neither.Gartner frames the urgency in terms few other sources match: “Ransomware is unlike any other security incident,” the research note states. “It puts affected organizations on a countdown timer. Any delay in the decision-making process introduces additional risk.” The same guidance emphasizes that recovery costs can amount to 10 times the ransom itself, and that ransomware is being deployed within one day of initial access in more than 50% of engagements. The clock is already running, but the containment procedures don’t match the urgency — not when the fastest-growing class of credentials goes unaddressed.The readiness deficit runs deeper than any single surveyIvanti’s report tracks the preparedness gap across every major threat category: ransomware, phishing, software vulnerabilities, API-related vulnerabilities, supply chain attacks, and even poor encryption. Every single one widened year over year. “Although defenders are optimistic about the promise of AI in cybersecurity, Ivanti’s findings also show companies are falling further behind in terms of how well prepared they are to defend against a variety of threats,” said Daniel Spicer, Ivanti’s Chief Security Officer. “This is what I call the ‘Cybersecurity Readiness Deficit,’ a persistent, year-over-year widening imbalance in an organization’s ability to defend their data, people, and networks against the evolving threat landscape.”CrowdStrike’s 2025 State of Ransomware Survey breaks down what that deficit looks like by industry. Among manufacturers who rated themselves “very well prepared,” just 12% recovered within 24 hours, and 40% suffered significant operational disruption. Public sector organizations fared worse: 12% recovery despite 60% confidence. Across all industries, only 38% of organizations that suffered a ransomware attack fixed the specific issue that allowed attackers in. The rest invested in general security improvements without closing the actual entry point.Fifty-four percent of organizations said they would or probably would pay if hit by ransomware today, according to the 2026 report, despite FBI guidance against payment. That willingness to pay reflects a fundamental lack of containment alternatives, exactly the kind that machine identity procedures would provide.Where machine identity playbooks fall shortFive containment steps define most ransomware response procedures today. Machine identities are missing from every one of them.Credential resets weren’t designed for machinesResetting every employee’s password after an incident is standard practice, but it doesn’t stop lateral movement through a compromised service account. Gartner’s own playbook template shows the blind spot clearly. The Ransomware Playbook Sample’s containment sheet lists three credential reset steps: force logout of all affected user accounts via Active Directory, force password change on all affected user accounts via Active Directory, and reset the device account via Active Directory. Three steps, all Active Directory, zero non-human credentials. No service accounts, no API keys, no tokens, no certificates. Machine credentials need their own chain of command.Nobody inventories machine identities before an incidentYou can’t reset credentials that you don’t know exist. Service accounts, API keys, and tokens need ownership assignments mapped pre-incident. Discovering them mid-breach costs days. Just 51% of organizations even have a cybersecurity exposure score, Ivanti&#x27;s report found, which means nearly half couldn’t tell the board their machine identity exposure if asked tomorrow. Only 27% rate their risk exposure assessment as “excellent,” despite 64% investing in exposure management. The gap between investment and execution is where machine identities disappear.Network isolation doesn’t revoke trust chainsPulling a machine off the network doesn’t revoke the API keys it issued to downstream systems. Containment that stops at the network perimeter assumes trust is bounded by topology. Machine identities don’t respect that boundary. They authenticate across it.Gartner’s own research note warns that adversaries can spend days to months burrowing and gaining lateral movement within networks, harvesting credentials for persistence before deploying ransomware. During that burrowing phase, service accounts and API tokens are the credentials most easily harvested without triggering alerts. Seventy-six percent of organizations are concerned about stopping ransomware from spreading from an unmanaged host over SMB network shares, according to CrowdStrike. Security leaders need to map which systems trusted each machine identity so they can revoke access across the entire chain, not just the compromised endpoint.Detection logic wasn’t built for machine behaviorAnomalous machine identity behavior doesn’t trigger alerts the way a compromised user account does. Unusual API call volumes, tokens used outside automation windows, and service accounts authenticating from new locations require detection rules that most SOCs haven’t written. CrowdStrike’s survey found 85% of security teams acknowledge traditional detection methods can’t keep pace with modern threats. Yet only 53% have implemented AI-powered threat detection. The detection logic that would catch machine identity abuse barely exists in most environments.Stale service accounts remain the easiest entry pointAccounts that haven’t been rotated in years, some created by employees who left long ago, are the single weakest surface for machine-based attacks. Gartner’s guidance calls for strong authentication for “privileged users, such as database and infrastructure administrators and service accounts,” but that recommendation sits in the prevention section, not in the containment playbook where teams need it during an active incident. Orphan account audits and rotation schedules belong in pre-incident preparation, not post-breach scrambles.The economics make this urgent nowAgentic AI will multiply the problem. Eighty-seven percent of security professionals say integrating agentic AI is a priority, and 77% report comfort with allowing autonomous AI to act without human oversight, according to the Ivanti report. But just 55% use formal guardrails. Each autonomous agent creates new machine identities, identities that authenticate, make decisions, and act independently. If organizations can’t govern the machine identities they have today, they’re about to add an order of magnitude more.Gartner estimates total recovery costs at 10 times the ransom itself. CrowdStrike puts the average ransomware downtime cost at $1.7 million per incident, with public sector organizations averaging $2.5 million. Paying doesn’t help. Ninety-three percent of organizations that paid had data stolen anyway, and 83% were attacked again. Nearly 40% could not fully restore data from backups after ransomware incidents. The ransomware economy has professionalized to the point where adversary groups now encrypt files remotely over SMB network shares from unmanaged systems, never transferring the ransomware binary to a managed endpoint.Security leaders who build machine identity inventory, detection rules, and containment procedures into their playbooks now won’t just close the gap that attackers are exploiting today — they’ll be positioned to govern the autonomous identities arriving next. The test is whether those additions survive the next tabletop exercise. If they don’t hold up there, they won’t hold up in a real incident.",
          "content": "The gap between ransomware threats and the defenses meant to stop them is getting worse, not better. Ivanti’s 2026 State of Cybersecurity Report found that the preparedness gap widened by an average of 10 points year over year across every threat category the firm tracks. Ransomware hit the widest spread: 63% of security professionals rate it a high or critical threat, but just 30% say they are “very prepared” to defend against it. That’s a 33-point gap, up from 29 points a year ago.CyberArk’s 2025 Identity Security Landscape puts numbers to the problem: 82 machine identities for every human in organizations worldwide. Forty-two percent of those machine identities have privileged or sensitive access. The most authoritative playbook framework has the same blind spotGartner’s ransomware preparation guidance, the April 2024 research note “How to Prepare for Ransomware Attacks” that enterprise security teams reference when building incident response procedures, specifically calls out the need to reset “impacted user/host credentials” during containment. The accompanying Ransomware Playbook Toolkit walks teams through four phases: containment, analysis, remediation, and recovery. The credential reset step instructs teams to ensure all affected user and device accounts are reset.Service accounts are absent. So are API keys, tokens, and certificates. The most widely used playbook framework in enterprise security stops at human and device credentials. The organizations following it inherit that blind spot without realizing it.The same research note identifies the problem without connecting it to the solution. Gartner warns that “poor identity and access management (IAM) practices” remain a primary starting point for ransomware attacks, and that previously compromised credentials are being used to gain access through initial access brokers and dark web data dumps. In the recovery section, the guidance is explicit: updating or removing compromised credentials is essential because, without that step, the attacker will regain entry. Machine identities are IAM. Compromised service accounts are credentials. But the playbook’s containment procedures address neither.Gartner frames the urgency in terms few other sources match: “Ransomware is unlike any other security incident,” the research note states. “It puts affected organizations on a countdown timer. Any delay in the decision-making process introduces additional risk.” The same guidance emphasizes that recovery costs can amount to 10 times the ransom itself, and that ransomware is being deployed within one day of initial access in more than 50% of engagements. The clock is already running, but the containment procedures don’t match the urgency — not when the fastest-growing class of credentials goes unaddressed.The readiness deficit runs deeper than any single surveyIvanti’s report tracks the preparedness gap across every major threat category: ransomware, phishing, software vulnerabilities, API-related vulnerabilities, supply chain attacks, and even poor encryption. Every single one widened year over year. “Although defenders are optimistic about the promise of AI in cybersecurity, Ivanti’s findings also show companies are falling further behind in terms of how well prepared they are to defend against a variety of threats,” said Daniel Spicer, Ivanti’s Chief Security Officer. “This is what I call the ‘Cybersecurity Readiness Deficit,’ a persistent, year-over-year widening imbalance in an organization’s ability to defend their data, people, and networks against the evolving threat landscape.”CrowdStrike’s 2025 State of Ransomware Survey breaks down what that deficit looks like by industry. Among manufacturers who rated themselves “very well prepared,” just 12% recovered within 24 hours, and 40% suffered significant operational disruption. Public sector organizations fared worse: 12% recovery despite 60% confidence. Across all industries, only 38% of organizations that suffered a ransomware attack fixed the specific issue that allowed attackers in. The rest invested in general security improvements without closing the actual entry point.Fifty-four percent of organizations said they would or probably would pay if hit by ransomware today, according to the 2026 report, despite FBI guidance against payment. That willingness to pay reflects a fundamental lack of containment alternatives, exactly the kind that machine identity procedures would provide.Where machine identity playbooks fall shortFive containment steps define most ransomware response procedures today. Machine identities are missing from every one of them.Credential resets weren’t designed for machinesResetting every employee’s password after an incident is standard practice, but it doesn’t stop lateral movement through a compromised service account. Gartner’s own playbook template shows the blind spot clearly. The Ransomware Playbook Sample’s containment sheet lists three credential reset steps: force logout of all affected user accounts via Active Directory, force password change on all affected user accounts via Active Directory, and reset the device account via Active Directory. Three steps, all Active Directory, zero non-human credentials. No service accounts, no API keys, no tokens, no certificates. Machine credentials need their own chain of command.Nobody inventories machine identities before an incidentYou can’t reset credentials that you don’t know exist. Service accounts, API keys, and tokens need ownership assignments mapped pre-incident. Discovering them mid-breach costs days. Just 51% of organizations even have a cybersecurity exposure score, Ivanti&#x27;s report found, which means nearly half couldn’t tell the board their machine identity exposure if asked tomorrow. Only 27% rate their risk exposure assessment as “excellent,” despite 64% investing in exposure management. The gap between investment and execution is where machine identities disappear.Network isolation doesn’t revoke trust chainsPulling a machine off the network doesn’t revoke the API keys it issued to downstream systems. Containment that stops at the network perimeter assumes trust is bounded by topology. Machine identities don’t respect that boundary. They authenticate across it.Gartner’s own research note warns that adversaries can spend days to months burrowing and gaining lateral movement within networks, harvesting credentials for persistence before deploying ransomware. During that burrowing phase, service accounts and API tokens are the credentials most easily harvested without triggering alerts. Seventy-six percent of organizations are concerned about stopping ransomware from spreading from an unmanaged host over SMB network shares, according to CrowdStrike. Security leaders need to map which systems trusted each machine identity so they can revoke access across the entire chain, not just the compromised endpoint.Detection logic wasn’t built for machine behaviorAnomalous machine identity behavior doesn’t trigger alerts the way a compromised user account does. Unusual API call volumes, tokens used outside automation windows, and service accounts authenticating from new locations require detection rules that most SOCs haven’t written. CrowdStrike’s survey found 85% of security teams acknowledge traditional detection methods can’t keep pace with modern threats. Yet only 53% have implemented AI-powered threat detection. The detection logic that would catch machine identity abuse barely exists in most environments.Stale service accounts remain the easiest entry pointAccounts that haven’t been rotated in years, some created by employees who left long ago, are the single weakest surface for machine-based attacks. Gartner’s guidance calls for strong authentication for “privileged users, such as database and infrastructure administrators and service accounts,” but that recommendation sits in the prevention section, not in the containment playbook where teams need it during an active incident. Orphan account audits and rotation schedules belong in pre-incident preparation, not post-breach scrambles.The economics make this urgent nowAgentic AI will multiply the problem. Eighty-seven percent of security professionals say integrating agentic AI is a priority, and 77% report comfort with allowing autonomous AI to act without human oversight, according to the Ivanti report. But just 55% use formal guardrails. Each autonomous agent creates new machine identities, identities that authenticate, make decisions, and act independently. If organizations can’t govern the machine identities they have today, they’re about to add an order of magnitude more.Gartner estimates total recovery costs at 10 times the ransom itself. CrowdStrike puts the average ransomware downtime cost at $1.7 million per incident, with public sector organizations averaging $2.5 million. Paying doesn’t help. Ninety-three percent of organizations that paid had data stolen anyway, and 83% were attacked again. Nearly 40% could not fully restore data from backups after ransomware incidents. The ransomware economy has professionalized to the point where adversary groups now encrypt files remotely over SMB network shares from unmanaged systems, never transferring the ransomware binary to a managed endpoint.Security leaders who build machine identity inventory, detection rules, and containment procedures into their playbooks now won’t just close the gap that attackers are exploiting today — they’ll be positioned to govern the autonomous identities arriving next. The test is whether those additions survive the next tabletop exercise. If they don’t hold up there, they won’t hold up in a real incident.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/FM3OmDrk1ni5sgIcPNXs6/9d2bca6ed49236fae4209daee1494204/hero.jpg?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/presidents-day-sales-2026-are-live-the-best-tech-deals-up-to-43-percent-off-to-shop-from-apple-samsung-anker-and-others-163000321.html",
          "published_at": "Mon, 16 Feb 2026 14:51:22 +0000",
          "title": "Presidents' Day sales 2026 are live: The best tech deals up to 43 percent off to shop from Apple, Samsung, Anker and others",
          "standfirst": "Presidents’ Day is a great time to buy appliances, mattresses and furniture as they are often on sale for the holiday. Tech also gets discounted around this time, but you have to do a bit more digging to find actually good deals. And this year, Presidents’ Day comes right after Valentine’s Day and Super Bowl 2026, which means there are some overlapping sales to consider. If you don’t want to sort through the mess of bad deals out there, Engadget has you covered. We’re curating the best President Day sales on tech we can find right here. We’ll update this post through the holiday as more deals become available. Presidents’ Day deals under $50 Disney+ and Hulu bundle (one month) for $10 ($3 off): You can get one month of Disney+ and Hulu access for only $10 right now. That represents a small savings over the standard $13-per-month price for the bundle, but a 58-percent discount when you compare it to the price of paying for both services separately. It’s a good way to test out the bundle without paying too much before you decide if you want to subscribe for the long haul. Anker Nano 45W USB-C charger for $30 ($10 off, Prime exclusive): Anker’s latest 45W charger has a small smart display on it that can show you real-time charging stats. It’s compact design is great for travel, as are its foldable prongs. Waterpik cordless rechargeable water flosser for $40 (20 percent off): A water flosser like this one can make it easier (and less painful in some cases) to floss your teeth on the regular. This model from Waterpik includes two interchangeable tips and has two pressure settings. Its battery life should last up to four weeks with regular use as well. Amazon Fire TV Stick 4K Max for $40 ($20 off): Amazon’s most premium streaming dongle supports 4K HDR content, Dolby Vision and Wi-Fi 6E. You may even be able to get it for $10 less than the sale price listed, for a final price of $30, when using the code MAX4KFTV at checkout. Blink Mini 2K+ — 2 cameras for $45 (50 percent off): Blink’s latest plug-in security cameras support 2K video and improved audio quality. Like previous versions, these cameras have two-way talk, motion alerts and support for Alexa voice commands. Presidents’ Day deals on Apple devices Apple iPhone Air MagSafe battery pack for $79 (20 percent off): This magnetic power bank will add up to 65 percent additional battery charge to the iPhone Air, but note that it only works with Apple’s new, ultra-slim smartphone. We’ve tested plenty of others that also work with other iPhone and smartphone models. Apple Magic Mouse for $68 (14 percent off): Apple’s sleek wireless mouse has a multi-touch surface that supports gesture control, and its battery should last about a month in between charges. And yes, it has a USB-C port. Apple Watch Series 11 for $299 ($100 off): The latest flagship Apple Watch has excellent performance, a boosted battery life and a lightweight design that you can comfortably wear all day long — and even into the night to track sleep. iPad mini (A17 Pro ) for $399 ($100 off): The updated iPad mini runs on the A17 Pro chip for improved performance, plus it has an 8.3-inch Liquid Retina display, a 12MP ultra wide camera with Center Stage, USB-C charging and compatibility with the Apple Pencil Pro. Beats Studio Pro for $200 (43 percent off): Beats updated these cans to have improved sound quality, and you can really hear the difference from models that came before it. These headphones also have solid Transparency mode, good voice performance and USB-C audio. Beats Solo 4 headphones for $150 (25 percent off): These on-ear headphones support spatial audio and dynamic head tracking, and they have up to 50 hours of battery life. The “fast fuel” feature allows them to get up to five hours of playback time with just a quick 10-minute power-up. Beats Studio Buds+ for $100 (41 percent off): These tiny buds have both active noise cancellation and transparency mode, and they’ll work just as well with either Apple or Android devices. More Presidents’ Day deals on tech Ring Battery Doorbell for $60 (40 percent off) Logitech MX Master 3S for $80 (20 percent off) Levoit Core 300-P air purifier for $85 (15 percent off) Sony WH-CH720N wireless headphones for $94 (48 percent off) Google Pixel Buds Pro 2 earbuds for $179 (22 percent off) Sonos Beam Gen 2 soundbar for $369 ($130 off) Hisense 75-inch QD7 Mini-LED 4K smart TV for $548 (16 percent off) Breville Barista Touch espresso machine for $800 ($200 off) Motorola Razer Ultra (2025) for $800 (38 percent off) Google Pixel 10 Pro for $849 (23 percent off) This article originally appeared on Engadget at https://www.engadget.com/deals/presidents-day-sales-2026-are-live-the-best-tech-deals-up-to-43-percent-off-to-shop-from-apple-samsung-anker-and-others-163000321.html?src=rss",
          "content": "Presidents’ Day is a great time to buy appliances, mattresses and furniture as they are often on sale for the holiday. Tech also gets discounted around this time, but you have to do a bit more digging to find actually good deals. And this year, Presidents’ Day comes right after Valentine’s Day and Super Bowl 2026, which means there are some overlapping sales to consider. If you don’t want to sort through the mess of bad deals out there, Engadget has you covered. We’re curating the best President Day sales on tech we can find right here. We’ll update this post through the holiday as more deals become available. Presidents’ Day deals under $50 Disney+ and Hulu bundle (one month) for $10 ($3 off): You can get one month of Disney+ and Hulu access for only $10 right now. That represents a small savings over the standard $13-per-month price for the bundle, but a 58-percent discount when you compare it to the price of paying for both services separately. It’s a good way to test out the bundle without paying too much before you decide if you want to subscribe for the long haul. Anker Nano 45W USB-C charger for $30 ($10 off, Prime exclusive): Anker’s latest 45W charger has a small smart display on it that can show you real-time charging stats. It’s compact design is great for travel, as are its foldable prongs. Waterpik cordless rechargeable water flosser for $40 (20 percent off): A water flosser like this one can make it easier (and less painful in some cases) to floss your teeth on the regular. This model from Waterpik includes two interchangeable tips and has two pressure settings. Its battery life should last up to four weeks with regular use as well. Amazon Fire TV Stick 4K Max for $40 ($20 off): Amazon’s most premium streaming dongle supports 4K HDR content, Dolby Vision and Wi-Fi 6E. You may even be able to get it for $10 less than the sale price listed, for a final price of $30, when using the code MAX4KFTV at checkout. Blink Mini 2K+ — 2 cameras for $45 (50 percent off): Blink’s latest plug-in security cameras support 2K video and improved audio quality. Like previous versions, these cameras have two-way talk, motion alerts and support for Alexa voice commands. Presidents’ Day deals on Apple devices Apple iPhone Air MagSafe battery pack for $79 (20 percent off): This magnetic power bank will add up to 65 percent additional battery charge to the iPhone Air, but note that it only works with Apple’s new, ultra-slim smartphone. We’ve tested plenty of others that also work with other iPhone and smartphone models. Apple Magic Mouse for $68 (14 percent off): Apple’s sleek wireless mouse has a multi-touch surface that supports gesture control, and its battery should last about a month in between charges. And yes, it has a USB-C port. Apple Watch Series 11 for $299 ($100 off): The latest flagship Apple Watch has excellent performance, a boosted battery life and a lightweight design that you can comfortably wear all day long — and even into the night to track sleep. iPad mini (A17 Pro ) for $399 ($100 off): The updated iPad mini runs on the A17 Pro chip for improved performance, plus it has an 8.3-inch Liquid Retina display, a 12MP ultra wide camera with Center Stage, USB-C charging and compatibility with the Apple Pencil Pro. Beats Studio Pro for $200 (43 percent off): Beats updated these cans to have improved sound quality, and you can really hear the difference from models that came before it. These headphones also have solid Transparency mode, good voice performance and USB-C audio. Beats Solo 4 headphones for $150 (25 percent off): These on-ear headphones support spatial audio and dynamic head tracking, and they have up to 50 hours of battery life. The “fast fuel” feature allows them to get up to five hours of playback time with just a quick 10-minute power-up. Beats Studio Buds+ for $100 (41 percent off): These tiny buds have both active noise cancellation and transparency mode, and they’ll work just as well with either Apple or Android devices. More Presidents’ Day deals on tech Ring Battery Doorbell for $60 (40 percent off) Logitech MX Master 3S for $80 (20 percent off) Levoit Core 300-P air purifier for $85 (15 percent off) Sony WH-CH720N wireless headphones for $94 (48 percent off) Google Pixel Buds Pro 2 earbuds for $179 (22 percent off) Sonos Beam Gen 2 soundbar for $369 ($130 off) Hisense 75-inch QD7 Mini-LED 4K smart TV for $548 (16 percent off) Breville Barista Touch espresso machine for $800 ($200 off) Motorola Razer Ultra (2025) for $800 (38 percent off) Google Pixel 10 Pro for $849 (23 percent off) This article originally appeared on Engadget at https://www.engadget.com/deals/presidents-day-sales-2026-are-live-the-best-tech-deals-up-to-43-percent-off-to-shop-from-apple-samsung-anker-and-others-163000321.html?src=rss",
          "feed_position": 9
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/apple-presidents-day-sales-are-live-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-now-151616701.html",
          "published_at": "Mon, 16 Feb 2026 14:44:47 +0000",
          "title": "Apple Presidents' Day sales are live: Get the Apple Watch Series 11 for $299, plus more deals to shop now",
          "standfirst": "If you need a little help with your New Year's resolution to be more active, you can save on the latest Apple Watch right now. The Apple Watch Series 11 is on sale for $299 for Presidents' Day, which is $100 off and the lowest price we've seen. A number of other Apple devices are on sale for the holiday as well. We named the Apple Watch Series 11 as our choice for best smartwatch overall. It scored a 90 in our review thanks to its 24 hours-plus of battery life and a thin, light design that's easy to wear. It also offers new health metrics, including Apple's hypertension alerts system and Sleep Score. The Apple Watch Series 11 deal is available on the 42mm case with a small/medium band. It also only includes GPS and four colorways: the Jet Black and Space Gray aluminum cases with a Black sport band, the Rose Gold aluminum case with a Light Blush sport band and the Silver aluminum case with a Purple Fog sport band. Among the other Presidents' Day Apple deals are mostly accessories: there are solid deals on AirPods, AirTags (the first-gen trackers, not the new, second-gen ones), the iPhone Air battery pack and even Apple's new crossbody straps that attach to the company's iPhone cases so you can essentially \"wear\" your iPhone like a bag. As with most Apple first-party accessories, you can find plenty of more affordable, third-party versions of them as alternatives. But if you're keen on outfitting your phone with Apple's own gear, it's best to wait for discounts like these. We've collected the best Presidents' Day sales on Apple gear below so you don't have to go searching for them. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apple-presidents-day-sales-are-live-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-now-151616701.html?src=rss",
          "content": "If you need a little help with your New Year's resolution to be more active, you can save on the latest Apple Watch right now. The Apple Watch Series 11 is on sale for $299 for Presidents' Day, which is $100 off and the lowest price we've seen. A number of other Apple devices are on sale for the holiday as well. We named the Apple Watch Series 11 as our choice for best smartwatch overall. It scored a 90 in our review thanks to its 24 hours-plus of battery life and a thin, light design that's easy to wear. It also offers new health metrics, including Apple's hypertension alerts system and Sleep Score. The Apple Watch Series 11 deal is available on the 42mm case with a small/medium band. It also only includes GPS and four colorways: the Jet Black and Space Gray aluminum cases with a Black sport band, the Rose Gold aluminum case with a Light Blush sport band and the Silver aluminum case with a Purple Fog sport band. Among the other Presidents' Day Apple deals are mostly accessories: there are solid deals on AirPods, AirTags (the first-gen trackers, not the new, second-gen ones), the iPhone Air battery pack and even Apple's new crossbody straps that attach to the company's iPhone cases so you can essentially \"wear\" your iPhone like a bag. As with most Apple first-party accessories, you can find plenty of more affordable, third-party versions of them as alternatives. But if you're keen on outfitting your phone with Apple's own gear, it's best to wait for discounts like these. We've collected the best Presidents' Day sales on Apple gear below so you don't have to go searching for them. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apple-presidents-day-sales-are-live-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-now-151616701.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/the-creators-of-mixtape-want-to-make-a-great-hangout-video-game-140026928.html",
          "published_at": "Mon, 16 Feb 2026 14:00:26 +0000",
          "title": "The creators of Mixtape want to make a great hangout video game",
          "standfirst": "For most adventure games, the long-term goal can often focus on solving a grand mystery or chasing a lost artifact of the past. But for the upcoming Mixtape, from publisher Annapurna Interactive, it sets its sights on the misadventures of young friends enjoying their last days together before moving on. It's the type of narrative adventure game that shines a light on how good music can bring people together, and how much fun getting into trouble can be. From developer Beethoven and Dinosaur, the Australian creative team behind The Artful Escape, Mixtape is, in many ways, a tribute to classic '90s Americana and an ode to the rebellious youth of the average suburb. I recently got to play the latest build of Mixtape and spoke with game director Johnny Galvatron about the making of their latest game. Along with sharing his favorite '80s and ’90s films that helped shape his vision, he also explained how tough yet rewarding it is to make \"idleness\" in video games compelling. \"Idleness is hard to explore as a video game, and one of the interesting things about being a teenager is you just hang out a lot, and sometimes it just sucks,\" said Galvatron. \"So I love that we made a game that shows that idleness.” “I think it can be a really hard balance to make something that is based on what is really a hangout film, something like Wayne's World or Richard Linklater's Dazed and Confused, but to have that be paced well and to be exciting for a video game was a real challenge.\" Set in the 1990s, Rockford and her friends Slater and Cassandra prepare for one last hurrah before heading into adulthood. With Rockford deciding to make a daring move to New York City to hopefully connect with her music idol, the crew reminisces on the good times they had going for late-night fast food runs, evading the police in shopping carts, and first kisses with their crushes – and all to the tune of their favorite songs. Beethoven & Dinosaur On the surface, Mixtape is an interactive coming-of-age story about a crew of rebellious teens, with memories serving as playable mini-games and interludes that capture their feelings at the time. But that's actually what makes this interactive trip down memory lane so compelling. These segments are presented as exaggerated memories of the past, fueled by the music of Devo, Joy Division, and Siouxsie and the Banshees. They’re emotional, poignant moments for these characters, tapping into the idea of how moments from our youth seemed bigger and grander than they actually were. One section I enjoyed playing was an interactive head-bobbing segment where the crew drove across town to get fast food. Different buttons corresponded to fist-pumping and head-bobbing actions, but there were no specific directions, so I just had to go with the flow. This scene was a great bit of comedy that showed off how goofy Rockford and her friends could get while vibing, but it was also a fun callback to films like Pulp Fiction, which used rear-projection sets to simulate car driving scenes (the memory even plays out on a film set). Another segment focused on a photo booth with Rockford and Slater, which put them in a position to capture the best or funniest shots. But it's not all fun and games with the crew. One segment focused on the friends tossing toilet paper rolls around their school principal's home, which quickly takes a turn for the worse when one of them decides to take the blame to spare Rockford from expulsion. It's a surprisingly heartfelt and sad moment, but it also foreshadows a simmering conflict for these characters. It's clear that Mixtape seeks to capture the experiences of a particular era, and that the developers themselves had a particular fondness for American movies and pop culture of the time. It captures the feeling of the so-called MTV generation and the intersection of media and the emotional expression of youth during this period. This is also evident in the game's use of a \"mixed media, liquid television\" editing style, which intercuts clips from TV shows and movies to emphasize emotional and comedic beats.. Rockford even does a Ferris Bueller-style narration for the players. Given that video game-to-movie adaptations have never been more popular, game director Johnny Galvatron has also had some talks about a potential movie adaptation. \"Obviously, Annapurna is also a film company, and they have those kinds of connections, and let me tell you, those meetings are fun as fuck,\" said the director. \"When people pitch you stuff, it's super cool. I would just say that, yes, I can see it coming. I would probably be totally hands-off on it.\" “When you develop video games, you should be changing them to work better within the medium,\" he continued. \"I think when they try to adhere too closely to the way a game works, that can sometimes break down. But yeah, I think if there were to be some adaptation stuff for Mixtape, probably, and I will stay clear of it.\" Beethoven & Dinosaur Mixtape feels like a heartfelt tribute to the '90s. While nostalgia bait is increasingly common these days, I felt there's a much deeper message under the hood, and getting to take part in these larger-than-life days of being a young adult has really got me excited for what's to come. I'm hoping the final game will deliver an adventure where I can really savor those listless hangouts with friends. Mixtape is set to be released on PC, PlayStation 5, and Xbox Series X|S later this year.This article originally appeared on Engadget at https://www.engadget.com/gaming/the-creators-of-mixtape-want-to-make-a-great-hangout-video-game-140026928.html?src=rss",
          "content": "For most adventure games, the long-term goal can often focus on solving a grand mystery or chasing a lost artifact of the past. But for the upcoming Mixtape, from publisher Annapurna Interactive, it sets its sights on the misadventures of young friends enjoying their last days together before moving on. It's the type of narrative adventure game that shines a light on how good music can bring people together, and how much fun getting into trouble can be. From developer Beethoven and Dinosaur, the Australian creative team behind The Artful Escape, Mixtape is, in many ways, a tribute to classic '90s Americana and an ode to the rebellious youth of the average suburb. I recently got to play the latest build of Mixtape and spoke with game director Johnny Galvatron about the making of their latest game. Along with sharing his favorite '80s and ’90s films that helped shape his vision, he also explained how tough yet rewarding it is to make \"idleness\" in video games compelling. \"Idleness is hard to explore as a video game, and one of the interesting things about being a teenager is you just hang out a lot, and sometimes it just sucks,\" said Galvatron. \"So I love that we made a game that shows that idleness.” “I think it can be a really hard balance to make something that is based on what is really a hangout film, something like Wayne's World or Richard Linklater's Dazed and Confused, but to have that be paced well and to be exciting for a video game was a real challenge.\" Set in the 1990s, Rockford and her friends Slater and Cassandra prepare for one last hurrah before heading into adulthood. With Rockford deciding to make a daring move to New York City to hopefully connect with her music idol, the crew reminisces on the good times they had going for late-night fast food runs, evading the police in shopping carts, and first kisses with their crushes – and all to the tune of their favorite songs. Beethoven & Dinosaur On the surface, Mixtape is an interactive coming-of-age story about a crew of rebellious teens, with memories serving as playable mini-games and interludes that capture their feelings at the time. But that's actually what makes this interactive trip down memory lane so compelling. These segments are presented as exaggerated memories of the past, fueled by the music of Devo, Joy Division, and Siouxsie and the Banshees. They’re emotional, poignant moments for these characters, tapping into the idea of how moments from our youth seemed bigger and grander than they actually were. One section I enjoyed playing was an interactive head-bobbing segment where the crew drove across town to get fast food. Different buttons corresponded to fist-pumping and head-bobbing actions, but there were no specific directions, so I just had to go with the flow. This scene was a great bit of comedy that showed off how goofy Rockford and her friends could get while vibing, but it was also a fun callback to films like Pulp Fiction, which used rear-projection sets to simulate car driving scenes (the memory even plays out on a film set). Another segment focused on a photo booth with Rockford and Slater, which put them in a position to capture the best or funniest shots. But it's not all fun and games with the crew. One segment focused on the friends tossing toilet paper rolls around their school principal's home, which quickly takes a turn for the worse when one of them decides to take the blame to spare Rockford from expulsion. It's a surprisingly heartfelt and sad moment, but it also foreshadows a simmering conflict for these characters. It's clear that Mixtape seeks to capture the experiences of a particular era, and that the developers themselves had a particular fondness for American movies and pop culture of the time. It captures the feeling of the so-called MTV generation and the intersection of media and the emotional expression of youth during this period. This is also evident in the game's use of a \"mixed media, liquid television\" editing style, which intercuts clips from TV shows and movies to emphasize emotional and comedic beats.. Rockford even does a Ferris Bueller-style narration for the players. Given that video game-to-movie adaptations have never been more popular, game director Johnny Galvatron has also had some talks about a potential movie adaptation. \"Obviously, Annapurna is also a film company, and they have those kinds of connections, and let me tell you, those meetings are fun as fuck,\" said the director. \"When people pitch you stuff, it's super cool. I would just say that, yes, I can see it coming. I would probably be totally hands-off on it.\" “When you develop video games, you should be changing them to work better within the medium,\" he continued. \"I think when they try to adhere too closely to the way a game works, that can sometimes break down. But yeah, I think if there were to be some adaptation stuff for Mixtape, probably, and I will stay clear of it.\" Beethoven & Dinosaur Mixtape feels like a heartfelt tribute to the '90s. While nostalgia bait is increasingly common these days, I felt there's a much deeper message under the hood, and getting to take part in these larger-than-life days of being a young adult has really got me excited for what's to come. I'm hoping the final game will deliver an adventure where I can really savor those listless hangouts with friends. Mixtape is set to be released on PC, PlayStation 5, and Xbox Series X|S later this year.This article originally appeared on Engadget at https://www.engadget.com/gaming/the-creators-of-mixtape-want-to-make-a-great-hangout-video-game-140026928.html?src=rss",
          "feed_position": 11,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2026-02/c6e2c951-0b1b-11f1-bfbf-b1ee139f1ebe"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/monarch-money-deal-get-a-50-percent-off-one-of-our-favorite-budgeting-apps-120000712.html",
          "published_at": "Mon, 16 Feb 2026 12:00:00 +0000",
          "title": "Monarch Money deal: Get a 50 percent off one of our favorite budgeting apps",
          "standfirst": "If you’ve been meaning to get a better handle on your finances, now might be a good time to try one of our favorite budgeting apps without paying full price. Monarch Money is offering new users 50 percent off an annual subscription when you use the code MONARCHVIP at checkout, bringing the cost down to $50 for a full year of access instead of the usual $100. Monarch regularly earns a spot in our guide to the best budgeting apps thanks to its detailed tracking tools, flexible budgeting systems and collaborative features. The app lets you connect unlimited accounts, track spending and investments, set financial goals and share access with a partner, all across web, mobile and tablet apps. Monarch Money is the kind of budgeting app that can feel a little overwhelming at first, especially when you’re setting up categories, rules and recurring transactions. There’s a bit of a learning curve, and some of the finer details are easier to manage on the web than in the mobile app. But once you’re past that initial setup, it starts to make a lot more sense and becomes a powerful tool for keeping tabs on your finances. Where Monarch Money really shines is in the level of detail it offers. It’s built for people who want a clear, structured view of their money, not just a running list of transactions. In the budgeting section, you can see budgets versus actual spending by category, along with forecasts by month or by year. Recurring expenses can also be defined using more than just merchant names, which helps keep things accurate with less manual cleanup. Beyond day-to-day budgeting, Monarch does a good job of showing the bigger picture. It includes visual reports and charts that make it easier to spot trends over time, plus tools for tracking net worth, investments and financial goals. Monarch can even factor in non-cash assets like your home or vehicle, pulling in estimates automatically so they appear alongside your accounts. All of that depth won’t be for everyone, but if you’re willing to spend a little time getting set up, Monarch Money offers a lot of control and insight. With the current deal bringing the price down to $50 for a full year, it’s a solid opportunity to try one of our favorite budgeting apps at a discount of 50 percent off and see if it fits how you like to manage your money. This article originally appeared on Engadget at https://www.engadget.com/deals/monarch-money-deal-get-a-50-percent-off-one-of-our-favorite-budgeting-apps-120000712.html?src=rss",
          "content": "If you’ve been meaning to get a better handle on your finances, now might be a good time to try one of our favorite budgeting apps without paying full price. Monarch Money is offering new users 50 percent off an annual subscription when you use the code MONARCHVIP at checkout, bringing the cost down to $50 for a full year of access instead of the usual $100. Monarch regularly earns a spot in our guide to the best budgeting apps thanks to its detailed tracking tools, flexible budgeting systems and collaborative features. The app lets you connect unlimited accounts, track spending and investments, set financial goals and share access with a partner, all across web, mobile and tablet apps. Monarch Money is the kind of budgeting app that can feel a little overwhelming at first, especially when you’re setting up categories, rules and recurring transactions. There’s a bit of a learning curve, and some of the finer details are easier to manage on the web than in the mobile app. But once you’re past that initial setup, it starts to make a lot more sense and becomes a powerful tool for keeping tabs on your finances. Where Monarch Money really shines is in the level of detail it offers. It’s built for people who want a clear, structured view of their money, not just a running list of transactions. In the budgeting section, you can see budgets versus actual spending by category, along with forecasts by month or by year. Recurring expenses can also be defined using more than just merchant names, which helps keep things accurate with less manual cleanup. Beyond day-to-day budgeting, Monarch does a good job of showing the bigger picture. It includes visual reports and charts that make it easier to spot trends over time, plus tools for tracking net worth, investments and financial goals. Monarch can even factor in non-cash assets like your home or vehicle, pulling in estimates automatically so they appear alongside your accounts. All of that depth won’t be for everyone, but if you’re willing to spend a little time getting set up, Monarch Money offers a lot of control and insight. With the current deal bringing the price down to $50 for a full year, it’s a solid opportunity to try one of our favorite budgeting apps at a discount of 50 percent off and see if it fits how you like to manage your money. This article originally appeared on Engadget at https://www.engadget.com/deals/monarch-money-deal-get-a-50-percent-off-one-of-our-favorite-budgeting-apps-120000712.html?src=rss",
          "feed_position": 12
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html",
          "published_at": "Mon, 16 Feb 2026 10:00:38 +0000",
          "title": "The best gaming handhelds for 2026",
          "standfirst": "Handheld gaming systems aren’t niche anymore. Today’s devices range from compact devices built around retro emulation to full-fledged portable PCs capable of running modern AAA games. That variety is exciting, but it also makes shopping harder. The “best” gaming handheld now depends less on a single, standout device and more on how, where and what you want to play.Some handhelds are designed for quick sessions and classic libraries, prioritizing simplicity, long battery life and pocketable designs. Others blur the line between console and PC, offering large screens, powerful chips and access to massive game libraries, often at the cost of size, price or endurance. There are even more experimental options that focus on unusual controls or intentionally limited experiences.We’ve spent months testing and tracking the fast-moving handheld space to figure out which devices are actually worth your money right now. Whether you’re looking for a versatile all-rounder, a premium portable gaming PC or a dedicated machine for retro games, these are the gaming handhelds that stand out in an increasingly crowded field.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Best handheld gaming devices for 2026 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "content": "Handheld gaming systems aren’t niche anymore. Today’s devices range from compact devices built around retro emulation to full-fledged portable PCs capable of running modern AAA games. That variety is exciting, but it also makes shopping harder. The “best” gaming handheld now depends less on a single, standout device and more on how, where and what you want to play.Some handhelds are designed for quick sessions and classic libraries, prioritizing simplicity, long battery life and pocketable designs. Others blur the line between console and PC, offering large screens, powerful chips and access to massive game libraries, often at the cost of size, price or endurance. There are even more experimental options that focus on unusual controls or intentionally limited experiences.We’ve spent months testing and tracking the fast-moving handheld space to figure out which devices are actually worth your money right now. Whether you’re looking for a versatile all-rounder, a premium portable gaming PC or a dedicated machine for retro games, these are the gaming handhelds that stand out in an increasingly crowded field.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Best handheld gaming devices for 2026 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "feed_position": 14,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-06/f88e8cd0-4638-11f0-bffd-78988bb5f8ab"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html",
          "published_at": "Mon, 16 Feb 2026 08:00:35 +0000",
          "title": "The best cheap phones for 2026",
          "standfirst": "A few years ago, it may have been fashionable to spend $1,000 on the latest flagship smartphone, but for most people, that’s neither practical nor necessary. You don't even have to spend $500 today to get a decent handset, whether it’s a refurbished iPhone or an affordable Android phone, as there are plenty of decent options as low as $160.However, navigating the budget phone market can be tricky; options that look good on paper may not be in practice, and some devices will end up costing you more when you consider many come with restrictive storage. While we spend most of our time reviewing mid- to high-end handsets at Engadget, we've tested a number of the latest budget-friendly phones on the market to see cut it as the best cheap phones you can get right now. Best cheap phones What to look for in a cheap phone For this guide, our top picks cost between $100 and $300. Anything less and you might as well go buy a dumb phone instead. Since they’re meant to be more affordable than flagship phones and even midrange handsets, budget smartphones involve compromises; the cheaper a device, the lower your expectations around specs, performance and experience should be. For that reason, the best advice I can give is to spend as much as you can afford. In this price range, even $50 or $100 more can get you a dramatically better product. Second, you should know what you want most from a phone. When buying a budget smartphone, you may need to sacrifice a decent main camera for long battery life, or trade a high-resolution display for a faster CPU. That’s just what comes with the territory, but knowing your priorities will make it easier to find the right phone. It’s also worth noting some features can be hard to find on cheaper handsets. For instance, you won’t need to search far for a device with all-day battery life — but if you want a phone with excellent camera quality, you’re better off shelling out for one of the recommendations in our midrange smartphone guide, which all come in at $600 or less. Wireless charging and waterproofing also aren’t easy to find in this price range and forget about the fastest chipset. On the bright side, most of our recommendations come with headphone jacks, so you won’t need to buy wireless headphones. iOS is also off the table, since, following the discontinuation of the iPhone SE, the $599 iPhone 16e is now the most affordable offering from Apple. That leaves Android as the only option in the under-$300 price range. Thankfully today, there’s little to complain about Google’s operating system – and you may even prefer it to iOS. Lastly, keep in mind most Android manufacturers typically offer far less robust software features and support for their budget devices. In some cases, your new phone may only receive one major software update and a year or two of security patches beyond that. That applies to the OnePlus and Motorola recommendations on our list. If you’d like to keep your phone for as long as possible, Samsung has the best software policy of any Android manufacturer in the budget space, offering at least four years of security updates on all of its devices. Recently, it even began offering six years of support on the $200 A16 5G, which we recommend below. That said, if software support (or device longevity overall) is your main focus, consider spending a bit more on the $500 Google Pixel 9a, or even the previous-gen Pixel 8a, which has planned software updates through mid-2031.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html?src=rss",
          "content": "A few years ago, it may have been fashionable to spend $1,000 on the latest flagship smartphone, but for most people, that’s neither practical nor necessary. You don't even have to spend $500 today to get a decent handset, whether it’s a refurbished iPhone or an affordable Android phone, as there are plenty of decent options as low as $160.However, navigating the budget phone market can be tricky; options that look good on paper may not be in practice, and some devices will end up costing you more when you consider many come with restrictive storage. While we spend most of our time reviewing mid- to high-end handsets at Engadget, we've tested a number of the latest budget-friendly phones on the market to see cut it as the best cheap phones you can get right now. Best cheap phones What to look for in a cheap phone For this guide, our top picks cost between $100 and $300. Anything less and you might as well go buy a dumb phone instead. Since they’re meant to be more affordable than flagship phones and even midrange handsets, budget smartphones involve compromises; the cheaper a device, the lower your expectations around specs, performance and experience should be. For that reason, the best advice I can give is to spend as much as you can afford. In this price range, even $50 or $100 more can get you a dramatically better product. Second, you should know what you want most from a phone. When buying a budget smartphone, you may need to sacrifice a decent main camera for long battery life, or trade a high-resolution display for a faster CPU. That’s just what comes with the territory, but knowing your priorities will make it easier to find the right phone. It’s also worth noting some features can be hard to find on cheaper handsets. For instance, you won’t need to search far for a device with all-day battery life — but if you want a phone with excellent camera quality, you’re better off shelling out for one of the recommendations in our midrange smartphone guide, which all come in at $600 or less. Wireless charging and waterproofing also aren’t easy to find in this price range and forget about the fastest chipset. On the bright side, most of our recommendations come with headphone jacks, so you won’t need to buy wireless headphones. iOS is also off the table, since, following the discontinuation of the iPhone SE, the $599 iPhone 16e is now the most affordable offering from Apple. That leaves Android as the only option in the under-$300 price range. Thankfully today, there’s little to complain about Google’s operating system – and you may even prefer it to iOS. Lastly, keep in mind most Android manufacturers typically offer far less robust software features and support for their budget devices. In some cases, your new phone may only receive one major software update and a year or two of security patches beyond that. That applies to the OnePlus and Motorola recommendations on our list. If you’d like to keep your phone for as long as possible, Samsung has the best software policy of any Android manufacturer in the budget space, offering at least four years of security updates on all of its devices. Recently, it even began offering six years of support on the $200 A16 5G, which we recommend below. That said, if software support (or device longevity overall) is your main focus, consider spending a bit more on the $500 Google Pixel 9a, or even the previous-gen Pixel 8a, which has planned software updates through mid-2031.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html?src=rss",
          "feed_position": 16
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/infrastructure/nvidia-groq-and-the-limestone-race-to-real-time-ai-why-enterprises-win-or",
          "published_at": "Sun, 15 Feb 2026 19:00:00 GMT",
          "title": "Nvidia, Groq and the limestone race to real-time AI: Why enterprises win or lose here",
          "standfirst": "​From miles away across the desert, the Great Pyramid looks like a perfect, smooth geometry — a sleek triangle pointing to the stars. Stand at the base, however, and the illusion of smoothness vanishes. You see massive, jagged blocks of limestone. It is not a slope; it is a staircase.​Remember this the next time you hear futurists talking about exponential growth.​Intel’s co-founder Gordon Moore (Moore&#x27;s Law) is famously quoted for saying in 1965 that the transistor count on a microchip would double every year. Another Intel executive, David House, later revised this statement to “compute power doubling every 18 months.\" For a while, Intel’s CPUs were the poster child of this law. That is, until the growth in CPU performance flattened out like a block of limestone.​If you zoom out, though, the next limestone block was already there — the growth in compute merely shifted from CPUs to the world of GPUs. Jensen Huang, Nvidia’s CEO, played a long game and came out a strong winner, building his own stepping stones initially with gaming, then computer visioniand recently, generative AI.​The illusion of smooth growth​Technology growth is full of sprints and plateaus, and gen AI is not immune. The current wave is driven by transformer architecture. To quote Anthropic’s President and co-founder Dario Amodei: “The exponential continues until it doesn’t. And every year we’ve been like, ‘Well, this can’t possibly be the case that things will continue on the exponential’ — and then every year it has.”​But just as the CPU plateaued and GPUs took the lead, we are seeing signs that LLM growth is shifting paradigms again. For example, late in 2024, DeepSeek surprised the world by training a world-class model on an impossibly small budget, in part by using the MoE technique.​Do you remember where you recently saw this technique mentioned? Nvidia’s Rubin press release: The technology includes “...the latest generations of Nvidia NVLink interconnect technology... to accelerate agentic AI, advanced reasoning and massive-scale MoE model inference at up to 10x lower cost per token.”​Jensen knows that achieving that coveted exponential growth in compute doesn’t come from pure brute force anymore. Sometimes you need to shift the architecture entirely to place the next stepping stone.​The latency crisis: Where Groq fits in​This long introduction brings us to Groq.​The biggest gains in AI reasoning capabilities in 2025 were driven by “inference time compute” — or, in lay terms, “letting the model think for a longer period of time.” But time is money. Consumers and businesses do not like waiting.​Groq comes into play here with its lightning-speed inference. If you bring together the architectural efficiency of models like DeepSeek and the sheer throughput of Groq, you get frontier intelligence at your fingertips. By executing inference faster, you can “out-reason” competitive models, offering a “smarter” system to customers without the penalty of lag.​From universal chip to inference optimization​For the last decade, the GPU has been the universal hammer for every AI nail. You use H100s to train the model; you use H100s (or trimmed-down versions) to run the model. But as models shift toward \"System 2\" thinking — where the AI reasons, self-corrects and iterates before answering — the computational workload changes.​Training requires massive parallel brute force. Inference, especially for reasoning models, requires faster sequential processing. It must generate tokens instantly to facilitate complex chains of thought without the user waiting minutes for an answer. ​Groq’s LPU (Language Processing Unit) architecture removes the memory bandwidth bottleneck that plagues GPUs during small-batch inference, delivering lightning-fast inference.​The engine for the next wave of growth​For the C-Suite, this potential convergence solves the \"thinking time\" latency crisis. Consider the expectations from AI agents: We want them to autonomously book flights, code entire apps and research legal precedent. To do this reliably, a model might need to generate 10,000 internal \"thought tokens\" to verify its own work before it outputs a single word to the user.​On a standard GPU: 10,000 thought tokens might take 20 to 40 seconds. The user gets bored and leaves.​On Groq: That same chain of thought happens in less than 2 seconds.​If Nvidia integrates Groq’s technology, they solve the \"waiting for the robot to think\" problem. They preserve the magic of AI. Just as they moved from rendering pixels (gaming) to rendering intelligence (gen AI), they would now move to rendering reasoning in real-time.​Furthermore, this creates a formidable software moat. Groq’s biggest hurdle has always been the software stack; Nvidia’s biggest asset is CUDA. If Nvidia wraps its ecosystem around Groq’s hardware, they effectively dig a moat so wide that competitors cannot cross it. They would offer the universal platform: The best environment to train and the most efficient environment to run (Groq/LPU).Consider what happens when you couple that raw inference power with a next-generation open source model (like the rumored DeepSeek 4): You get an offering that would rival today’s frontier models in cost, performance and speed. That opens up opportunities for Nvidia, from directly entering the inference business with its own cloud offering, to continuing to power a growing number of exponentially growing customers.​The next step on the pyramid​Returning to our opening metaphor: The \"exponential\" growth of AI is not a smooth line of raw FLOPs; it is a staircase of bottlenecks being smashed.​Block 1: We couldn&#x27;t calculate fast enough. Solution: The GPU.​Block 2: We couldn&#x27;t train deep enough. Solution: Transformer architecture.​Block 3: We can&#x27;t \"think\" fast enough. Solution: Groq’s LPU.​Jensen Huang has never been afraid to cannibalize his own product lines to own the future. By validating Groq, Nvidia wouldn&#x27;t just be buying a faster chip; they would be bringing next-generation intelligence to the masses.Andrew Filev, founder and CEO of Zencoder",
          "content": "​From miles away across the desert, the Great Pyramid looks like a perfect, smooth geometry — a sleek triangle pointing to the stars. Stand at the base, however, and the illusion of smoothness vanishes. You see massive, jagged blocks of limestone. It is not a slope; it is a staircase.​Remember this the next time you hear futurists talking about exponential growth.​Intel’s co-founder Gordon Moore (Moore&#x27;s Law) is famously quoted for saying in 1965 that the transistor count on a microchip would double every year. Another Intel executive, David House, later revised this statement to “compute power doubling every 18 months.\" For a while, Intel’s CPUs were the poster child of this law. That is, until the growth in CPU performance flattened out like a block of limestone.​If you zoom out, though, the next limestone block was already there — the growth in compute merely shifted from CPUs to the world of GPUs. Jensen Huang, Nvidia’s CEO, played a long game and came out a strong winner, building his own stepping stones initially with gaming, then computer visioniand recently, generative AI.​The illusion of smooth growth​Technology growth is full of sprints and plateaus, and gen AI is not immune. The current wave is driven by transformer architecture. To quote Anthropic’s President and co-founder Dario Amodei: “The exponential continues until it doesn’t. And every year we’ve been like, ‘Well, this can’t possibly be the case that things will continue on the exponential’ — and then every year it has.”​But just as the CPU plateaued and GPUs took the lead, we are seeing signs that LLM growth is shifting paradigms again. For example, late in 2024, DeepSeek surprised the world by training a world-class model on an impossibly small budget, in part by using the MoE technique.​Do you remember where you recently saw this technique mentioned? Nvidia’s Rubin press release: The technology includes “...the latest generations of Nvidia NVLink interconnect technology... to accelerate agentic AI, advanced reasoning and massive-scale MoE model inference at up to 10x lower cost per token.”​Jensen knows that achieving that coveted exponential growth in compute doesn’t come from pure brute force anymore. Sometimes you need to shift the architecture entirely to place the next stepping stone.​The latency crisis: Where Groq fits in​This long introduction brings us to Groq.​The biggest gains in AI reasoning capabilities in 2025 were driven by “inference time compute” — or, in lay terms, “letting the model think for a longer period of time.” But time is money. Consumers and businesses do not like waiting.​Groq comes into play here with its lightning-speed inference. If you bring together the architectural efficiency of models like DeepSeek and the sheer throughput of Groq, you get frontier intelligence at your fingertips. By executing inference faster, you can “out-reason” competitive models, offering a “smarter” system to customers without the penalty of lag.​From universal chip to inference optimization​For the last decade, the GPU has been the universal hammer for every AI nail. You use H100s to train the model; you use H100s (or trimmed-down versions) to run the model. But as models shift toward \"System 2\" thinking — where the AI reasons, self-corrects and iterates before answering — the computational workload changes.​Training requires massive parallel brute force. Inference, especially for reasoning models, requires faster sequential processing. It must generate tokens instantly to facilitate complex chains of thought without the user waiting minutes for an answer. ​Groq’s LPU (Language Processing Unit) architecture removes the memory bandwidth bottleneck that plagues GPUs during small-batch inference, delivering lightning-fast inference.​The engine for the next wave of growth​For the C-Suite, this potential convergence solves the \"thinking time\" latency crisis. Consider the expectations from AI agents: We want them to autonomously book flights, code entire apps and research legal precedent. To do this reliably, a model might need to generate 10,000 internal \"thought tokens\" to verify its own work before it outputs a single word to the user.​On a standard GPU: 10,000 thought tokens might take 20 to 40 seconds. The user gets bored and leaves.​On Groq: That same chain of thought happens in less than 2 seconds.​If Nvidia integrates Groq’s technology, they solve the \"waiting for the robot to think\" problem. They preserve the magic of AI. Just as they moved from rendering pixels (gaming) to rendering intelligence (gen AI), they would now move to rendering reasoning in real-time.​Furthermore, this creates a formidable software moat. Groq’s biggest hurdle has always been the software stack; Nvidia’s biggest asset is CUDA. If Nvidia wraps its ecosystem around Groq’s hardware, they effectively dig a moat so wide that competitors cannot cross it. They would offer the universal platform: The best environment to train and the most efficient environment to run (Groq/LPU).Consider what happens when you couple that raw inference power with a next-generation open source model (like the rumored DeepSeek 4): You get an offering that would rival today’s frontier models in cost, performance and speed. That opens up opportunities for Nvidia, from directly entering the inference business with its own cloud offering, to continuing to power a growing number of exponentially growing customers.​The next step on the pyramid​Returning to our opening metaphor: The \"exponential\" growth of AI is not a smooth line of raw FLOPs; it is a staircase of bottlenecks being smashed.​Block 1: We couldn&#x27;t calculate fast enough. Solution: The GPU.​Block 2: We couldn&#x27;t train deep enough. Solution: Transformer architecture.​Block 3: We can&#x27;t \"think\" fast enough. Solution: Groq’s LPU.​Jensen Huang has never been afraid to cannibalize his own product lines to own the future. By validating Groq, Nvidia wouldn&#x27;t just be buying a faster chip; they would be bringing next-generation intelligence to the masses.Andrew Filev, founder and CEO of Zencoder",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/08ilFZNVYo9OJqR9Z17ci/9196ada486dd8eb15769c1f096076b10/Limestone.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html",
          "published_at": "Sun, 15 Feb 2026 15:06:28 +0000",
          "title": "Apple's iPhone Air MagSafe battery is cheaper than ever right now",
          "standfirst": "We found the iPhone Air to have a pretty decent battery life for such a thin-and-light phone, somewhere in the region of 27 hours if you’re continuously streaming video. But it's still a phone, arguably your most used device on a daily basis, so you may need to top it up during the day if you're using it constantly. That’s where Apple’s iPhone Air MagSafe battery pack comes in, and it’s currently on sale for $79. This accessory only works with the iPhone Air, but much like the phone it attaches to, it’s extremely slim at 7.5mmm, so crucially doesn’t add so much bulk when attached that it defeats the point of having a thin phone in the first place. The MagSafe Battery isn’t enormous at 3,149mAh (enough to add an extra 65 percent of charge to the Air), but it can wirelessly charge the AirPods Pro 3 as well, making it an even more useful travel companion. You can also charge your iPhone while charging the battery pack. At its regular price of $99, the MagSafe battery pack is an admittedly pricey add-on to what is already an expensive phone, but for $20 off it’s well worth considering what Engadget’s Sam Rutherford called an \"essential accessory\" for some users in his iPhone Air review. Many Apple loyalists will always insist on having first-party accessories for their iPhone, but there are plenty of third-party MagSafe chargers out there too, a lot of them considerably cheaper than Apple’s lineup. Be sure to check out our guide for those. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html?src=rss",
          "content": "We found the iPhone Air to have a pretty decent battery life for such a thin-and-light phone, somewhere in the region of 27 hours if you’re continuously streaming video. But it's still a phone, arguably your most used device on a daily basis, so you may need to top it up during the day if you're using it constantly. That’s where Apple’s iPhone Air MagSafe battery pack comes in, and it’s currently on sale for $79. This accessory only works with the iPhone Air, but much like the phone it attaches to, it’s extremely slim at 7.5mmm, so crucially doesn’t add so much bulk when attached that it defeats the point of having a thin phone in the first place. The MagSafe Battery isn’t enormous at 3,149mAh (enough to add an extra 65 percent of charge to the Air), but it can wirelessly charge the AirPods Pro 3 as well, making it an even more useful travel companion. You can also charge your iPhone while charging the battery pack. At its regular price of $99, the MagSafe battery pack is an admittedly pricey add-on to what is already an expensive phone, but for $20 off it’s well worth considering what Engadget’s Sam Rutherford called an \"essential accessory\" for some users in his iPhone Air review. Many Apple loyalists will always insist on having first-party accessories for their iPhone, but there are plenty of third-party MagSafe chargers out there too, a lot of them considerably cheaper than Apple’s lineup. Be sure to check out our guide for those. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html?src=rss",
          "feed_position": 22
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html",
          "published_at": "Sun, 15 Feb 2026 14:35:38 +0000",
          "title": "Get a four-pack of first-gen AirTags on sale for only $64",
          "standfirst": "Good deals on Apple products aren’t as frequent as we’d like them to be, but if there’s one of the company’s products that does seem to enjoy pretty regular price cuts, it’s the AirTag. Right now you can pick up a four-pack of Apple’s diminutive first-generation Bluetooth trackers for $64, which translates to 35 percent off and a near record low price. Bear in mind that this deal brings the price per AirTag down to about $16 if you were to buy them individually, and when not on sale they usually cost $29. If you use Apple devices and consider yourself to be a serial thing-misplacer, AirTags are extremely useful. Adding one to your account takes a single tap, and with Apple’s Find My network so well established, locating missing items has never been easier. Using your iPhone you can trigger a sound from the AirTag’s built-in speaker, or alternatively Precision Finding can be used to pinpoint its location via Find My. You just follow the instructions on your iPhone, paying attention to the vibrations that signal you’re getting closer. A reminder again that the above deals apply to the first-generation AirTag only. Apple introduced a refreshed tracker with greater range and a louder speaker last month, which retails at the same price as its predecessor. For deals on the new AirTag, you may have to wait a bit. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html?src=rss",
          "content": "Good deals on Apple products aren’t as frequent as we’d like them to be, but if there’s one of the company’s products that does seem to enjoy pretty regular price cuts, it’s the AirTag. Right now you can pick up a four-pack of Apple’s diminutive first-generation Bluetooth trackers for $64, which translates to 35 percent off and a near record low price. Bear in mind that this deal brings the price per AirTag down to about $16 if you were to buy them individually, and when not on sale they usually cost $29. If you use Apple devices and consider yourself to be a serial thing-misplacer, AirTags are extremely useful. Adding one to your account takes a single tap, and with Apple’s Find My network so well established, locating missing items has never been easier. Using your iPhone you can trigger a sound from the AirTag’s built-in speaker, or alternatively Precision Finding can be used to pinpoint its location via Find My. You just follow the instructions on your iPhone, paying attention to the vibrations that signal you’re getting closer. A reminder again that the above deals apply to the first-generation AirTag only. Apple introduced a refreshed tracker with greater range and a louder speaker last month, which retails at the same price as its predecessor. For deals on the new AirTag, you may have to wait a bit. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html?src=rss",
          "feed_position": 23
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html",
          "published_at": "Sun, 15 Feb 2026 13:41:26 +0000",
          "title": "Get the 512GB Samsung P9 microSD Express card for 33 percent off right now",
          "standfirst": "MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, os if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now — you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen. The P9 boasts transfer speeds of up to 800MB/s, making moving games to the card that much faster. As for load times, in our testing we found that any microSD Express, the standard the Switch 2 requires, will offer roughly the same performance. This format is pretty new, so there aren't a ton of cards on the market. As such, the P9 makes our list of best microSD cards for the Nintendo Switch 2. The P9 microSD Express is also compatible with the Steam Deck or any other gaming console that accepts the format, as well as cameras and more. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html?src=rss",
          "content": "MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, os if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now — you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen. The P9 boasts transfer speeds of up to 800MB/s, making moving games to the card that much faster. As for load times, in our testing we found that any microSD Express, the standard the Switch 2 requires, will offer roughly the same performance. This format is pretty new, so there aren't a ton of cards on the market. As such, the P9 makes our list of best microSD cards for the Nintendo Switch 2. The P9 microSD Express is also compatible with the Steam Deck or any other gaming console that accepts the format, as well as cameras and more. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html?src=rss",
          "feed_position": 24
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html",
          "published_at": "Sun, 15 Feb 2026 13:05:36 +0000",
          "title": "Anker's 45W Nano charger with smart display is $10 off",
          "standfirst": "Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now. That's $10 off the regular price. The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features \"fun animations to keep things cheerful.\" Anker says it can recognize what's being charged and automatically adjust certain metrics to ensure a longer battery lifespan. To that end, it works with just about everything. The company advertises that this charger is a good fit for the iPhone, Apple Watch, AirPods and Samsung devices, among others. The new Nano Charger is on the smaller side, with dual folding prongs that rotate to fit most outlets. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html?src=rss",
          "content": "Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now. That's $10 off the regular price. The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features \"fun animations to keep things cheerful.\" Anker says it can recognize what's being charged and automatically adjust certain metrics to ensure a longer battery lifespan. To that end, it works with just about everything. The company advertises that this charger is a good fit for the iPhone, Apple Watch, AirPods and Samsung devices, among others. The new Nano Charger is on the smaller side, with dual folding prongs that rotate to fit most outlets. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html?src=rss",
          "feed_position": 25
        }
      ],
      "featured_image": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/a476c2e0-9780-11f0-bd4b-d87caa240702",
      "popularity_score": 2008.2708297222223
    },
    {
      "id": "cluster_61",
      "coverage": 2,
      "updated_at": "2026-02-16T06:29:24-05:00",
      "title": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
      "neutral_headline": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
      "bullet_summary": [
        "Reported by The Verge, Guardian Tech"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/ai-artificial-intelligence/879644/bytedance-seedance-safeguards-ai-video-copyright-infringement",
          "published_at": "2026-02-16T06:29:24-05:00",
          "title": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
          "standfirst": "TikTok creator ByteDance says that it is working to improve safeguards on its new AI video generator after Disney, Paramount, and Hollywood trade groups accused the tool of violating copyright protections. Concerns were raised after hyperrealistic videos generated by the Seedance 2.0 model went viral last week, with the likeness of actors, such as Tom [&#8230;]",
          "content": "Hollywood groups have spoken out against Seedance 2.0 since generated videos like fight scenes between Tom Cruise and Brad Pitt went viral. | Image by Dave Benett / WireImage via Getty TikTok creator ByteDance says that it is working to improve safeguards on its new AI video generator after Disney, Paramount, and Hollywood trade groups accused the tool of violating copyright protections. Concerns were raised after hyperrealistic videos generated by the Seedance 2.0 model went viral last week, with the likeness of actors, such as Tom Cruise and Brad Pitt, and characters from Dragon Ball Z, Family Guy, and Pok&eacute;mon. \"ByteDance respects intellectual property rights and we have heard the concerns regarding Seedance 2.0,\" a ByteDance spokesperson said in a statement shared by CNBC. \"We are taking steps to strengthen current saf … Read the full story at The Verge.",
          "feed_position": 8
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2026/feb/16/tiktok-bytedance-ai-video-tool-disney-seedance-tom-cruise-brad-pitt",
          "published_at": "Mon, 16 Feb 2026 08:25:10 GMT",
          "title": "TikTok creator ByteDance vows to curb AI video tool after Disney threat",
          "standfirst": "Videos created by new Seedance 2.0 generator go viral, including one of Tom Cruise and Brad Pitt fightingBusiness live – latest updatesByteDance, the Chinese technology company behind TikTok, has said it will restrain its AI video-making tool, after threats of legal action from Disney and a backlash from other media businesses, according to reports.The AI video generator Seedance 2.0, released last week, has spooked Hollywood as users create realistic clips of movie stars and superheroes with just a short text prompt. Continue reading...",
          "content": "Videos created by new Seedance 2.0 generator go viral, including one of Tom Cruise and Brad Pitt fightingBusiness live – latest updatesByteDance, the Chinese technology company behind TikTok, has said it will restrain its AI video-making tool, after threats of legal action from Disney and a backlash from other media businesses, according to reports.The AI video generator Seedance 2.0, released last week, has spooked Hollywood as users create realistic clips of movie stars and superheroes with just a short text prompt. Continue reading...",
          "feed_position": 2
        }
      ],
      "popularity_score": 2000
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 20:30:15 +0000",
      "title": "Get ready for new Macs and iPads: Apple announces \"Special Experience\" on March 4",
      "neutral_headline": "Get ready for new Macs and iPads: Apple announces \"Special Experience\" on March 4",
      "bullet_summary": [
        "Apple has not confirmed whether you'll be able to watch live, but Ars will bring you the news",
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/apple/2026/02/get-ready-for-new-macs-and-ipads-apple-announces-special-experience-on-march-4/",
          "published_at": "Mon, 16 Feb 2026 20:30:15 +0000",
          "title": "Get ready for new Macs and iPads: Apple announces \"Special Experience\" on March 4",
          "standfirst": "Apple has not confirmed whether you'll be able to watch live, but Ars will bring you the news.",
          "content": "It may be more tempting to take that aging Mac you've been coddling and put it out to pasture soon. Apple has announced an event for March 4, which in usual Apple fashion, it has branded a \"Special Apple Experience.\" Also in usual Apple fashion, it has not come out and said what it's going to be announcing. We have a pretty good idea, though. The event will kick off at 9AM ET on March 4—Ars will be on the ground in New York City to cover Apple's latest unveiling, whatever form it may take. Apple doesn't release most products on a set schedule, but some recent speculation about likely hardware updates can point us in the right direction. As we reported recently, the iPhone 17e may be making an appearance in Apple's lineup soon. This updated version of the budget-oriented iPhone will have an A19 chip inside, similar to the one powering the base model iPhone 17. It may also add MagSafe charging. Don't expect to see a multi-camera array like you'd get on the more expensive Apple phones, though. Pricing will be the most important thing to watch for should Apple announce this phone. Right now, the non-Pro iPhone 16 and 17 (including the 16e) are all clustered in the $600-800 range. Another $599 budget iPhone won't make waves.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Apple-March-4-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Apple-March-4-1152x648.jpg",
      "popularity_score": 353.7511075
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 17:42:37 +0000",
      "title": "ByteDance backpedals after Seedance 2.0 turned Hollywood icons into AI “clip art”",
      "neutral_headline": "ByteDance backpedals after Seedance 2.0 turned Hollywood icons into AI “clip art”",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/bytedance-backpedals-after-seedance-2-0-turned-hollywood-icons-into-ai-clip-art/",
          "published_at": "Mon, 16 Feb 2026 17:42:37 +0000",
          "title": "ByteDance backpedals after Seedance 2.0 turned Hollywood icons into AI “clip art”",
          "standfirst": "Hollywood backlash puts spotlight on ByteDance's sketchy launch of Seedance 2.0.",
          "content": "ByteDance says that it's rushing to add safeguards to block Seedance 2.0 from generating iconic characters and deepfaking celebrities, after substantial Hollywood backlash after launching the latest version of its AI video tool. The changes come after Disney and Paramount Skydance sent cease-and-desist letters to ByteDance urging the Chinese company to promptly end the allegedly vast and blatant infringement. Studios claimed the infringement was widescale and immediate, with Seedance 2.0 users across social media sharing AI videos featuring copyrighted characters like Spider-Man, Darth Vader, and SpongeBob Square Pants. In its letter, Disney fumed that Seedance was \"hijacking\" its characters, accusing ByteDance of treating Disney characters like they were \"free public domain clip art,\" Axios reported.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260459499-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260459499-1024x648.jpg",
      "popularity_score": 333.9572186111111
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 20:10:54 +0000",
      "title": "Best Buy worker used manager’s code to get 99% off MacBooks, cops say",
      "neutral_headline": "Best Buy worker used manager’s code to get 99% off MacBooks, cops say",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/best-buy-worker-used-managers-code-to-get-99-off-macbooks-cops-say/",
          "published_at": "Mon, 16 Feb 2026 20:10:54 +0000",
          "title": "Best Buy worker used manager’s code to get 99% off MacBooks, cops say",
          "standfirst": "Employee allegedly exploited Best Buy's discount system for months.",
          "content": "A Best Buy employee in Florida was charged with fraud after allegedly using his manager's code to heavily discount nearly 150 items that he and his accomplices purchased and pawned. It seems that the manager first started growing suspicious about \"strange sales numbers\" in December 2024, an ABC News affiliate in West Palm Beach reported. Private investigators traced the weird sales back to a 36-year-old employee, Matthew Lettera, who allegedly conducted 97 discounted purchases for himself and 52 additional transactions for others. Some MacBooks were discounted as much as 99 percent, a local CW affiliate reported. In total, Best Buy lost more than $118,000 from the scheme. According to a LinkedIn profile that matches Lettera's information, he started working at Best Buy in January 2020 after pivoting from career training as a chef.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2242091075-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2242091075-1024x648.jpg",
      "popularity_score": 331.4286075
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 17:30:38 +0000",
      "title": "A fluid can store solar energy and then release it as heat months later",
      "neutral_headline": "A fluid can store solar energy and then release it as heat months later",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/dna-inspired-molecule-breaks-records-for-storing-solar-heat/",
          "published_at": "Mon, 16 Feb 2026 17:30:38 +0000",
          "title": "A fluid can store solar energy and then release it as heat months later",
          "standfirst": "Sunlight can cause a molecule to change structure, and then release heat later.",
          "content": "Heating accounts for nearly half of the global energy demand, and two-thirds of that is met by burning fossil fuels like natural gas, oil, and coal. Solar energy is a possible alternative, but while we have become reasonably good at storing solar electricity in lithium-ion batteries, we’re not nearly as good at storing heat. To store heat for days, weeks, or months, you need to trap the energy in the bonds of a molecule that can later release heat on demand. The approach to this particular chemistry problem is called molecular solar thermal (MOST) energy storage. While it has been the next big thing for decades, it never really took off. In a recent Science paper, a team of researchers from the University of California, Santa Barbara, and UCLA demonstrate a breakthrough that might finally make MOST energy storage effective.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1314152372-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1314152372-1152x648.jpg",
      "popularity_score": 308.7574963888889
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 14:47:38 +0000",
      "title": "Michigan antitrust lawsuit says oil companies hobbled EVs and renewables",
      "neutral_headline": "Michigan antitrust lawsuit says oil companies hobbled EVs and renewables",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/michigan-accuses-oil-companies-of-antitrust-violations-in-climate-change-lawsuit/",
          "published_at": "Mon, 16 Feb 2026 14:47:38 +0000",
          "title": "Michigan antitrust lawsuit says oil companies hobbled EVs and renewables",
          "standfirst": "The energy industry is pressing for laws that would ban climate liability lawsuits.",
          "content": "Michigan is taking on major oil and gas companies in court, joining nearly a dozen other states that have brought climate-related lawsuits against ExxonMobil and its industry peers. But Michigan’s approach is different: accusing Big Oil not of deceiving consumers or misrepresenting climate change risks, but of driving up energy costs by colluding to suppress competition from cleaner and cheaper technologies like solar power and electric vehicles. The strategy is risky and might run into challenges, but it could potentially be a game changer if the state can overcome initial dismissal attempts by the industry defendants, legal experts say. Michigan Attorney General Dana Nessel filed the lawsuit last month in federal District Court against BP, Chevron, ExxonMobil, Shell and the American Petroleum Institute. The suit, brought under federal and state antitrust laws, alleges a conspiracy to delay the transition to renewable energy and EVs and maintain market dominance of fossil fuels.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/04/GettyImages-1466169248-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/04/GettyImages-1466169248-1152x648.jpg",
      "popularity_score": 302.0408297222222
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Mon, 16 Feb 2026 12:00:53 +0000",
      "title": "Sideways on the ice, in a supercar: Stability control is getting very good",
      "neutral_headline": "Sideways on the ice, in a supercar: Stability control is getting very good",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2026/02/learning-the-limits-of-stability-control-on-a-frozen-lake-in-a-mclaren/",
          "published_at": "Mon, 16 Feb 2026 12:00:53 +0000",
          "title": "Sideways on the ice, in a supercar: Stability control is getting very good",
          "standfirst": "To test stability control, it helps to have a wide-open space with very low grip.",
          "content": "McLaren provided flights from Washington, DC, to Ivalo, Finland, and accommodation so Ars could drive its car on a frozen lake. Ars does not accept paid editorial content. SAARISELKÄ, FINLAND—If you're expecting it, the feeling in the pit of your stomach when the rear of your car breaks traction and begins to slide is rather pleasant. It's the same exhilaration we get from roller coasters, but when you're in the driver's seat, you're in charge of the ride. When you're not expecting it, though, there's anxiety instead of excitement and, should the slide end with a crunch, a lot more negative emotions, too. Thankfully, fewer and fewer drivers will have to experience that kind of scare thanks to the proliferation and sophistication of modern electronic stability and traction control systems. For more than 30 years, these electronic safety nets have grown in capability and became mandatory in the early 2010s, saving countless crashes in the process.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/2026-McLaren-Arctic-driving-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/2026-McLaren-Arctic-driving-1-1152x648.jpg",
      "popularity_score": 283.2616630555556
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 21:11:54 +0000",
      "title": "Space Station returns to a full crew complement after a month",
      "neutral_headline": "Space Station returns to a full crew complement after a month",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/space-station-returns-to-a-full-crew-complement-after-a-month/",
          "published_at": "Sun, 15 Feb 2026 21:11:54 +0000",
          "title": "Space Station returns to a full crew complement after a month",
          "standfirst": "\"It's only possible because of the incredibly talented workforce we have.\"",
          "content": "A Crew Dragon spacecraft docked with the International Space Station on Valentine's Day, and astronauts popped open the hatches at 5:14 pm ET (22:14 UTC) on Saturday evening. The arrival of four new astronauts as part of the Crew 12 mission—Jessica Meir and Jack Hathaway of NASA, Sophie Adenot of the European Space Agency, and Andrey Fedyaev of Roscosmos—brought the total number of crew on board the space station to seven, giving the US space agency a full complement in orbit. The number of astronauts living on board the station fluctuates over time, depending on crew rotations and private astronauts making shorter stays, but since Crew Dragon began flying regularly at the end of 2020 NASA has sought to keep at least four \"USOS\" astronauts on board at all time. This stands for \"US Orbital Segment,\" and means astronauts from the United States, Canada, Europe, and Japan who are trained to operate the areas of the station maintained by NASA and its partner astronauts.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/crew-12-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/crew-12-1152x648.jpg",
      "popularity_score": 281
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 20:14:16 +0000",
      "title": "Ancient Mars was warm and wet, not cold and icy",
      "neutral_headline": "Ancient Mars was warm and wet, not cold and icy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/ancient-mars-was-warm-and-wet-not-cold-and-icy/",
          "published_at": "Sun, 15 Feb 2026 20:14:16 +0000",
          "title": "Ancient Mars was warm and wet, not cold and icy",
          "standfirst": "Kaolinite pebbles show evidence of alteration under high rainfall conditions.",
          "content": "A recent study showed that Mars was warm and wet billions of years ago. The finding contrasts with another theory that this era was mainly cold and icy. The result has implications for the idea that life could have developed on the planet at this time. Whether Mars was once habitable is a fascinating and intensely researched topic of interest over many decades. Mars, like the Earth, is about 4.5 billion years old and its geological history is divided into different epochs of time. The latest paper relates to Mars during a time called the Noachian epoch, which extended from about 4.1 to 3.7 billion years ago. This was during a stage in solar system history called the Late Heavy Bombardment (LHB). Evidence for truly cataclysmic meteorite impacts during the LHB are found on many bodies throughout the solar system.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/marssurface-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/marssurface-1152x648.jpg",
      "popularity_score": 268
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 18:09:09 +0000",
      "title": "Editor’s Note: Retraction of article containing fabricated quotations",
      "neutral_headline": "Editor’s Note: Retraction of article containing fabricated quotations",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/",
          "published_at": "Sun, 15 Feb 2026 18:09:09 +0000",
          "title": "Editor’s Note: Retraction of article containing fabricated quotations",
          "standfirst": "We are reinforcing our editorial standards following this incident.",
          "content": "On Friday afternoon, Ars Technica published an article containing fabricated quotations generated by an AI tool and attributed to a source who did not say them. That is a serious failure of our standards. Direct quotations must always reflect what a source actually said. That this happened at Ars is especially distressing. We have covered the risks of overreliance on AI tools for years, and our written policy reflects those concerns. In this case, fabricated quotations were published in a manner inconsistent with that policy. We have reviewed recent work and have not identified additional issues. At this time, this appears to be an isolated incident. Ars Technica does not permit the publication of AI-generated material unless it is clearly labeled and presented for demonstration purposes. That rule is not optional, and it was not followed here.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/ars-logo-dark-background-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/ars-logo-dark-background-1152x648.jpg",
      "popularity_score": 268
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 17:20:12 +0000",
      "title": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
      "neutral_headline": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/it-aint-no-unicorn-these-researchers-have-interviewed-130-bigfoot-hunters/",
          "published_at": "Sun, 15 Feb 2026 17:20:12 +0000",
          "title": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
          "standfirst": "What prompts this community to spend time looking for a creature that likely doesn't exist?",
          "content": "It was the image that launched a cultural icon. In 1967, in the Northern California woods, a 7-foot-tall, ape-like creature covered in black fur and walking upright was captured on camera, at one point turning around to look straight down the lens. The image is endlessly copied in popular culture—it’s even become an emoji. But what was it? A hoax? A bear? Or a real-life example of a mysterious species called the Bigfoot? The film has been analysed and re-analysed countless times. Although most people believe it was some sort of hoax, there are some who argue that it’s never been definitively debunked. One group of people, dubbed Bigfooters, is so intrigued that they have taken to the forests of Washington, California, Oregon, Ohio, Florida, and beyond to look for evidence of the mythical creature. But why? That’s what sociologists Jamie Lewis and Andrew Bartlett wanted to uncover. They were itching to understand what prompts this community to spend valuable time and resources looking for a beast that is highly unlikely to even exist. During lockdown, Lewis started interviewing more than 130 Bigfooters (and a few academics) about their views, experiences, and practices, culminating in the duo’s recent book \"Bigfooters and Scientific Inquiry: On the Borderlands of Legitimate Science.\"Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/bigfoot-1.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/bigfoot-1.jpg",
      "popularity_score": 258
    }
  ]
}