{
  "updated_at": "2025-12-09T11:13:52.876Z",
  "clusters": [
    {
      "id": "cluster_8",
      "coverage": 3,
      "updated_at": "2025-12-09T05:12:39-05:00",
      "title": "Google Zero is under investigation by the EU",
      "neutral_headline": "Google Zero is under investigation by the EU",
      "bullet_summary": [
        "The European Commission said on Tuesday it will examine whether the US tech company, which runs the Gemini AI model and is owned by Alphabet, is putting rival AI owners at a “disadvantage”",
        "Reported by The Verge, Guardian Tech, TechMeme"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/840547/google-zero-eu-antitrust-investigation-ai-content",
          "published_at": "2025-12-09T05:12:39-05:00",
          "title": "Google Zero is under investigation by the EU",
          "standfirst": "Google is under investigation by the European Union over concerns that it breached competition rules by imposing restrictions on web publishers and YouTube creators to gain an unfair advantage over other AI companies. Concerns outlined by the European Commission include using content from web publishers for features like AI Overviews and AI Mode in Search, [&#8230;]",
          "content": "Google is under investigation by the European Union over concerns that it breached competition rules by imposing restrictions on web publishers and YouTube creators to gain an unfair advantage over other AI companies. Concerns outlined by the European Commission include using content from web publishers for features like AI Overviews and AI Mode in Search, and feeding YouTube content into Google's generative AI models - all while failing to provide \"appropriate compensation\" or the ability to refuse such use of their content. These concerns are tied to the existential threat of \"Google Zero\" - the moment in which Google Search no longer re … Read the full story at The Verge.",
          "feed_position": 0
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2025/dec/09/eu-investigation-google-ai-models-gemini",
          "published_at": "Tue, 09 Dec 2025 10:06:17 GMT",
          "title": "EU opens investigation into Google’s use of online content for AI models",
          "standfirst": "European Commission to assess whether Gemini owner is putting rival companies at a disadvantageBusiness live – latest updatesThe EU has opened an investigation to assess whether Google is breaching European competition rules in its use of online content from publishers and YouTube creators for artificial intelligence.The European Commission said on Tuesday it will examine whether the US tech company, which runs the Gemini AI model and is owned by Alphabet, is putting rival AI owners at a “disadvantage”. Continue reading...",
          "content": "European Commission to assess whether Gemini owner is putting rival companies at a disadvantageBusiness live – latest updatesThe EU has opened an investigation to assess whether Google is breaching European competition rules in its use of online content from publishers and YouTube creators for artificial intelligence.The European Commission said on Tuesday it will examine whether the US tech company, which runs the Gemini AI model and is owned by Alphabet, is putting rival AI owners at a “disadvantage”. Continue reading...",
          "feed_position": 0
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251209/p7#a251209p7",
          "published_at": "Tue, 09 Dec 2025 04:25:01 -0500",
          "title": "The European Commission opens an investigation into Google to assess possible anticompetitive conduct by Google in \"the use of online content for AI purposes\" (Barbara Moens/Financial Times)",
          "standfirst": "Barbara Moens / Financial Times: The European Commission opens an investigation into Google to assess possible anticompetitive conduct by Google in &ldquo;the use of online content for AI purposes&rdquo; &mdash; Investigation is the bloc's latest challenge to American Big Tech companies &mdash; Brussels has launched an investigation &hellip;",
          "content": "Barbara Moens / Financial Times: The European Commission opens an investigation into Google to assess possible anticompetitive conduct by Google in &ldquo;the use of online content for AI purposes&rdquo; &mdash; Investigation is the bloc's latest challenge to American Big Tech companies &mdash; Brussels has launched an investigation &hellip;",
          "feed_position": 4,
          "image_url": "http://www.techmeme.com/251209/i7.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/251209/i7.jpg",
      "popularity_score": 3018.979478888889
    },
    {
      "id": "cluster_64",
      "coverage": 2,
      "updated_at": "Mon, 08 Dec 2025 18:10:00 GMT",
      "title": "ChatGPT saves the average worker nearly an hour each day, says OpenAI - here's how",
      "neutral_headline": "OpenAI boasts enterprise win days after internal ‘code red’ on Google threat",
      "bullet_summary": [
        "Reported by ZDNet, TechCrunch"
      ],
      "items": [
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/chatgpt-saving-time-work/",
          "published_at": "Mon, 08 Dec 2025 18:10:00 GMT",
          "title": "ChatGPT saves the average worker nearly an hour each day, says OpenAI - here's how",
          "standfirst": "The company is stepping up its efforts to attract enterprise customers amid growing competition from Google and Anthropic.",
          "content": "The company is stepping up its efforts to attract enterprise customers amid growing competition from Google and Anthropic.",
          "feed_position": 14
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/08/openai-boasts-enterprise-win-days-after-internal-code-red-on-google-threat/",
          "published_at": "Mon, 08 Dec 2025 12:00:00 +0000",
          "title": "OpenAI boasts enterprise win days after internal ‘code red’ on Google threat",
          "standfirst": "ChatGPT Enterprise usage grew 8x year-over-year as workers report saving an hour daily, but OpenAI faces competitive pressure from Anthropic and questions about cost sustainability.",
          "content": "ChatGPT Enterprise usage grew 8x year-over-year as workers report saving an hour daily, but OpenAI faces competitive pressure from Anthropic and questions about cost sustainability.",
          "feed_position": 19
        }
      ],
      "popularity_score": 2002.9353122222221
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 21:54:58 +0000",
      "title": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
      "neutral_headline": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/iceblock-lawsuit-trump-admin-bragged-about-demanding-app-store-removal/",
          "published_at": "Mon, 08 Dec 2025 21:54:58 +0000",
          "title": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
          "standfirst": "ICEBlock creator sues to protect apps that are crowd-sourcing ICE sightings.",
          "content": "In a lawsuit filed against top Trump administration officials on Monday, Apple was accused of caving to unconstitutional government demands by removing an Immigration and Customs Enforcement-spotting app from the App Store with more than a million users. In his complaint, Joshua Aaron, creator of ICEBlock, cited a Fox News interview in which Attorney General Pam Bondi “made plain that the United States government used its regulatory power to coerce a private platform to suppress First Amendment-protected expression.” Suing Bondi—along with Department of Homeland Security Secretary Kristi Noem, Acting Director of ICE Todd Lyons, White House “Border Czar” Thomas D. Homan, and unnamed others—Aaron further alleged that US officials made false statements and “unlawful threats” to criminally investigate and prosecute him for developing ICEBlock.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235825531-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235825531-1024x648.jpg",
      "popularity_score": 339.68475666666666
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 18:36:16 +0000",
      "title": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
      "neutral_headline": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/paramount-says-it-could-get-antitrust-approval-for-wbd-before-netflix/",
          "published_at": "Mon, 08 Dec 2025 18:36:16 +0000",
          "title": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
          "standfirst": "Paramount has already proven it can get a controversial merger done.",
          "content": "Netflix won the bidding war for Warner Bros. Discovery’s (WBD’s) streaming and movie studio businesses last week. But Paramount Skydance isn’t relenting on its dreams of owning WBD and is pushing forward with a hostile takeover bid. On Friday, Netflix announced that it had agreed to pay an equity value of $72 billion, or an approximate total enterprise value of $82.7 billion, for WBD’s streaming and film businesses, as well as its film and TV libraries. The deal includes HBO and the HBO Max streaming service but not WBD’s cable channels, which are to be split off ahead of the acquisition into a separate company called Discovery Global. Netflix said WBD’s split should conclude in Q3 2026. Paramount has different plans, though.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250240969-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250240969-1024x648.jpg",
      "popularity_score": 326.37309
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 17:01:37 +0000",
      "title": "F1 in Abu Dhabi: And that’s the championship",
      "neutral_headline": "F1 in Abu Dhabi: And that’s the championship",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/f1-in-abu-dhabi-and-thats-the-championship/",
          "published_at": "Mon, 08 Dec 2025 17:01:37 +0000",
          "title": "F1 in Abu Dhabi: And that’s the championship",
          "standfirst": "A three-way fight down to the wire as the ground effect era comes to a close.",
          "content": "The 2025 Formula 1 World Championship drew to a close this past weekend in Abu Dhabi, and with it came the end of the current generation of cars. After a grueling 24 races, the title was decided in a three-way fight by the finest of margins; just two points, less than half a percent, separated the winning driver from second place when the checkered flag waved on Sunday. Coming into Abu Dhabi, McLaren’s Lando Norris was, if not a comfortable favorite, then at least the driver with the highest odds of prevailing. After a strong start to the season, the British driver’s form dipped at the Dutch Grand Prix. But he bounced back, retaking the championship lead from his Australian teammate Oscar Piastri in Mexico in October. For much of the season, it seemed to be a two-car race. McLaren had a clear car advantage and two strong drivers, suggesting a repeat of the years we saw Lewis Hamilton and Nico Rosberg duking it out to bring home titles for Mercedes. But that didn’t figure on Red Bull developing its car late in the season. New boss Laurent Mekies has revitalized the energy drinks squad, and four-time champion Max Verstappen was able to close inexorably toward the McLaren drivers in the points with a string of sublime performances.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250341495-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250341495-1152x648.jpg",
      "popularity_score": 311.79559
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 15:49:32 +0000",
      "title": "A big bike on a budget: Lectric’s XPress 750",
      "neutral_headline": "A big bike on a budget: Lectric’s XPress 750",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/lectric-xpress-750-a-full-sized-bike-for-the-budget-minded/",
          "published_at": "Mon, 08 Dec 2025 15:49:32 +0000",
          "title": "A big bike on a budget: Lectric’s XPress 750",
          "standfirst": "A budget e-bike that offers more than you might expect.",
          "content": "Almost every bit of bike testing I’ve done starts out the same way. After assembling the bike, I set the seatpost to its maximum recommended height, take it on a short test ride, and try to figure out new and creative phrasing to describe the same old problem: The frame isn’t quite big enough to accommodate my legs. While I’m on the tall side at a bit over 6 feet (~190 cm), I’m definitely not abnormally large. Yet very few e-bike manufacturers seem to be interested in giving people my height a comfortable ride. So imagine my surprise when, within two blocks of my first ride on the XPress 750, I had to pull off to the side of the street and lower the seat. This was especially notable given that the XPress is a budget bike (currently on sale for just under $1,000.00) that is only offered in a single frame size. So kudos to Lectric for giving me a comfortable and enjoyable ride, and doing so with a lot of features I wouldn’t expect at this price point. That said, hitting that price necessitated some significant compromises. We’ll discuss those in detail so you can get a sense of whether any of them will get in the way of your riding enjoyment.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_1802-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_1802-1152x648.jpeg",
      "popularity_score": 300.5942011111111
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 14:57:11 +0000",
      "title": "Meta offers EU users ad-light option in push to end investigation",
      "neutral_headline": "Meta offers EU users ad-light option in push to end investigation",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/meta-offers-eu-users-ad-light-option-in-push-to-end-investigation/",
          "published_at": "Mon, 08 Dec 2025 14:57:11 +0000",
          "title": "Meta offers EU users ad-light option in push to end investigation",
          "standfirst": "Facebook agrees to change \"pay or consent\" model after talks with European Commission.",
          "content": "Meta has agreed to make changes to its “pay or consent” business model in the EU, seeking to agree to a deal that avoids further regulatory fines at a time when the bloc’s digital rule book is drawing anger from US authorities. On Tuesday, the European Commission announced that the social media giant had offered users an alternative choice of Facebook and Instagram services that would show them fewer personalized advertisements. The offer follows an EU investigation into Meta’s policy of requiring users either to consent to data tracking or pay for an ad-free service. The Financial Times reported on optimism that an agreement could be reached between the parties in October.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1359152239-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1359152239-1152x648.jpg",
      "popularity_score": 293
    },
    {
      "id": "cluster_96",
      "coverage": 1,
      "updated_at": "Sun, 07 Dec 2025 12:08:58 +0000",
      "title": "Why is my dog like this? Current DNA tests won’t explain it to you.",
      "neutral_headline": "Why is my dog like this? Current DNA tests won’t explain it to you.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/why-is-my-dog-like-this-current-dna-tests-wont-explain-it-to-you/",
          "published_at": "Sun, 07 Dec 2025 12:08:58 +0000",
          "title": "Why is my dog like this? Current DNA tests won’t explain it to you.",
          "standfirst": "Dog behavior is a lot more complicated than any one gene variant.",
          "content": "Popular genetics tests can’t tell you much about your dog’s personality, according to a recent study. A team of geneticists recently found no connection between simple genetic variants and behavioral traits in more than 3,200 dogs, even though previous studies suggested that hundreds of genes might predict aspects of a dog’s behavior and personality. That’s despite the popularity of at-home genetic tests that claim they can tell you whether your dog’s genes contain the recipe for anxiety or a fondness for cuddles. This is Max, and no single genetic variant can explain why he is the way he is. Credit: Kiona Smith Gattaca for dogs, except it doesn’t work University of Massachusetts genomicist Kathryn Lord and her colleagues compared DNA sequences and behavioral surveys from more than 3,000 dogs whose humans had enrolled them in the Darwin’s Ark project (and filled out the surveys). “Genetic tests for behavioral and personality traits in dogs are now being marketed to pet owners, but their predictive accuracy has not been validated,” wrote Lord and her colleagues in their recent paper.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1498905251-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1498905251-1152x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 14:03:30 +0000",
      "title": "The Boys gears up for a supe-ocalypse in S5 teaser",
      "neutral_headline": "The Boys gears up for a supe-ocalypse in S5 teaser",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/the-boys-gears-up-for-a-supe-ocalypse-in-s5-teaser/",
          "published_at": "Mon, 08 Dec 2025 14:03:30 +0000",
          "title": "The Boys gears up for a supe-ocalypse in S5 teaser",
          "standfirst": "\"So how about it, you lot? One last go?\"",
          "content": "Prime Video dropped an extended teaser for the fifth and final season of The Boys—based on the comic book series of the same name by Garth Ennis and Darick Robertson—during CCXP in Sao Paulo, Brazil. And it looks like we’re getting nothing less than a full-on Supe-ocalypse as an all-powerful Homelander seeks revenge on The Boys. (Spoilers for prior seasons of The Boys and S2 of Gen V below.) Things were not looking good for our antiheroes after the S4 finale. They managed to thwart the assassination of newly elected US President Robert Singer, but new Vought CEO/evil supe Sister Sage (Susan Heyward) essentially overthrew the election and installed Senator Steve Calhoun (David Andrews) as president. Calhoun declared martial law, and naturally, Homelander (Antony “Give Him an Emmy Already” Starr) swore loyalty as his chief enforcer. Butcher (Karl Urban) and Annie (Erin Moriarty) escaped, but the rest of The Boys were rounded up and placed in re-education—er, “Freedom”—camps.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/boys2-1152x648-1765118776.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/boys2-1152x648-1765118776.jpg",
      "popularity_score": 280
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 12:00:14 +0000",
      "title": "Please send help. I can’t stop playing these roguelikes.",
      "neutral_headline": "Please send help. I can’t stop playing these roguelikes.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/please-send-help-i-cant-stop-playing-these-roguelikes/",
          "published_at": "Mon, 08 Dec 2025 12:00:14 +0000",
          "title": "Please send help. I can’t stop playing these roguelikes.",
          "standfirst": "2025 was a very good year for my favorite genre.",
          "content": "It’s time to admit, before God and the good readers of Ars Technica, that I have a problem. I love roguelikes. Reader, I can’t get enough of them. If there’s even a whisper of a hot new roguelike on Steam, I’m there. You may call them arcane, repetitive, or maddeningly difficult; I call them heaven. The second best part of video games is taking a puny little character and, over 100 hours, transforming that adventurer into a god of destruction. The best thing about video games is doing the same thing in under an hour. Beat a combat encounter, get an upgrade. Enter a new area, choose a new item. Put together a build and watch it sing. If you die—immediately ending your ascent and returning you to the beginning of the game—you’ll often make a pit stop at a home base to unlock new goodies to help you on your next run. (Some people distiguish between roguelikes and “roguelites,” with the latter including permanent, between-run upgrades. For simplicity’s sake, I’ll use “roguelike” as an umbrella term).Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hades2_dec22_01-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hades2_dec22_01-1152x648.jpg",
      "popularity_score": 273
    }
  ]
}