{
  "updated_at": "2025-12-17T19:15:27.819Z",
  "clusters": [
    {
      "id": "cluster_72",
      "coverage": 2,
      "updated_at": "Wed, 17 Dec 2025 10:30:00 +0000",
      "title": "Microsoft Will Finally Kill an Encryption Cipher That Enabled a Decade of Windows Hacks",
      "neutral_headline": "Microsoft will finally kill obsolete cipher that has wreaked decades of havoc",
      "bullet_summary": [
        "Reported by Wired Tech, Ars Technica"
      ],
      "items": [
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/microsoft-will-finally-kill-an-encryption-cipher-that-enabled-a-decade-of-windows-hacks/",
          "published_at": "Wed, 17 Dec 2025 10:30:00 +0000",
          "title": "Microsoft Will Finally Kill an Encryption Cipher That Enabled a Decade of Windows Hacks",
          "standfirst": "The weak RC4 for administrative authentication has been a hacker holy grail for decades.",
          "content": "The weak RC4 for administrative authentication has been a hacker holy grail for decades.",
          "feed_position": 11,
          "image_url": "https://media.wired.com/photos/6941e0f0407ac71425aff90b/master/pass/sec-windows-hack-2239565039.jpg"
        },
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/12/microsoft-will-finally-kill-obsolete-cipher-that-has-wreaked-decades-of-havoc/",
          "published_at": "Mon, 15 Dec 2025 21:15:55 +0000",
          "title": "Microsoft will finally kill obsolete cipher that has wreaked decades of havoc",
          "standfirst": "The weak RC4 for administrative authentication has been a hacker holy grail for decades.",
          "content": "Microsoft is killing off an obsolete and vulnerable encryption cipher that Windows has supported by default for 26 years following more than a decade of devastating hacks that exploited it and recently faced blistering criticism from a prominent US senator. When the software maker rolled out Active Directory in 2000, it made RC4 a sole means of securing the Windows component, which administrators use to configure and provision fellow administrator and user accounts inside large organizations. RC4, short for Rivist Cipher 4, is a nod to mathematician and cryptographer Ron Rivest of RSA Security, who developed the stream cipher in 1987. Within days of the trade-secret-protected algorithm being leaked in 1994, a researcher demonstrated a cryptographic attack that significantly weakened the security it had been believed to provide. Despite the known susceptibility, RC4 remained a staple in encryption protocols, including SSL and its successor TLS, until about a decade ago. Out with the old One of the most visible holdouts in supporting RC4 has been Microsoft. Eventually, Microsoft upgraded Active Directory to support the much more secure AES encryption standard. But by default, Windows servers have continued to respond to RC4-based authentication requests and return an RC4-based response. The RC4 fallback has been a favorite weakness hackers have exploited to compromise enterprise networks. Use of RC4 played a key role in last year’s breach of health giant Ascension. The breach caused life-threatening disruptions at 140 hospitals and put the medical records of 5.6 million patients into the hands of the attackers. US Senator Ron Wyden (D-Ore.) in September called on the Federal Trade Commission to investigate Microsoft for “gross cybersecurity negligence,” citing the continued default support for RC4.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/microsoft-logo-1024x648.jpg"
        }
      ],
      "featured_image": "https://media.wired.com/photos/6941e0f0407ac71425aff90b/master/pass/sec-windows-hack-2239565039.jpg",
      "popularity_score": 2011.2422727777778
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 18:41:25 +0000",
      "title": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
      "neutral_headline": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/tech-policy/2025/12/us-threatens-crackdown-on-eu-firms-as-clash-over-tech-regulations-intensifies/",
          "published_at": "Wed, 17 Dec 2025 18:41:25 +0000",
          "title": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
          "standfirst": "Spotify and Accenture caught in crossfire as Trump attacks EU tech regulations.",
          "content": "The US threatened to restrict some of the largest service providers in the European Union as retaliation for EU tech regulations and investigations are increasingly drawing Donald Trump’s ire. On Tuesday, the Office of the US Trade Representative (USTR) issued a warning on X, naming Spotify, Accenture, Amadeus, Mistral, Publicis, and DHL among nine firms suddenly yanked into the middle of the US-EU tech fight. “The European Union and certain EU Member States have persisted in a continuing course of discriminatory and harassing lawsuits, taxes, fines, and directives against US service providers,” USTR’s post said.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2233373547-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2233373547-1152x648.jpg",
      "popularity_score": 367.43255055555557
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 16:10:43 +0000",
      "title": "Trump admin threatens to break up major climate research center",
      "neutral_headline": "Trump admin threatens to break up major climate research center",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/trump-admin-threatens-to-break-up-major-climate-research-center/",
          "published_at": "Wed, 17 Dec 2025 16:10:43 +0000",
          "title": "Trump admin threatens to break up major climate research center",
          "standfirst": "Major research institution dismissed as a source of \"climate alarmism.\"",
          "content": "On Tuesday, the head of the Office of Management and Budget, Russell Vought, announced that a major climate research center will be “broken up.” The National Center for Atmospheric Research, or NCAR, is a significant contributor to research on the weather, climate, and other atmospheric phenomena. The move will be a crippling blow to climate research in the US and is being widely decried by scientists. Vought initially gave a statement regarding NCAR to USA Today and later confirmed the outlet’s reporting on social media. Calling it “one of the largest sources of climate alarmism in the country,” Vought also decried what he termed “woke” activities at NCAR. These appear to be fairly typical efforts made to attract underrepresented groups to the sciences—efforts that were uncontroversial prior to the current administration. NCAR is primarily based in a complex on the outskirts of Boulder, Colorado, and maintains a supercomputing center in Wyoming. Much of its funding comes from the National Science Foundation, but the day-to-day management is handled by the University Corporation for Atmospheric Research (UCAR), a nonprofit that represents 130 individual educational institutions. In addition to climate science, researchers based there study Earth and space weather, atmospheric chemistry, and their impacts on the environment and humans. NCAR hosts a series of webpages that explain its research and all the ways it helps society.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1086618384-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1086618384-1152x648.jpg",
      "popularity_score": 357.9208836111111
    },
    {
      "id": "cluster_27",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 16:00:25 +0000",
      "title": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
      "neutral_headline": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/google-releases-gemini-3-flash-promising-improved-intelligence-and-efficiency/",
          "published_at": "Wed, 17 Dec 2025 16:00:25 +0000",
          "title": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
          "standfirst": "Google's Gemini 3 family is now complete with release of Gemini 3 Flash.",
          "content": "Google began its transition to Gemini 3 a few weeks ago with the launch of the Pro model, and the arrival of Gemini 3 Flash kicks it into high gear. The new, faster Gemini 3 model is coming to the Gemini app and search, and developers will be able to access it immediately via the Gemini API, Vertex AI, AI Studio, and Antigravity. Google’s bigger gen AI model is also picking up steam, with both Gemini 3 Pro and its image component (Nano Banana Pro) expanding in search. This may come as a shock, but Google says Gemini 3 Flash is faster and more capable than its previous base model. As usual, Google has a raft of benchmark numbers that show modest improvements for the new model. It bests the old 2.5 Flash in basic academic and reasoning tests like GPQA Diamond and MMMU Pro (where it even beats 3 Pro). It gets a larger boost in Humanity’s Last Exam (HLE), which tests advanced domain-specific knowledge. Gemini 3 Flash has tripled the old models’ score in HLE, landing at 33.7 percent without tool use. That’s just a few points behind the Gemini 3 Pro model. Credit: Google Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/gemini-3_flash_model_blog_header_dark_bleed_2096x1182-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/gemini-3_flash_model_blog_header_dark_bleed_2096x1182-1152x648.png",
      "popularity_score": 351.74921694444447
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 15:25:25 +0000",
      "title": "Browser extensions with 8 million users collect extended AI conversations",
      "neutral_headline": "Browser extensions with 8 million users collect extended AI conversations",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/12/browser-extensions-with-8-million-users-collect-extended-ai-conversations/",
          "published_at": "Wed, 17 Dec 2025 15:25:25 +0000",
          "title": "Browser extensions with 8 million users collect extended AI conversations",
          "standfirst": "The extensions, available for Chromium browsers, harvest full AI conversations over months.",
          "content": "Browser extensions with more than 8 million installs are harvesting complete and extended conversations from users’ AI conversations and selling them for marketing purposes, according to data collected from the Google and Microsoft pages hosting them. Security firm Koi discovered the eight extensions, which as of late Tuesday night remained available in both Google’s and Microsoft’s extension stores. Seven of them carry “Featured” badges, which are endorsements meant to signal that the companies have determined the extensions meet their quality standards. The free extensions provide functions such as VPN routing to safeguard online privacy and ad blocking for ad-free browsing. All provide assurances that user data remains anonymous and isn’t shared for purposes other than their described use. A gold mine for marketers and data brokers An examination of the extensions’ underlying code tells a much more complicated story. Each contains eight of what Koi calls “executor” scripts, with each being unique for ChatGPT, Claude, Gemini, and five other leading AI chat platforms. The scripts are injected into webpages anytime the user visits one of these platforms. From there, the scripts override browsers’ built-in functions for making network requests and receiving responses.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/electronic-privacy-invasion-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/electronic-privacy-invasion-1152x648.jpg",
      "popularity_score": 344.1658836111111
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 15:09:03 +0000",
      "title": "Electric vehicles cause tension in the automotive aftermarket",
      "neutral_headline": "Electric vehicles cause tension in the automotive aftermarket",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/how-is-ev-technology-being-accepted-by-the-aftermarket/",
          "published_at": "Wed, 17 Dec 2025 15:09:03 +0000",
          "title": "Electric vehicles cause tension in the automotive aftermarket",
          "standfirst": "At SEMA, we heard Trump-like talking points but saw skateboard chassis, too.",
          "content": "After federal clean vehicle tax credits ended in September, the electric vehicle industry reached a crossroads. Well, technically, it has been there since Trump took office. This is a weird period in automotive history; A chunk of the industry is full-steam ahead with EV development, another is cutting back, and the consumer is left wondering what the electrification landscape will look like next year, let alone in three, during the next administration. But what about the automotive aftermarket? Typically, this corner benefits from whatever progress is made on the OEM front—have Trump’s policies expanded or contracted its EV technological development? I recently spent some time chatting with personnel of the Specialty Equipment Market Association (SEMA) at its yearly tradeshow in Las Vegas to find out. I also hit the bricks (or, rather, bright carpeting) of the massive show itself, seeking out some new, unique developments in the space that behoove EV tech’s inherent benefits. Above one of the show’s several sprawling halls, I met with Mike Spagnola, SEMA’s CEO, and Karen Bailey-Chapman, senior vice president, public and government affairs, to learn what the organization’s official stance is. First and foremost: It doesn’t want to be told what to do.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/SEMAPhotos20251-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/SEMAPhotos20251-1152x648.jpg",
      "popularity_score": 324.8931058333333
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 14:41:36 +0000",
      "title": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
      "neutral_headline": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/twitter-comeback-bid-draws-lawsuit-from-elon-musks-x-corp/",
          "published_at": "Wed, 17 Dec 2025 14:41:36 +0000",
          "title": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
          "standfirst": "“Huge uphill battle” to obtain and use Twitter name.",
          "content": "On Tuesday, X Corporation, formerly known as Twitter, sued “Operation Bluebird,” the new startup that is seeking to reclaim the allegedly abandoned Twitter trademark and relaunch a new social media network under that name. In its 43-page lawsuit, which was filed in federal court in Delaware, X Corporation alleges trademark infringement, adding that despite Bluebird’s “purported plan, it cannot bring Twitter ‘back’—Twitter never left and continues to be exclusively owned by X Corp.” One of Bluebird’s leaders, Michael Peroff, told Ars in an email that Operation Bluebird was “fully expecting” a lawsuit from X Corporation and that “we planned for it.”Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-twitter-broken-phone-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-twitter-broken-phone-1152x648.jpg",
      "popularity_score": 308.43560583333334
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 12:00:13 +0000",
      "title": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
      "neutral_headline": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/trump-spent-2025-attacking-science-that-could-set-back-his-genesis-mission/",
          "published_at": "Wed, 17 Dec 2025 12:00:13 +0000",
          "title": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
          "standfirst": "Trump’s AI “Manhattan Project” will fail if DOGE cuts are kept, critics say.",
          "content": "By executive order last month, Donald Trump launched his so-called “Genesis Mission.” Described as a “historic national effort” to “invest in AI-enabled science to accelerate scientific advancement,” Trump claimed his mission would address key challenges to American energy dominance, innovation, and national security. This mission, Trump boasted, would be a game-changer to science akin to putting a man on the moon or firing the first nuclear weapons. By building “an integrated AI platform” trained on “the world’s largest collection” of federal scientific data sets, he promised, the government could set off cascades of scientific breakthroughs.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/trump-project-genesis-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/trump-project-genesis-1152x648.jpg",
      "popularity_score": 300.74588361111114
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 12:30:15 +0000",
      "title": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
      "neutral_headline": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/us-oil-industry-doesnt-see-profit-in-trumps-pro-petroleum-moves/",
          "published_at": "Wed, 17 Dec 2025 12:30:15 +0000",
          "title": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
          "standfirst": "The financial picture around drilling is moving against the Trump administration’s hopes",
          "content": "As the Trump administration makes announcement after announcement about its efforts to promote the US fossil fuel industry, the industry isn’t exactly jumping at new opportunities. Some high-profile oil and gas industry leaders and organizations have objected to changes to long-standing government policy positions that give companies firm ground on which to make their plans. And the financial picture around oil and gas drilling is moving against the Trump administration’s hopes. Though politicians may tout new opportunities to drill offshore or in Arctic Alaska, the commercial payoff is not clear and even unlikely.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2245935569-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2245935569-1152x648.jpg",
      "popularity_score": 296.2464391666667
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:57:55 +0000",
      "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "neutral_headline": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/texas-sues-biggest-tv-makers-alleging-smart-tvs-spy-on-users-without-consent/",
          "published_at": "Tue, 16 Dec 2025 21:57:55 +0000",
          "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
          "standfirst": "Automated Content Recognition brings \"mass surveillance\" to homes, lawsuits say.",
          "content": "Texas Attorney General Ken Paxton sued five large TV manufacturers yesterday, alleging that their smart TVs spy on viewers without consent. Paxton sued Samsung, the longtime TV market share leader, along with LG, Sony, Hisense, and TCL. “These companies have been unlawfully collecting personal data through Automated Content Recognition (‘ACR’) technology,” Paxton’s office alleged in a press release that contains links to all five lawsuits. “ACR in its simplest terms is an uninvited, invisible digital invader. This software can capture screenshots of a user’s television display every 500 milliseconds, monitor viewing activity in real time, and transmit that information back to the company without the user’s knowledge or consent. The companies then sell that consumer information to target ads across platforms for a profit. This technology puts users’ privacy and sensitive information, such as passwords, bank information, and other personal information at risk.” The lawsuits allege violations of the Texas Deceptive Trade Practices Act, seeking damages of up to $10,000 for each violation and up to $250,000 for each violation affecting people 65 years or older. Texas also wants restraining orders prohibiting the collection, sharing, and selling of ACR data while the lawsuits are pending.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg",
      "popularity_score": 263
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:25:05 +0000",
      "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "neutral_headline": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/the-4-3-billion-space-telescope-trump-tried-to-cancel-is-now-complete/",
          "published_at": "Tue, 16 Dec 2025 21:25:05 +0000",
          "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
          "standfirst": "\"We're going to be making 3D movies of what is going on in the Milky Way galaxy.\"",
          "content": "A few weeks ago, technicians inside a cavernous clean room in Maryland made the final connection to complete assembly of NASA’s Nancy Grace Roman Space Telescope. Parts of this new observatory, named for NASA’s first chief astronomer, recently completed a spate of tests to ensure it can survive the shaking and intense sound of a rocket launch. Engineers placed the core of the telescope inside a thermal vacuum chamber, where it withstood the airless conditions and extreme temperature swings it will see in space. Then, on November 25, teams at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, joined the inner and outer portions of the Roman Space Telescope. With this milestone, NASA declared the observatory complete and on track for launch as soon as fall 2026.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg",
      "popularity_score": 261
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:25:57 +0000",
      "title": "Senators count the shady ways data centers pass energy costs on to Americans",
      "neutral_headline": "Senators count the shady ways data centers pass energy costs on to Americans",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/shady-data-center-deals-doom-americans-to-higher-energy-bills-senators-say/",
          "published_at": "Tue, 16 Dec 2025 20:25:57 +0000",
          "title": "Senators count the shady ways data centers pass energy costs on to Americans",
          "standfirst": "Senators demand Big Tech pay upfront for data center spikes in electricity bills.",
          "content": "Senators launched a probe Tuesday demanding that tech companies explain exactly how they plan to prevent data center projects from increasing electricity bills in communities where prices are already skyrocketing. In letters to seven AI firms, Senators Elizabeth Warren (D-Mass.), Chris Van Hollen (D-Md.), and Richard Blumenthal (D-Conn.) cited a study estimating that “electricity prices have increased by as much as 267 percent in the past five years” in “areas located near significant data center activity.” Prices increase, senators noted, when utility companies build out extra infrastructure to meet data centers’ energy demands—which can amount to one customer suddenly consuming as much power as an entire city. They also increase when demand for local power outweighs supply. In some cases, residents are blindsided by higher bills, not even realizing a data center project was approved, because tech companies seem intent on dodging backlash and frequently do not allow terms of deals to be publicly disclosed.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg",
      "popularity_score": 243
    },
    {
      "id": "cluster_89",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:52:43 +0000",
      "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "neutral_headline": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/leaked-debug-kit-suggests-apple-is-testing-a-new-imac-pro-among-many-other-macs/",
          "published_at": "Tue, 16 Dec 2025 18:52:43 +0000",
          "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
          "standfirst": "Resurrected high-end all-in-one could be a worthy successor to 2017's iMac Pro.",
          "content": "Apple doesn’t like to talk about its upcoming products before it’s ready, but sometimes the company’s software does the talking for it. So far this week we’ve had a couple of software-related leaks that have outed products Apple is currently testing—one a pre-release build of iOS 26, and the other some leaked files from a kernel debug kit (both via MacRumors). Most of the new devices referenced in these leaks are straightforward updates to products that already exist: a new Apple TV, a HomePod mini 2, new AirTags and AirPods, an M4 iPad Air, a 12th-generation iPad to replace the current A16 version, next-generation iPhones (including the 17e, 18, and the rumored foldable model), a new Studio Display model, some new smart home products we’ve already heard about elsewhere, and M5 updates for the MacBook Air, Mac mini, Mac Studio, and the other MacBook Pros. There’s also yet another reference to the lower-cost MacBook that Apple is apparently planning to replace the M1 MacBook Air it still sells via Walmart for $599. For power users, though, the most interesting revelation might be that Apple is working on a higher-end Apple Silicon iMac powered by an M5 Max chip. The kernel debug kit references an iMac with the internal identifier J833c, based on a platform identified as H17C—and H17C is apparently based on the M5 Max, rather than a lower-end M5 chip. (For those who don’t have Apple’s branding memorized, “Max” is associated with Apple’s second-fastest chips; the M5 Max would be faster than the M5 or M5 Pro, but slower than the rumored M5 Ultra.)Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg",
      "popularity_score": 151
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 15:09:45 +0000",
      "title": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
      "neutral_headline": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/ars-live-3-former-cdc-leaders-detail-impacts-of-rfk-jr-s-anti-science-agenda/",
          "published_at": "Tue, 16 Dec 2025 15:09:45 +0000",
          "title": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
          "standfirst": "Join us today, December 16, at 2 pm ET to hear from leaders who resigned in protest.",
          "content": "The Centers for Disease Control and Prevention is in critical condition. This year, the premier public health agency had its funding brutally cut and staff gutted, its mission sabotaged, and its headquarters riddled with literal bullets. The over 500 rounds fired were meant for its scientists and public health experts, who endured only to be sidelined, ignored, and overruled by Health Secretary Robert F. Kennedy Jr., an anti-vaccine activist hellbent on warping the agency to fit his anti-science agenda. Then, on August 27, Kennedy fired CDC Director Susan Monarez just weeks after she was confirmed by the Senate. She had refused to blindly approve vaccine recommendations from a panel of vaccine skeptics and contrarians that he had hand-selected. The agency descended into chaos, and Monarez wasn’t the only one to leave the agency that day. Three top leaders had reached their breaking point and coordinated their resignations upon the dramatic ouster: Drs. Demetre Daskalakis, Debra Houry, and Daniel Jernigan walked out of the agency as their colleagues rallied around them.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2231820155-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2231820155-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_108",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 22:41:43 +0000",
      "title": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
      "neutral_headline": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/merriam-webster-crowns-slop-word-of-the-year-as-ai-content-floods-internet/",
          "published_at": "Mon, 15 Dec 2025 22:41:43 +0000",
          "title": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
          "standfirst": "Dictionary codifies the term that took hold in 2024 for low-quality AI-generated content.",
          "content": "Like most tools, generative AI models can be misused. And when the misuse gets bad enough that a major dictionary notices, you know it has become a cultural phenomenon. On Sunday, Merriam-Webster announced that “slop” is its 2025 Word of the Year, reflecting how the term has become shorthand for the flood of low-quality AI-generated content that has spread across social media, search results, and the web at large. The dictionary defines slop as “digital content of low quality that is produced usually in quantity by means of artificial intelligence.” “It’s such an illustrative word,” Merriam-Webster President Greg Barlow told The Associated Press. “It’s part of a transformative technology, AI, and it’s something that people have found fascinating, annoying, and a little bit ridiculous.”Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241620003-1152x648-1765829622.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241620003-1152x648-1765829622.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_109",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 22:14:28 +0000",
      "title": "Stranger Things S5 trailer teases Vol. 2",
      "neutral_headline": "Stranger Things S5 trailer teases Vol. 2",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/stranger-things-s5-trailer-teases-vol-2/",
          "published_at": "Mon, 15 Dec 2025 22:14:28 +0000",
          "title": "Stranger Things S5 trailer teases Vol. 2",
          "standfirst": "\"Everything we've ever assumed about the Upside Down has been dead wrong.\"",
          "content": "We’re 10 days away from the next installment of the fifth and final season of Stranger Things, and Netflix has released a new trailer for what it’s calling Volume 2. This will cover episodes five through seven, with the final episode comprising Vol. 3. (Spoilers for Season 5, Vol. 1 below.) Season 4 ended with Vecna—the Big Bad behind it all—opening the gate that allowed the Upside Down to leak into Hawkins. We got a time jump for S5, Vol. 1, but in a way, we came full circle, since those events coincided with the third anniversary of Will’s original disappearance in S1.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/vecna1-1152x648-1765835577.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/vecna1-1152x648-1765835577.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_112",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 20:20:05 +0000",
      "title": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
      "neutral_headline": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/microsoft-takes-down-mod-that-recreated-halo-3-in-counter-strike-2/",
          "published_at": "Mon, 15 Dec 2025 20:20:05 +0000",
          "title": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
          "standfirst": "Project Misriah creator vows to use new experience \"to cook up something else.\"",
          "content": "Last month saw the release of Project Misriah, an ambitious modding project that tried to re-create the feel of Halo 3 inside Valve’s Counter-Strike 2. That project has now been taken down from the Steam Workshop, though, after drawing a Digital Millennium Copyright Act complaint from Microsoft. Modder Froddoyo introduced Project Misriah on November 16 as “a workshop collection of Halo ported maps and assets that aims to bring a Halo 3 multiplayer-like experience to Counter-Strike 2.” Far from just being inspired by Halo 3, the mod directly copied multiple sound effects, character models, maps, and even movement mechanics from Bungie and Microsoft’s popular series. In the weeks since, Project Misriah has drawn a lot of praise from both Halo fans and those impressed by what modders could pull off with the Source 2 engine. But last Wednesday, modder Froddoyo shared a DMCA request from Microsoft citing the “unauthorized use of Halo game content in a [Steam] workshop not associated with Halo games.”Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/mistriah-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/mistriah-1152x648.png",
      "popularity_score": 145
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:00:57 +0000",
      "title": "Utah leaders hinder efforts to develop solar energy supply",
      "neutral_headline": "Utah leaders hinder efforts to develop solar energy supply",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/utah-leaders-hinder-efforts-to-develop-solar-energy-supply/",
          "published_at": "Tue, 16 Dec 2025 17:00:57 +0000",
          "title": "Utah leaders hinder efforts to develop solar energy supply",
          "standfirst": "Solar power accounts for two-thirds of the new projects waiting to connect to the state’s power grid.",
          "content": "Utah Gov. Spencer Cox believes his state needs more power—a lot more. By some estimates, Utah will require as much electricity in the next five years as it generated all last century to meet the demands of a growing population as well as chase data centers and AI developers to fuel its economy. To that end, Cox announced Operation Gigawatt last year, declaring the state would double energy production in the next decade. Although the announcement was short on details, Cox, a Republican, promised his administration would take an “any of the above” approach, which aims to expand all sources of energy production. Despite that goal, the Utah Legislature’s Republican supermajority, with Cox’s acquiescence, has taken a hard turn against solar power—which has been coming online faster than any other source in Utah and accounts for two-thirds of the new projects waiting to connect to the state’s power grid.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 15:38:57 +0000",
      "title": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
      "neutral_headline": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/2026-mercedes-cla-first-drive-entry-level-doesnt-mean-basic/",
          "published_at": "Tue, 16 Dec 2025 15:38:57 +0000",
          "title": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
          "standfirst": "Starting at $47,250, Mercedes' new electric sedan is quite compelling.",
          "content": "Mercedes-Benz provided flights from Washington to San Francisco and accommodation so Ars could drive the CLA. Ars does not accept paid editorial content. SAN FRANCISCO—Automakers are starting to follow somewhat familiar paths as they continue their journeys to electrification. Electric vehicles are, at first, strange new tech, and usually look like it. Mercedes-Benz’s EQS and EQE are good examples—with bodies that look like bars of soap worn down in the shower, they stood out. For early adopters and trailblazers that might be fine, but you need to sell cars to normal people if you want to survive, and that means making EVs more normal. Which is what Mercedes did with its newest one, the all-electric CLA. The normal looks belie the amount of new technology that Mercedes has packed into the CLA, though. The car sticks to the four-door coupe look that the company pioneered a couple of decades ago, but there’s a thoroughly modern electric powertrain connected to the wheels, run by four powerful networked computers. And yes, there’s AI. (For the pedants, “coupe” means cut down, not two-door, so the name is accurate.) The CLA is the first of a new series of Mercedes that will use the same modular architecture, and interestingly, it’s powertrain agnostic—a hybrid CLA is coming in time, too. But first the battery EV, which makes good use of some technology Mercedes developed for the EQXX concept car.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026-Mercedes-Benz-CLA-4-1152x648-1765897346.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026-Mercedes-Benz-CLA-4-1152x648-1765897346.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:28:32 +0000",
      "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "neutral_headline": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/journalist-insists-half-life-3-will-launch-with-steam-machine-in-spring-2026/",
          "published_at": "Tue, 16 Dec 2025 17:28:32 +0000",
          "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
          "standfirst": "\"Everybody I've talked to are still adamant,\" even after previous rumors didn't pan out.",
          "content": "If you can take your mind way back to the beginning of 2025, you might remember a fresh wave of rumors suggesting that Half-Life 3 was finally reaching the final stages of production, and could be announced and/or released at any moment. Now, though, 2025 seems set to come to a close without any official news of a game fans have been waiting literal decades for. That doesn’t necessarily mean a Half-Life 3 announcement and/or release isn’t imminent, though. On the contrary, veteran journalist Mike Straw insisted on a recent Insider Gaming podcast that “everybody I’ve talked to are still adamant [Half-Life 3] is a game that will be a launch title with the Steam Machine.” Straw—who has a long history of reporting gaming rumors from anonymous sources—said this Half-Life 3 information is “not [from] these run-of-the-mill sources that haven’t gotten me information before. … These aren’t like random, one-off people.” And those sources are “still adamant that the game is coming in the spring,” Straw added, noting that he was “specifically told [that] spring 2026 [is the window] for the Steam Machine, for the Frame, for the Controller, [and] for Half-Life 3.”Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 21:05:18 +0000",
      "title": "Ford ends F-150 Lightning production, starts battery storage business",
      "neutral_headline": "Ford ends F-150 Lightning production, starts battery storage business",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/ford-ends-f-150-lightning-production-starts-battery-storage-business/",
          "published_at": "Mon, 15 Dec 2025 21:05:18 +0000",
          "title": "Ford ends F-150 Lightning production, starts battery storage business",
          "standfirst": "It looks like battery electric vehicles are out of fashion at the Blue Oval.",
          "content": "Ford’s F-150 Lightning production line has fallen silent, and its employees are now building more gas and hybrid trucks. The automaker continues to retreat from the big bet it made on Americans embracing full-size battery electric pickup trucks, and will focus instead on cheaper vehicles, hybrids, and range-extended electric vehicles—or EREVs—instead, it announced today. One of those EREVs will be the Lighting’s replacement. With a gasoline generator that just charges the battery—series hybrid fans rejoice—the next Lightning comes with the towing ability that Ford says its customers consider “non-negotiable,” and up to 700 miles (1,126 km) of range. “Our next-generation F-150 Lightning EREV will be every bit as revolutionary. It delivers everything Lightning customers love – near instantaneous torque and pure electric driving. But with a high-power generator enabling an estimated range of 700+ miles, it tows like a locomotive. Heavy-duty towing and cross-country travel will be as effortless as the daily commute,” said Doug Field, Ford’s chief EV, digital and design officer.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250038446-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250038446-1152x648.jpg",
      "popularity_score": 133
    }
  ]
}