{
  "updated_at": "2026-02-23T11:34:39.687Z",
  "clusters": [
    {
      "id": "cluster_6",
      "coverage": 2,
      "updated_at": "Mon, 23 Feb 2026 10:01:25 +0000",
      "title": "The best cheap Windows laptops for 2026",
      "neutral_headline": "The best cheap Windows laptops for 2026",
      "bullet_summary": [
        "Great sound quality, a comfortable fit and sufficient battery life are still the foundations",
        "One AI security framework showed how this method worked: Teams first ran AI in shadow mode (AI makes suggestions but doesn&#x27;t act on its own), then compared AI and human inputs to determine trust",
        "A recent Amazon Web Services (AWS) outage that lasted 13 hours was reportedly caused by one of its own AI tools, according to reporting by Financial Times",
        "In this case, the bot reportedly determined that it needed to \"delete and recreate the environment"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/laptops/best-affordable-windows-laptops-123000512.html",
          "published_at": "Mon, 23 Feb 2026 10:01:25 +0000",
          "title": "The best cheap Windows laptops for 2026",
          "standfirst": "You don’t need to spend a fortune to get a capable Windows laptop. For everyday tasks like web browsing, writing documents, streaming video or handling schoolwork, a well-chosen budget machine can still deliver a smooth, reliable experience. The challenge is cutting through the noise to find affordable options that balance performance, build quality and battery life without serious compromises.For many buyers, timing is no longer optional. With Windows 10 support now officially over, upgrading has become a necessity rather than a nice-to-have. The picks below focus on cheap Windows laptops that can handle day-to-day workloads comfortably while keeping you current on software and security updates. If you’re open to spending more for extra power or premium features, our broader guide to the best Windows laptops covers higher-end alternatives as well. What to look for in a budget-friendly Windows laptop While you can do a lot even when spending little on a Windows laptop, you must set your expectations accordingly. The biggest downside when purchasing a budget laptop (of any kind, really) is limited power. You’ll want to carefully consider a few specs, the most important among them being the processor (CPU). Many Windows laptops under $500 run on Intel Celeron or Pentium chipsets, but you can find some with Core i3/i5 and AMD Ryzen 3/5 CPUs at the higher end of the price spectrum. We recommend getting the most powerful CPU you can afford because it will dictate how fast the computer will feel overall. Memory (RAM) is also important because, the more you have, the easier it will be for the laptop to manage things like a dozen browser tabs while you edit a Word document and stream music in the background. When it comes to storage, consider how much you want to save locally. If you primarily work in Google Docs or save most things in the cloud, you may not need a machine with a ton of onboard storage. Just remember that your digital space will also be taken up by apps, so it may be worth getting a little extra storage than you think you need if you know you’ll be downloading big programs. A final side note: solid state drives (SSDs) are ubiquitous at this point, not to mention faster and more efficient than hard drives (HDDs), so we recommend getting a laptop with that type of storage. As for screens, there’s a healthy mix of HD (720p resolution) and FHD (1080p) options in this price range and we recommend springing for a notebook with a 1080p display if you can. Touchscreens aren’t as common in the budget space as standard panels, but you’ll only really miss one if you get a 2-in-1 laptop. Before we get to our recommended specs for a cheap Windows laptop, it’s worth mentioning that Microsoft clearly lays out the true minimum requirements for any Windows 11 machine. Those include a 1GHz or faster processor that includes two or more cores, at least 4GB of RAM and 64GB of available storage space. That’s the bare minimum to run Windows 11; we recommend giving yourself some wiggle room by choosing a machine that will perform well now and for years to come. Specs to look for in an affordable Windows laptop CPU: Intel Core i3 or AMD Ryzen 3 processors, at minimum RAM: At least 8GB Storage: At least 128GB SSD Screen: At least 1080p FHD It’s essential to prioritize what’s important to you. But at the lower end of the budget, a good laptop may not offer everything you need, whereas a great one might. Although most machines come with features like Bluetooth, built-in Wi-Fi and additional ports, you might find not all of them come with the specifics you require, like an SD card slot, webcam, charger, and so on. Be sure to check the spec list of any laptop you’re considering before you buy, especially if you need specific connectors and capabilities. See Also: Best Laptops for 2026 Best Gaming Laptops Best 2-in-1 Laptops for 2026 Best Chromebooks Best Laptops for College Students As for Copilot+, don’t expect to see much of it on truly affordable Windows laptops just yet. Microsoft’s AI features and Copilot assistant require certain specs to run, namely a powerful neural processing unit (NPU), 16GB of RAM and 256GB of storage. Currently, the cheapest Copilot+ AI PCs will run you about $700, so if you’re willing to pay more for those perks, check out our best laptops guide for more options. If you’re looking for either a gaming laptop or a “Windows on Arm” laptop, both categories will require you to spend more money than we’re discussing here. Best cheap Windows laptops for 2026 The cheap Windows laptop market moves fast, and — unlike nearly all of our other buying guides — we haven't necessarily tested each specific configuration listed below. However, the combination of these technical specifications and familiar brands represent exactly the sort of entry-level laptops we'd recommend to shoppers in this price range based on our thorough research and expert knowledge. What to know about the budget Windows laptop market The best cheap laptop models change all the time. Unlike more expensive, flagship machines, these notebooks can be updated a couple times each year. That can make it hard to track down a specific model at Amazon, Best Buy, Walmart or any other retailer. Also, we’ve seen prices vary widely depending on the configuration and retailer you’re looking at. You can ensure you’re getting a quality laptop by doing a few things. First and foremost, make sure you get a machine that follows the recommended specs we list above. Also, make sure you’re buying from a reputable retailer, including big-box stores like Walmart, Best Buy and Costco, online shops like Amazon or direct manufacturers like Dell, HP, Lenovo and others. If you have a physical store near you (likely a Best Buy in the US), it’s never a bad idea to go play around with some laptops in person before choosing one. If you decide to shop online from the likes of Amazon or Walmart, double check the seller of the laptop you’re considering. For example, many items on Amazon are “shipped and sold” by Amazon and those are typically the best options. You’ll see that information on Amazon on the right sidebar on a product page, under the Add to Cart and Buy Now buttons. Third-party sellers are common in the affordable laptop space. Amazon sometimes classifies laptop manufacturers as third-party sellers, so you may see a laptop shipped and sold by HP or Dell — that’s a good thing, since it’s coming directly from the manufacturer. However, there are other third-party electronics sellers out there. We recommend clicking on the third-party seller’s name on Amazon or Walmart (yes, Walmart has them, too) to see how much positive feedback and how many five-star ratings they’ve received from buyers. What about Chromebooks and tablets? You may be inclined to recommend a Chromebook or a tablet to anyone considering a budget Windows laptop computer. Those instincts aren’t wrong, but Chromebooks and tablets aren’t the best buy for everyone. Tablets have the most portability, but they will only work for the most mobile-competent users like kids who have been grabbing smartphones out of their parents’ hands since they’ve been dexterous enough to do so. Tablets can also be just as expensive as some of the cheapest Windows laptops, and that’s without a mouse or keyboard. Chromebooks are a good alternative for those that basically live in a browser, the trade-off being you must give up the “traditional desktop.” And Chrome OS is a more limited operating system than Windows when it comes to the programs you can install and run. What Windows laptops do well What can you realistically accomplish on a cheap Windows laptop? Quite a bit, especially if you’re doing one thing (or a limited number of things) at a time. They’re great for everyday tasks like web browsing, checking email, video streaming and more. All of those things can be done on Chromebooks as well, but Windows laptops have a big advantage in Microsoft Office. While yes, there is a browser based version, the native, desktop apps are considered a must have for many and will run smoothly on even the most bare-bones budget laptop. The only caveat is that you may run into some slowdown on low-powered devices if you’re multitasking or working with large data sets in Excel or a lot of photos and graphics in Powerpoint. When it comes to specs, a bright spot for Windows laptops is storage. Even the most affordable devices tend to have at least a 128GB solid state drive. That will come in handy if you prefer to keep your most important files saved locally on your laptop's hard drive. In contrast, cheaper Chromebooks often have less storage because they’re built on the assumption that you’ll save all of your documents in the cloud. Not only is that less convenient when you need to work offline, but it also limits the size of programs and files that you can download. So, Chromebooks aren't the best for hoarding Netflix shows before a long trip or for use as a gaming laptop. Windows also has thousands of apps that you can download from its app store. Chromebooks have some Chrome apps, numerous browser extensions and the ability to download Android apps, but quality control is… inconsistent. Android apps, in particular, often haven’t been optimized for Chrome OS, which makes for a wonky user experience. Windows may not have as many apps as Android, but at least the experience is fairly standard across the board. Windows also gives you the ability to download and use programs from other sources, like direct from the developer. You can run things like Adobe Creative Suite, certain VPNs and programs like GIMP, Audacity and ClipMate on a Windows device, which just isn’t possible on Chrome OS. Chromebooks limit you to the apps and programs in The Play Store and the Chrome Extensions store, reducing any others to unusable, space-sucking icons in your Downloads folder.This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/best-affordable-windows-laptops-123000512.html?src=rss",
          "content": "You don’t need to spend a fortune to get a capable Windows laptop. For everyday tasks like web browsing, writing documents, streaming video or handling schoolwork, a well-chosen budget machine can still deliver a smooth, reliable experience. The challenge is cutting through the noise to find affordable options that balance performance, build quality and battery life without serious compromises.For many buyers, timing is no longer optional. With Windows 10 support now officially over, upgrading has become a necessity rather than a nice-to-have. The picks below focus on cheap Windows laptops that can handle day-to-day workloads comfortably while keeping you current on software and security updates. If you’re open to spending more for extra power or premium features, our broader guide to the best Windows laptops covers higher-end alternatives as well. What to look for in a budget-friendly Windows laptop While you can do a lot even when spending little on a Windows laptop, you must set your expectations accordingly. The biggest downside when purchasing a budget laptop (of any kind, really) is limited power. You’ll want to carefully consider a few specs, the most important among them being the processor (CPU). Many Windows laptops under $500 run on Intel Celeron or Pentium chipsets, but you can find some with Core i3/i5 and AMD Ryzen 3/5 CPUs at the higher end of the price spectrum. We recommend getting the most powerful CPU you can afford because it will dictate how fast the computer will feel overall. Memory (RAM) is also important because, the more you have, the easier it will be for the laptop to manage things like a dozen browser tabs while you edit a Word document and stream music in the background. When it comes to storage, consider how much you want to save locally. If you primarily work in Google Docs or save most things in the cloud, you may not need a machine with a ton of onboard storage. Just remember that your digital space will also be taken up by apps, so it may be worth getting a little extra storage than you think you need if you know you’ll be downloading big programs. A final side note: solid state drives (SSDs) are ubiquitous at this point, not to mention faster and more efficient than hard drives (HDDs), so we recommend getting a laptop with that type of storage. As for screens, there’s a healthy mix of HD (720p resolution) and FHD (1080p) options in this price range and we recommend springing for a notebook with a 1080p display if you can. Touchscreens aren’t as common in the budget space as standard panels, but you’ll only really miss one if you get a 2-in-1 laptop. Before we get to our recommended specs for a cheap Windows laptop, it’s worth mentioning that Microsoft clearly lays out the true minimum requirements for any Windows 11 machine. Those include a 1GHz or faster processor that includes two or more cores, at least 4GB of RAM and 64GB of available storage space. That’s the bare minimum to run Windows 11; we recommend giving yourself some wiggle room by choosing a machine that will perform well now and for years to come. Specs to look for in an affordable Windows laptop CPU: Intel Core i3 or AMD Ryzen 3 processors, at minimum RAM: At least 8GB Storage: At least 128GB SSD Screen: At least 1080p FHD It’s essential to prioritize what’s important to you. But at the lower end of the budget, a good laptop may not offer everything you need, whereas a great one might. Although most machines come with features like Bluetooth, built-in Wi-Fi and additional ports, you might find not all of them come with the specifics you require, like an SD card slot, webcam, charger, and so on. Be sure to check the spec list of any laptop you’re considering before you buy, especially if you need specific connectors and capabilities. See Also: Best Laptops for 2026 Best Gaming Laptops Best 2-in-1 Laptops for 2026 Best Chromebooks Best Laptops for College Students As for Copilot+, don’t expect to see much of it on truly affordable Windows laptops just yet. Microsoft’s AI features and Copilot assistant require certain specs to run, namely a powerful neural processing unit (NPU), 16GB of RAM and 256GB of storage. Currently, the cheapest Copilot+ AI PCs will run you about $700, so if you’re willing to pay more for those perks, check out our best laptops guide for more options. If you’re looking for either a gaming laptop or a “Windows on Arm” laptop, both categories will require you to spend more money than we’re discussing here. Best cheap Windows laptops for 2026 The cheap Windows laptop market moves fast, and — unlike nearly all of our other buying guides — we haven't necessarily tested each specific configuration listed below. However, the combination of these technical specifications and familiar brands represent exactly the sort of entry-level laptops we'd recommend to shoppers in this price range based on our thorough research and expert knowledge. What to know about the budget Windows laptop market The best cheap laptop models change all the time. Unlike more expensive, flagship machines, these notebooks can be updated a couple times each year. That can make it hard to track down a specific model at Amazon, Best Buy, Walmart or any other retailer. Also, we’ve seen prices vary widely depending on the configuration and retailer you’re looking at. You can ensure you’re getting a quality laptop by doing a few things. First and foremost, make sure you get a machine that follows the recommended specs we list above. Also, make sure you’re buying from a reputable retailer, including big-box stores like Walmart, Best Buy and Costco, online shops like Amazon or direct manufacturers like Dell, HP, Lenovo and others. If you have a physical store near you (likely a Best Buy in the US), it’s never a bad idea to go play around with some laptops in person before choosing one. If you decide to shop online from the likes of Amazon or Walmart, double check the seller of the laptop you’re considering. For example, many items on Amazon are “shipped and sold” by Amazon and those are typically the best options. You’ll see that information on Amazon on the right sidebar on a product page, under the Add to Cart and Buy Now buttons. Third-party sellers are common in the affordable laptop space. Amazon sometimes classifies laptop manufacturers as third-party sellers, so you may see a laptop shipped and sold by HP or Dell — that’s a good thing, since it’s coming directly from the manufacturer. However, there are other third-party electronics sellers out there. We recommend clicking on the third-party seller’s name on Amazon or Walmart (yes, Walmart has them, too) to see how much positive feedback and how many five-star ratings they’ve received from buyers. What about Chromebooks and tablets? You may be inclined to recommend a Chromebook or a tablet to anyone considering a budget Windows laptop computer. Those instincts aren’t wrong, but Chromebooks and tablets aren’t the best buy for everyone. Tablets have the most portability, but they will only work for the most mobile-competent users like kids who have been grabbing smartphones out of their parents’ hands since they’ve been dexterous enough to do so. Tablets can also be just as expensive as some of the cheapest Windows laptops, and that’s without a mouse or keyboard. Chromebooks are a good alternative for those that basically live in a browser, the trade-off being you must give up the “traditional desktop.” And Chrome OS is a more limited operating system than Windows when it comes to the programs you can install and run. What Windows laptops do well What can you realistically accomplish on a cheap Windows laptop? Quite a bit, especially if you’re doing one thing (or a limited number of things) at a time. They’re great for everyday tasks like web browsing, checking email, video streaming and more. All of those things can be done on Chromebooks as well, but Windows laptops have a big advantage in Microsoft Office. While yes, there is a browser based version, the native, desktop apps are considered a must have for many and will run smoothly on even the most bare-bones budget laptop. The only caveat is that you may run into some slowdown on low-powered devices if you’re multitasking or working with large data sets in Excel or a lot of photos and graphics in Powerpoint. When it comes to specs, a bright spot for Windows laptops is storage. Even the most affordable devices tend to have at least a 128GB solid state drive. That will come in handy if you prefer to keep your most important files saved locally on your laptop's hard drive. In contrast, cheaper Chromebooks often have less storage because they’re built on the assumption that you’ll save all of your documents in the cloud. Not only is that less convenient when you need to work offline, but it also limits the size of programs and files that you can download. So, Chromebooks aren't the best for hoarding Netflix shows before a long trip or for use as a gaming laptop. Windows also has thousands of apps that you can download from its app store. Chromebooks have some Chrome apps, numerous browser extensions and the ability to download Android apps, but quality control is… inconsistent. Android apps, in particular, often haven’t been optimized for Chrome OS, which makes for a wonky user experience. Windows may not have as many apps as Android, but at least the experience is fairly standard across the board. Windows also gives you the ability to download and use programs from other sources, like direct from the developer. You can run things like Adobe Creative Suite, certain VPNs and programs like GIMP, Audacity and ClipMate on a Windows device, which just isn’t possible on Chrome OS. Chromebooks limit you to the apps and programs in The Play Store and the Chrome Extensions store, reducing any others to unusable, space-sucking icons in your Downloads folder.This article originally appeared on Engadget at https://www.engadget.com/computing/laptops/best-affordable-windows-laptops-123000512.html?src=rss",
          "feed_position": 0,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/843ff380-b255-11eb-bddf-b4000d3cf728"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html",
          "published_at": "Mon, 23 Feb 2026 08:00:38 +0000",
          "title": "The best earbuds for Android devices in 2026",
          "standfirst": "If you’re using an Android phone, finding the right pair of wireless earbuds can take a little more work than it does for iPhone owners. Apple’s AirPods are tightly woven into iOS, but that same level of seamless integration doesn’t automatically carry over to Android. The good news is there are plenty of earbuds that play just as nicely with Android devices, and in some cases offer features AirPods simply don’t.From earbuds designed to pair especially well with Samsung Galaxy and Google Pixel phones to models that prioritize strong noise cancellation, long battery life or workout-friendly durability, the Android ecosystem has no shortage of solid options. We’ve tested a wide range of wireless earbuds to find the best picks for Android users, whether you’re after premium sound, reliable everyday performance or a more affordable alternative. Best Android earbuds for 2026 What to look for in wireless earbuds for Android devices Photo by Jeff Dunn / Engadget For the most part, the features you want from a set of “Android earbuds” are the same as what you want from any headphones. Great sound quality, a comfortable fit and sufficient battery life are still the foundations. Adequate water resistance is good for workouts, and nobody wants a crummy mic for making calls. Once you approach the $100 range, features like active noise cancellation (ANC), wireless charging, an ambient sound mode (which lets you better hear outside noise without turning off your music) and multipoint connectivity (the ability to pair with multiple devices simultaneously) should be expected. For Android devices specifically, there are a few extras to consider. A dedicated app that makes it easy to switch sound modes, customize the audio profile, locate your earbuds if they ever get misplaced or adjust other settings is strongly preferred. Features like Google Fast Pair or NFC-based pairing, which can help you avoid having to dig through your Bluetooth menu to connect your earbuds for the first time, are also nice perks. Some Android devices can also utilize higher-quality Bluetooth codecs such as aptX Adaptive or Sony’s LDAC — these aren’t nearly as important to audio quality as the actual architecture of your earbuds, but they can help wring out a little more detail if the buds are capable enough and you’re streaming lossless files. AptX Adaptive can also help reduce latency, which is good for streaming video or gaming. Diversity is Android’s greatest strength, but it also means that some wireless earbuds play nicer with certain devices, typically those made by the same company. Recent Samsung earbuds, for instance, come with a few perks that are only available if you use a Galaxy phone. We have a couple of recommendations related to this idea above. How we test Android earbuds Photo by Billy Steele/Engadget The best way to test earphones is simply to wear them as much as possible, so that’s what we do. We typically do this over a one- to two-week period, though embargo times occasionally force us to finish our review process a bit faster. We listen to a test playlist that includes several musical genres and podcasts, paying close attention to how each pair approaches the bass, mid and treble frequencies to get an accurate sense of its sound profile. We also test at high and low volumes to check for consistency in the tuning. We do not have access to a dummy head to take more objective measurements, but we’ll sometimes look to sites like Rtings, SoundGuys and others that do just to ensure our impressions are not wildly off-base. If a model supports custom EQ, we’ll tinker with that and use the available EQ presets to see if one sounds dramatically better than the others — though in general we base most of our impressions on the stock tuning each pair uses by default. To assess microphone quality, we record our own audio samples and take multiple calls with a partner both indoors and outside. For battery life, we play our test playlist on a loop with the volume around 75 percent and measure how long it takes for each set to drain. Where applicable, we do a thorough review of a pair’s companion app and test each available feature. While comfort is ultimately subjective, we take note of how secure each pair feels while we’re on the move. We also use certain pairs in especially crowded public spaces to get a better sense of their passive and active noise cancellation, as well as their ability to maintain a consistent Bluetooth connection. Recent updates February 2026: Updated to include new top picks. November 2025: The lightly updated Beats Powerbeats Fit replace the older Beats Fit Pro as our top pick for working out. We’ve also noted the new Google Pixel Buds 2a as a cheaper alternative to the Pixel Buds Pro 2, which remain our recommendation for Pixel phone users. August 2025: We’ve taken another sweep to ensure our advice is still up-to-date. May 2025: We’ve checked this guide to ensure our top picks still stand and noted a couple alternatives to the Noble Fokus Rex5, since that pair has had stock issues of late. We’re also keeping an eye on how the Trump administration’s tariff policy affects the pricing and stock of our recommendations (and the consumer tech industry as a whole). All of our picks are still available in their normal price ranges today, but we’ll update this guide if that changes. February 2025: The Noble FoKus Rex5 is our new \"best for sound quality\" pick, replacing the Sennheiser Momentum True Wireless 4. Our other recommendations remain unchanged. December 2024: We’ve lightly edited this guide for clarity and ensured that our current picks are still accurate.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html?src=rss",
          "content": "If you’re using an Android phone, finding the right pair of wireless earbuds can take a little more work than it does for iPhone owners. Apple’s AirPods are tightly woven into iOS, but that same level of seamless integration doesn’t automatically carry over to Android. The good news is there are plenty of earbuds that play just as nicely with Android devices, and in some cases offer features AirPods simply don’t.From earbuds designed to pair especially well with Samsung Galaxy and Google Pixel phones to models that prioritize strong noise cancellation, long battery life or workout-friendly durability, the Android ecosystem has no shortage of solid options. We’ve tested a wide range of wireless earbuds to find the best picks for Android users, whether you’re after premium sound, reliable everyday performance or a more affordable alternative. Best Android earbuds for 2026 What to look for in wireless earbuds for Android devices Photo by Jeff Dunn / Engadget For the most part, the features you want from a set of “Android earbuds” are the same as what you want from any headphones. Great sound quality, a comfortable fit and sufficient battery life are still the foundations. Adequate water resistance is good for workouts, and nobody wants a crummy mic for making calls. Once you approach the $100 range, features like active noise cancellation (ANC), wireless charging, an ambient sound mode (which lets you better hear outside noise without turning off your music) and multipoint connectivity (the ability to pair with multiple devices simultaneously) should be expected. For Android devices specifically, there are a few extras to consider. A dedicated app that makes it easy to switch sound modes, customize the audio profile, locate your earbuds if they ever get misplaced or adjust other settings is strongly preferred. Features like Google Fast Pair or NFC-based pairing, which can help you avoid having to dig through your Bluetooth menu to connect your earbuds for the first time, are also nice perks. Some Android devices can also utilize higher-quality Bluetooth codecs such as aptX Adaptive or Sony’s LDAC — these aren’t nearly as important to audio quality as the actual architecture of your earbuds, but they can help wring out a little more detail if the buds are capable enough and you’re streaming lossless files. AptX Adaptive can also help reduce latency, which is good for streaming video or gaming. Diversity is Android’s greatest strength, but it also means that some wireless earbuds play nicer with certain devices, typically those made by the same company. Recent Samsung earbuds, for instance, come with a few perks that are only available if you use a Galaxy phone. We have a couple of recommendations related to this idea above. How we test Android earbuds Photo by Billy Steele/Engadget The best way to test earphones is simply to wear them as much as possible, so that’s what we do. We typically do this over a one- to two-week period, though embargo times occasionally force us to finish our review process a bit faster. We listen to a test playlist that includes several musical genres and podcasts, paying close attention to how each pair approaches the bass, mid and treble frequencies to get an accurate sense of its sound profile. We also test at high and low volumes to check for consistency in the tuning. We do not have access to a dummy head to take more objective measurements, but we’ll sometimes look to sites like Rtings, SoundGuys and others that do just to ensure our impressions are not wildly off-base. If a model supports custom EQ, we’ll tinker with that and use the available EQ presets to see if one sounds dramatically better than the others — though in general we base most of our impressions on the stock tuning each pair uses by default. To assess microphone quality, we record our own audio samples and take multiple calls with a partner both indoors and outside. For battery life, we play our test playlist on a loop with the volume around 75 percent and measure how long it takes for each set to drain. Where applicable, we do a thorough review of a pair’s companion app and test each available feature. While comfort is ultimately subjective, we take note of how secure each pair feels while we’re on the move. We also use certain pairs in especially crowded public spaces to get a better sense of their passive and active noise cancellation, as well as their ability to maintain a consistent Bluetooth connection. Recent updates February 2026: Updated to include new top picks. November 2025: The lightly updated Beats Powerbeats Fit replace the older Beats Fit Pro as our top pick for working out. We’ve also noted the new Google Pixel Buds 2a as a cheaper alternative to the Pixel Buds Pro 2, which remain our recommendation for Pixel phone users. August 2025: We’ve taken another sweep to ensure our advice is still up-to-date. May 2025: We’ve checked this guide to ensure our top picks still stand and noted a couple alternatives to the Noble Fokus Rex5, since that pair has had stock issues of late. We’re also keeping an eye on how the Trump administration’s tariff policy affects the pricing and stock of our recommendations (and the consumer tech industry as a whole). All of our picks are still available in their normal price ranges today, but we’ll update this guide if that changes. February 2025: The Noble FoKus Rex5 is our new \"best for sound quality\" pick, replacing the Sennheiser Momentum True Wireless 4. Our other recommendations remain unchanged. December 2024: We’ve lightly edited this guide for clarity and ensured that our current picks are still accurate.This article originally appeared on Engadget at https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html?src=rss",
          "feed_position": 1,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2023-06/f9e8ef90-0c55-11ee-97db-1ddd4c19f474"
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/orchestration/shadow-mode-drift-alerts-and-audit-logs-inside-the-modern-audit-loop",
          "published_at": "Sun, 22 Feb 2026 19:00:00 GMT",
          "title": "Shadow mode, drift alerts and audit logs: Inside the modern audit loop",
          "standfirst": "Traditional software governance often uses static compliance checklists, quarterly audits and after-the-fact reviews. But this method can&#x27;t keep up with AI systems that change in real time. A machine learning (ML) model might retrain or drift between quarterly operational syncs. This means that, by the time an issue is discovered, hundreds of bad decisions could already have been made. This can be almost impossible to untangle. In the fast-paced world of AI, governance must be inline, not an after-the-fact compliance review. In other words, organizations must adopt what I call an “audit loop\": A continuous, integrated compliance process that operates in real-time alongside AI development and deployment, without halting innovation. This article explains how to implement such continuous AI compliance through shadow mode rollouts, drift and misuse monitoring and audit logs engineered for direct legal defensibility.From reactive checks to an inline “audit loop”When systems moved at the speed of people, it made sense to do compliance checks every so often. But AI doesn&#x27;t wait for the next review meeting. The change to an inline audit loop means audits will no longer occur just once in a while; they happen all the time. Compliance and risk management should be \"baked in\" to the AI lifecycle from development to production, rather than just post-deployment. This means establishing live metrics and guardrails that monitor AI behavior as it occurs and raise red flags as soon as something seems off. For instance, teams can set up drift detectors that automatically alert when a model&#x27;s predictions go off course from the training distribution, or when confidence scores fall below acceptable levels. Governance is no longer just a set of quarterly snapshots; it&#x27;s a streaming process with alerts that go off in real time when a system goes outside of its defined confidence bands.Cultural shift is equally important: Compliance teams must act less like after-the-fact auditors and more like AI co-pilots. In practice, this might mean compliance and AI engineers working together to define policy guardrails and continuously monitor key indicators. With the right tools and mindset, real-time AI governance can “nudge” and intervene early, helping teams course-correct without slowing down innovation. In fact, when done well, continuous governance builds trust rather than friction, providing shared visibility into AI operations for both builders and regulators, instead of unpleasant surprises after deployment. The following strategies illustrate how to achieve this balance.Shadow mode rollouts: Testing compliance safelyOne effective framework for continuous AI compliance is “shadow mode” deployments with new models or agent features. This means a new AI system is deployed in parallel with the existing system, receiving real production inputs but not influencing real decisions or user-facing outputs. The legacy model or process continues to handle decisions, while the new AI’s outputs are captured only for analysis. This provides a safe sandbox to vet the AI’s behavior under real conditions. According to global law firm Morgan Lewis: “Shadow-mode operation requires the AI to run in parallel without influencing live decisions until its performance is validated,” giving organizations a safe environment to test changes. Teams can discover problems early by comparing the shadow model&#x27;s decisions to expectations (the current model&#x27;s decisions). For instance, when a model is running in shadow mode, they can check to see if its inputs and predictions differ from those of the current production model or the patterns seen in training. Sudden changes could indicate bugs in the data pipeline, unexpected bias or drops in performance. In short, shadow mode is a way to check compliance in real time: It ensures that the model handles inputs correctly and meets policy standards (accuracy, fairness) before it is fully released. One AI security framework showed how this method worked: Teams first ran AI in shadow mode (AI makes suggestions but doesn&#x27;t act on its own), then compared AI and human inputs to determine trust. They only let the AI suggest actions with human approval after it was reliable. For instance, Prophet Security eventually let the AI make low-risk decisions on its own. Using phased rollouts gives people confidence that an AI system meets requirements and works as expected, without putting production or customers at risk during testing. Real-time drift and misuse detectionEven after an AI model is fully deployed, the compliance job is never \"done.\" Over time, AI systems can drift, meaning that their performance or outputs change due to new data patterns, model retraining or bad inputs. They can also be misused or lead to results that go against policy (for example, inappropriate content or biased decisions) in unexpected ways. To remain compliant, teams must set up monitoring signals and processes to catch these issues as they happen. In SLA monitoring, they may only check for uptime or latency. In AI monitoring, however, the system must be able to tell when outputs are not what they should be. For example, if a model suddenly starts giving biased or harmful results. This means setting \"confidence bands\" or quantitative limits for how a model should behave and setting automatic alerts when those limits are crossed.Some signals to monitor include:Data or concept drift: When input data distributions change significantly or model predictions diverge from training-time patterns. For example, a model’s accuracy on certain segments might drop as the incoming data shifts, a sign to investigate and possibly retrain.Anomalous or harmful outputs: When outputs trigger policy violations or ethical red flags. An AI content filter might flag if a generative model produces disallowed content, or a bias monitor might detect if decisions for a protected group begin to skew negatively. Contracts for AI services now often require vendors to detect and address such noncompliant results promptly.User misuse patterns: When unusual usage behavior suggests someone is trying to manipulate or misuse the AI. For instance, rapid-fire queries attempting prompt injection or adversarial inputs could be automatically flagged by the system’s telemetry as potential misuse.When a drift or misuse signal crosses a critical threshold, the system should support “intelligent escalation” rather than waiting for a quarterly review. In practice, this could mean triggering an automated mitigation or immediately alerting a human overseer. Leading organizations build in fail-safes like kill-switches, or the ability to suspend an AI’s actions the moment it behaves unpredictably or unsafely. For example, a service contract might allow a company to instantly pause an AI agent if it’s outputting suspect results, even if the AI provider hasn’t acknowledged a problem. Likewise, teams should have playbooks for rapid model rollback or retraining windows: If drift or errors are detected, there’s a plan to retrain the model (or revert to a safe state) within a defined timeframe. This kind of agile response is crucial; it recognizes that AI behavior may drift or degrade in ways that cannot be fixed with a simple patch, so swift retraining or tuning is part of the compliance loop.By continuously monitoring and reacting to drift and misuse signals, companies transform compliance from a periodic audit to an ongoing safety net. Issues are caught and addressed in hours or days, not months. The AI stays within acceptable bounds, and governance keeps pace with the AI’s own learning and adaptation, rather than trailing behind it. This not only protects users and stakeholders; it gives regulators and executives peace of mind that the AI is under constant watchful oversight, even as it evolves.Audit logs designed for legal defensibilityContinuous compliance also means continuously documenting what your AI is doing and why. Robust audit logs demonstrate compliance, both for internal accountability and external legal defensibility. However, logging for AI requires more than simplistic logs. Imagine an auditor or regulator asking: “Why did the AI make this decision, and did it follow approved policy?” Your logs should be able to answer that.A good AI audit log keeps a permanent, detailed record of every important action and decision AI makes, along with the reasons and context. Legal experts say these logs \"provide detailed, unchangeable records of AI system actions with exact timestamps and written reasons for decisions.\" They are important evidence in court. This means that every important inference, suggestion or independent action taken by AI should be recorded with metadata, such as timestamps, the model/version used, the input received, the output produced and (if possible) the reasoning or confidence behind that output. Modern compliance platforms stress logging not only the result (\"X action taken\") but also the rationale (\"X action taken because conditions Y and Z were met according to policy\"). These enhanced logs let an auditor see, for example, not just that an AI approved a user&#x27;s access, but that it was approved \"based on continuous usage and alignment with the user&#x27;s peer group,\" according to Attorney Aaron Hall.Audit logs should also be well-organized and difficult to change if they are to be legally sound. Techniques like immutable storage or cryptographic hashing of logs ensure that records can&#x27;t be changed. Log data should be protected by access controls and encryption so that sensitive information, such as security keys and personal data, is hidden or protected while still being open. In regulated industries, keeping these logs can show examiners that you are not only keeping track of AI&#x27;s outputs, but you are retaining records for review. Regulators are expecting companies to show more than that an AI was checked before it was released. They want to see that it is being monitored continuously and there is a forensic trail to analyze its behavior over time. This evidentiary backbone comes from complete audit trails that include data inputs, model versions and decision outputs. They make AI less of a \"black box\" and more of a system that can be tracked and held accountable.If there is a disagreement or an event (for example, an AI made a biased choice that hurt a customer), these logs are your legal lifeline. They help you figure out what went wrong. Was it a problem with the data, a model drift or misuse? Who was in charge of the process? Did we stick to the rules we set? Well-kept AI audit logs show that the company did its homework and had controls in place. This not only lowers the risk of legal problems but makes people more trusting of AI systems. With AI, teams and executives can be sure that every decision made is safe because it is open and accountable.Inline governance as an enabler, not a roadblockImplementing an “audit loop” of continuous AI compliance might sound like extra work, but in reality, it enables faster and safer AI delivery. By integrating governance into each stage of the AI lifecycle, from shadow mode trial runs to real-time monitoring to immutable logging, organizations can move quickly and responsibly. Issues are caught early, so they don’t snowball into major failures that require project-halting fixes later. Developers and data scientists can iterate on models without endless back-and-forth with compliance reviewers, because many compliance checks are automated and happen in parallel. Rather than slowing down delivery, this approach often accelerates it: Teams spend less time on reactive damage control or lengthy audits, and more time on innovation because they are confident that compliance is under control in the background.There are bigger benefits to continuous AI compliance, too. It gives end-users, business leaders and regulators a reason to believe that AI systems are being handled responsibly. When every AI decision is clearly recorded, watched and checked for quality, stakeholders are much more likely to accept AI solutions. This trust benefits the whole industry and society, not just individual businesses. An audit-loop governance model can stop AI failures and ensure AI behavior is in line with moral and legal standards. In fact, strong AI governance benefits the economy and the public because it encourages innovation and protection. It can unlock AI&#x27;s potential in important areas like finance, healthcare and infrastructure without putting safety or values at risk. As national and international standards for AI change quickly, U.S. companies that set a good example by always following the rules are at the forefront of trustworthy AI.People say that if your AI governance isn&#x27;t keeping up with your AI, it&#x27;s not really governance; it&#x27;s \"archaeology.\" Forward-thinking companies are realizing this and adopting audit loops. By doing so, they not only avoid problems but make compliance a competitive advantage, ensuring that faster delivery and better oversight go hand in hand.Dhyey Mavani is working to accelerate gen AI and computational mathematics. Editor&#x27;s note: The opinions expressed in this article are the authors&#x27; personal opinions and do not reflect the opinions of their employers.",
          "content": "Traditional software governance often uses static compliance checklists, quarterly audits and after-the-fact reviews. But this method can&#x27;t keep up with AI systems that change in real time. A machine learning (ML) model might retrain or drift between quarterly operational syncs. This means that, by the time an issue is discovered, hundreds of bad decisions could already have been made. This can be almost impossible to untangle. In the fast-paced world of AI, governance must be inline, not an after-the-fact compliance review. In other words, organizations must adopt what I call an “audit loop\": A continuous, integrated compliance process that operates in real-time alongside AI development and deployment, without halting innovation. This article explains how to implement such continuous AI compliance through shadow mode rollouts, drift and misuse monitoring and audit logs engineered for direct legal defensibility.From reactive checks to an inline “audit loop”When systems moved at the speed of people, it made sense to do compliance checks every so often. But AI doesn&#x27;t wait for the next review meeting. The change to an inline audit loop means audits will no longer occur just once in a while; they happen all the time. Compliance and risk management should be \"baked in\" to the AI lifecycle from development to production, rather than just post-deployment. This means establishing live metrics and guardrails that monitor AI behavior as it occurs and raise red flags as soon as something seems off. For instance, teams can set up drift detectors that automatically alert when a model&#x27;s predictions go off course from the training distribution, or when confidence scores fall below acceptable levels. Governance is no longer just a set of quarterly snapshots; it&#x27;s a streaming process with alerts that go off in real time when a system goes outside of its defined confidence bands.Cultural shift is equally important: Compliance teams must act less like after-the-fact auditors and more like AI co-pilots. In practice, this might mean compliance and AI engineers working together to define policy guardrails and continuously monitor key indicators. With the right tools and mindset, real-time AI governance can “nudge” and intervene early, helping teams course-correct without slowing down innovation. In fact, when done well, continuous governance builds trust rather than friction, providing shared visibility into AI operations for both builders and regulators, instead of unpleasant surprises after deployment. The following strategies illustrate how to achieve this balance.Shadow mode rollouts: Testing compliance safelyOne effective framework for continuous AI compliance is “shadow mode” deployments with new models or agent features. This means a new AI system is deployed in parallel with the existing system, receiving real production inputs but not influencing real decisions or user-facing outputs. The legacy model or process continues to handle decisions, while the new AI’s outputs are captured only for analysis. This provides a safe sandbox to vet the AI’s behavior under real conditions. According to global law firm Morgan Lewis: “Shadow-mode operation requires the AI to run in parallel without influencing live decisions until its performance is validated,” giving organizations a safe environment to test changes. Teams can discover problems early by comparing the shadow model&#x27;s decisions to expectations (the current model&#x27;s decisions). For instance, when a model is running in shadow mode, they can check to see if its inputs and predictions differ from those of the current production model or the patterns seen in training. Sudden changes could indicate bugs in the data pipeline, unexpected bias or drops in performance. In short, shadow mode is a way to check compliance in real time: It ensures that the model handles inputs correctly and meets policy standards (accuracy, fairness) before it is fully released. One AI security framework showed how this method worked: Teams first ran AI in shadow mode (AI makes suggestions but doesn&#x27;t act on its own), then compared AI and human inputs to determine trust. They only let the AI suggest actions with human approval after it was reliable. For instance, Prophet Security eventually let the AI make low-risk decisions on its own. Using phased rollouts gives people confidence that an AI system meets requirements and works as expected, without putting production or customers at risk during testing. Real-time drift and misuse detectionEven after an AI model is fully deployed, the compliance job is never \"done.\" Over time, AI systems can drift, meaning that their performance or outputs change due to new data patterns, model retraining or bad inputs. They can also be misused or lead to results that go against policy (for example, inappropriate content or biased decisions) in unexpected ways. To remain compliant, teams must set up monitoring signals and processes to catch these issues as they happen. In SLA monitoring, they may only check for uptime or latency. In AI monitoring, however, the system must be able to tell when outputs are not what they should be. For example, if a model suddenly starts giving biased or harmful results. This means setting \"confidence bands\" or quantitative limits for how a model should behave and setting automatic alerts when those limits are crossed.Some signals to monitor include:Data or concept drift: When input data distributions change significantly or model predictions diverge from training-time patterns. For example, a model’s accuracy on certain segments might drop as the incoming data shifts, a sign to investigate and possibly retrain.Anomalous or harmful outputs: When outputs trigger policy violations or ethical red flags. An AI content filter might flag if a generative model produces disallowed content, or a bias monitor might detect if decisions for a protected group begin to skew negatively. Contracts for AI services now often require vendors to detect and address such noncompliant results promptly.User misuse patterns: When unusual usage behavior suggests someone is trying to manipulate or misuse the AI. For instance, rapid-fire queries attempting prompt injection or adversarial inputs could be automatically flagged by the system’s telemetry as potential misuse.When a drift or misuse signal crosses a critical threshold, the system should support “intelligent escalation” rather than waiting for a quarterly review. In practice, this could mean triggering an automated mitigation or immediately alerting a human overseer. Leading organizations build in fail-safes like kill-switches, or the ability to suspend an AI’s actions the moment it behaves unpredictably or unsafely. For example, a service contract might allow a company to instantly pause an AI agent if it’s outputting suspect results, even if the AI provider hasn’t acknowledged a problem. Likewise, teams should have playbooks for rapid model rollback or retraining windows: If drift or errors are detected, there’s a plan to retrain the model (or revert to a safe state) within a defined timeframe. This kind of agile response is crucial; it recognizes that AI behavior may drift or degrade in ways that cannot be fixed with a simple patch, so swift retraining or tuning is part of the compliance loop.By continuously monitoring and reacting to drift and misuse signals, companies transform compliance from a periodic audit to an ongoing safety net. Issues are caught and addressed in hours or days, not months. The AI stays within acceptable bounds, and governance keeps pace with the AI’s own learning and adaptation, rather than trailing behind it. This not only protects users and stakeholders; it gives regulators and executives peace of mind that the AI is under constant watchful oversight, even as it evolves.Audit logs designed for legal defensibilityContinuous compliance also means continuously documenting what your AI is doing and why. Robust audit logs demonstrate compliance, both for internal accountability and external legal defensibility. However, logging for AI requires more than simplistic logs. Imagine an auditor or regulator asking: “Why did the AI make this decision, and did it follow approved policy?” Your logs should be able to answer that.A good AI audit log keeps a permanent, detailed record of every important action and decision AI makes, along with the reasons and context. Legal experts say these logs \"provide detailed, unchangeable records of AI system actions with exact timestamps and written reasons for decisions.\" They are important evidence in court. This means that every important inference, suggestion or independent action taken by AI should be recorded with metadata, such as timestamps, the model/version used, the input received, the output produced and (if possible) the reasoning or confidence behind that output. Modern compliance platforms stress logging not only the result (\"X action taken\") but also the rationale (\"X action taken because conditions Y and Z were met according to policy\"). These enhanced logs let an auditor see, for example, not just that an AI approved a user&#x27;s access, but that it was approved \"based on continuous usage and alignment with the user&#x27;s peer group,\" according to Attorney Aaron Hall.Audit logs should also be well-organized and difficult to change if they are to be legally sound. Techniques like immutable storage or cryptographic hashing of logs ensure that records can&#x27;t be changed. Log data should be protected by access controls and encryption so that sensitive information, such as security keys and personal data, is hidden or protected while still being open. In regulated industries, keeping these logs can show examiners that you are not only keeping track of AI&#x27;s outputs, but you are retaining records for review. Regulators are expecting companies to show more than that an AI was checked before it was released. They want to see that it is being monitored continuously and there is a forensic trail to analyze its behavior over time. This evidentiary backbone comes from complete audit trails that include data inputs, model versions and decision outputs. They make AI less of a \"black box\" and more of a system that can be tracked and held accountable.If there is a disagreement or an event (for example, an AI made a biased choice that hurt a customer), these logs are your legal lifeline. They help you figure out what went wrong. Was it a problem with the data, a model drift or misuse? Who was in charge of the process? Did we stick to the rules we set? Well-kept AI audit logs show that the company did its homework and had controls in place. This not only lowers the risk of legal problems but makes people more trusting of AI systems. With AI, teams and executives can be sure that every decision made is safe because it is open and accountable.Inline governance as an enabler, not a roadblockImplementing an “audit loop” of continuous AI compliance might sound like extra work, but in reality, it enables faster and safer AI delivery. By integrating governance into each stage of the AI lifecycle, from shadow mode trial runs to real-time monitoring to immutable logging, organizations can move quickly and responsibly. Issues are caught early, so they don’t snowball into major failures that require project-halting fixes later. Developers and data scientists can iterate on models without endless back-and-forth with compliance reviewers, because many compliance checks are automated and happen in parallel. Rather than slowing down delivery, this approach often accelerates it: Teams spend less time on reactive damage control or lengthy audits, and more time on innovation because they are confident that compliance is under control in the background.There are bigger benefits to continuous AI compliance, too. It gives end-users, business leaders and regulators a reason to believe that AI systems are being handled responsibly. When every AI decision is clearly recorded, watched and checked for quality, stakeholders are much more likely to accept AI solutions. This trust benefits the whole industry and society, not just individual businesses. An audit-loop governance model can stop AI failures and ensure AI behavior is in line with moral and legal standards. In fact, strong AI governance benefits the economy and the public because it encourages innovation and protection. It can unlock AI&#x27;s potential in important areas like finance, healthcare and infrastructure without putting safety or values at risk. As national and international standards for AI change quickly, U.S. companies that set a good example by always following the rules are at the forefront of trustworthy AI.People say that if your AI governance isn&#x27;t keeping up with your AI, it&#x27;s not really governance; it&#x27;s \"archaeology.\" Forward-thinking companies are realizing this and adopting audit loops. By doing so, they not only avoid problems but make compliance a competitive advantage, ensuring that faster delivery and better oversight go hand in hand.Dhyey Mavani is working to accelerate gen AI and computational mathematics. Editor&#x27;s note: The opinions expressed in this article are the authors&#x27; personal opinions and do not reflect the opinions of their employers.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/2lIgm3tWKNlbNcAqMNsFXB/d06b37a9da80c563b72a3c9311f38031/Audit_loop.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/how-to-send-a-message-via-satellite-on-iphone-130000418.html",
          "published_at": "Sun, 22 Feb 2026 13:00:00 +0000",
          "title": "How to send a message via satellite on iPhone",
          "standfirst": "Apple’s satellite features were originally designed for emergencies, allowing iPhone users to contact emergency services when cellular and Wi-Fi coverage is unavailable. With recent versions of iOS, Apple has expanded those capabilities to include sending and receiving messages via satellite. This makes it possible to stay in touch with friends and family from remote locations where traditional networks do not reach, such as hiking trails, rural areas or offshore locations.Messaging via satellite is built directly into the iPhone and works automatically when no cellular or Wi-Fi signal is available. While it is not intended to replace regular messaging, it can be a useful backup when coverage drops.How to send a message via satelliteBefore you can get started, you’ll need to turn on iMessage before you’re off the grid. It’s also important to set up an emergency contact as well as members of your Family Sharing group prior to your departure. This will enable them to message you via SMS without the need to message them first. To send a message via satellite, open the Messages app when no cellular or Wi-Fi signal is available. If the feature is supported in the current location, the app will display a prompt indicating that satellite messaging is available.Selecting the option to connect via satellite launches a guided connection screen. Your iPhone will provide real-time instructions to help maintain alignment with the satellite. Once connected, a text message can be typed and sent, although delivery may take longer than usual.The iPhone will notify you when the message has been sent successfully. Replies from the recipient will also be delivered via satellite, as long as the connection remains active.What you need before you can send satellite messagesSending messages via satellite requires a compatible iPhone model and the correct software version. The feature is supported on iPhone models with satellite hardware, beginning with iPhone 14 and later. The device must be running a version of iOS (iOS 18 or higher) that supports satellite messaging, which Apple has continued to refine through recent iOS updates.The feature also depends on location and availability. Satellite messaging is currently supported in select regions, including the United States and parts of Canada, with expanded support rolling out gradually. The iPhone must be outdoors with a clear view of the sky, as trees, buildings and terrain can interfere with the satellite connection.Satellite messaging is not designed for continuous conversations. Messages are compressed and sent at a slower pace than standard texts, and delivery times can vary depending on conditions and satellite positioning.How satellite messaging works on iPhoneWhen an iPhone loses access to cellular and Wi-Fi networks, the system automatically detects that only satellite connectivity is available. Instead of failing to send, the Messages app prompts the user to connect to a satellite.On-screen instructions guide the user to position the phone correctly. This typically involves holding the device up and following directional prompts to align it with an overhead satellite. The phone uses built-in sensors to help maintain the connection while the message is being sent.Messages sent via satellite are text-only and use a reduced data format to ensure they can be transmitted reliably. Images, videos, audio messages and large attachments are not supported.Who can receive satellite messages?Satellite messages can be sent to contacts using iMessage or standard SMS, depending on the recipient’s device and settings. If the recipient is using an Apple device with iMessage enabled, the message will be delivered through Apple’s messaging system. If not, the message will be sent as a standard text.Recipients do not need a satellite-capable device to receive messages. From their perspective, the message appears similar to a regular text, though delivery times may be longer.Tips for getting a reliable connectionA clear view of the sky is essential for satellite messaging to work properly. Open areas with minimal obstructions offer the best results. Movement, heavy foliage and nearby structures can interrupt the connection.Because satellite bandwidth is limited, keeping messages short improves reliability and delivery speed. The iPhone may prompt the user to edit longer messages to fit within satellite constraints.Battery life is also a consideration. Maintaining a satellite connection uses more power than standard messaging, so it helps to conserve battery when relying on satellite features for extended periods.Limitations to keep in mindSatellite messaging is designed for occasional use when other networks are unavailable. It does not support group messages, media attachments or read receipts in the same way as standard messaging.Delivery times can range from under a minute to several minutes, depending on environmental conditions and satellite availability. The feature should not be relied upon for time-sensitive communication unless no other option is available.Apple has also noted that satellite features may be offered free for a limited period, with potential pricing or subscription requirements introduced in the future depending on region and carrier arrangements.When satellite messaging can be usefulMessaging via satellite can be helpful for travelers, hikers and anyone spending time in remote areas where coverage is unreliable. It offers a way to check in, share basic updates or request non-emergency assistance when traditional networks are unavailable.While it is not a replacement for emergency services, it complements Apple’s existing emergency satellite features by providing an additional communication option when users are off the grid.As Apple continues to expand satellite support, messaging via satellite is likely to become a more familiar part of the iPhone experience, particularly for users who regularly venture beyond the reach of cellular networks.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-send-a-message-via-satellite-on-iphone-130000418.html?src=rss",
          "content": "Apple’s satellite features were originally designed for emergencies, allowing iPhone users to contact emergency services when cellular and Wi-Fi coverage is unavailable. With recent versions of iOS, Apple has expanded those capabilities to include sending and receiving messages via satellite. This makes it possible to stay in touch with friends and family from remote locations where traditional networks do not reach, such as hiking trails, rural areas or offshore locations.Messaging via satellite is built directly into the iPhone and works automatically when no cellular or Wi-Fi signal is available. While it is not intended to replace regular messaging, it can be a useful backup when coverage drops.How to send a message via satelliteBefore you can get started, you’ll need to turn on iMessage before you’re off the grid. It’s also important to set up an emergency contact as well as members of your Family Sharing group prior to your departure. This will enable them to message you via SMS without the need to message them first. To send a message via satellite, open the Messages app when no cellular or Wi-Fi signal is available. If the feature is supported in the current location, the app will display a prompt indicating that satellite messaging is available.Selecting the option to connect via satellite launches a guided connection screen. Your iPhone will provide real-time instructions to help maintain alignment with the satellite. Once connected, a text message can be typed and sent, although delivery may take longer than usual.The iPhone will notify you when the message has been sent successfully. Replies from the recipient will also be delivered via satellite, as long as the connection remains active.What you need before you can send satellite messagesSending messages via satellite requires a compatible iPhone model and the correct software version. The feature is supported on iPhone models with satellite hardware, beginning with iPhone 14 and later. The device must be running a version of iOS (iOS 18 or higher) that supports satellite messaging, which Apple has continued to refine through recent iOS updates.The feature also depends on location and availability. Satellite messaging is currently supported in select regions, including the United States and parts of Canada, with expanded support rolling out gradually. The iPhone must be outdoors with a clear view of the sky, as trees, buildings and terrain can interfere with the satellite connection.Satellite messaging is not designed for continuous conversations. Messages are compressed and sent at a slower pace than standard texts, and delivery times can vary depending on conditions and satellite positioning.How satellite messaging works on iPhoneWhen an iPhone loses access to cellular and Wi-Fi networks, the system automatically detects that only satellite connectivity is available. Instead of failing to send, the Messages app prompts the user to connect to a satellite.On-screen instructions guide the user to position the phone correctly. This typically involves holding the device up and following directional prompts to align it with an overhead satellite. The phone uses built-in sensors to help maintain the connection while the message is being sent.Messages sent via satellite are text-only and use a reduced data format to ensure they can be transmitted reliably. Images, videos, audio messages and large attachments are not supported.Who can receive satellite messages?Satellite messages can be sent to contacts using iMessage or standard SMS, depending on the recipient’s device and settings. If the recipient is using an Apple device with iMessage enabled, the message will be delivered through Apple’s messaging system. If not, the message will be sent as a standard text.Recipients do not need a satellite-capable device to receive messages. From their perspective, the message appears similar to a regular text, though delivery times may be longer.Tips for getting a reliable connectionA clear view of the sky is essential for satellite messaging to work properly. Open areas with minimal obstructions offer the best results. Movement, heavy foliage and nearby structures can interrupt the connection.Because satellite bandwidth is limited, keeping messages short improves reliability and delivery speed. The iPhone may prompt the user to edit longer messages to fit within satellite constraints.Battery life is also a consideration. Maintaining a satellite connection uses more power than standard messaging, so it helps to conserve battery when relying on satellite features for extended periods.Limitations to keep in mindSatellite messaging is designed for occasional use when other networks are unavailable. It does not support group messages, media attachments or read receipts in the same way as standard messaging.Delivery times can range from under a minute to several minutes, depending on environmental conditions and satellite availability. The feature should not be relied upon for time-sensitive communication unless no other option is available.Apple has also noted that satellite features may be offered free for a limited period, with potential pricing or subscription requirements introduced in the future depending on region and carrier arrangements.When satellite messaging can be usefulMessaging via satellite can be helpful for travelers, hikers and anyone spending time in remote areas where coverage is unreliable. It offers a way to check in, share basic updates or request non-emergency assistance when traditional networks are unavailable.While it is not a replacement for emergency services, it complements Apple’s existing emergency satellite features by providing an additional communication option when users are off the grid.As Apple continues to expand satellite support, messaging via satellite is likely to become a more familiar part of the iPhone experience, particularly for users who regularly venture beyond the reach of cellular networks.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-send-a-message-via-satellite-on-iphone-130000418.html?src=rss",
          "feed_position": 8
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/ai/13-hour-aws-outage-reportedly-caused-by-amazons-own-ai-tools-170930190.html",
          "published_at": "Sat, 21 Feb 2026 16:58:50 +0000",
          "title": "13-hour AWS outage reportedly caused by Amazon's own AI tools",
          "standfirst": "A recent Amazon Web Services (AWS) outage that lasted 13 hours was reportedly caused by one of its own AI tools, according to reporting by Financial Times. This happened in December after engineers deployed the Kiro AI coding tool to make certain changes, say four people familiar with the matter. Kiro is an agentic tool, meaning it can take autonomous actions on behalf of users. In this case, the bot reportedly determined that it needed to \"delete and recreate the environment.\" This is what allegedly led to the lengthy outage that primarily impacted China. Amazon says it was merely a \"coincidence that AI tools were involved\" and that \"the same issue could occur with any developer tool or manual action.\" The company blamed the outage on \"user error, not AI error.\" It said that by default the Kiro tool “requests authorization before taking any action” but that the staffer involved in the December incident had \"broader permissions than expected — a user access control issue, not an AI autonomy issue.\" Multiple Amazon employees spoke to Financial Times and noted that this was \"at least\" the second occasion in recent months in which the company's AI tools were at the center of a service disruption. \"The outages were small but entirely foreseeable,\" said one senior AWS employee. A builder shares why their workflow finally clicked.Instead of jumping straight to code, the IDE pushed them to start with specs.✔️ Clear requirements.✔️ Acceptance criteria.✔️ Traceable tasks.Their takeaway:Think first. Code later.Get the full breakdown here 👉… pic.twitter.com/eD7ZrEdEn5— Kiro (@kirodotdev) January 14, 2026 The company launched Kiro in July and has since pushed employees into using the tool. Leadership set an 80 percent weekly use goal and has been closely tracking adoption rates. Amazon also sells access to the agentic tool for a monthly subscription fee. These recent outages follow a more serious event from October, in which a 15-hour AWS outage disrupted services like Alexa, Snapchat, Fortnite and Venmo, among others. The company blamed a bug in its automation software for that one. However, Amazon disagrees with the characterization of certain products and services being unavailable as an outage. In response to the Financial Times report, the company shared the following statement, which it also published on its news blog: We want to address the inaccuracies in the Financial Times' reporting yesterday. The brief service interruption they reported on was the result of user error—specifically misconfigured access controls—not AI as the story claims. The disruption was an extremely limited event last December affecting a single service (AWS Cost Explorer—which helps customers visualize, understand, and manage AWS costs and usage over time) in one of our 39 Geographic Regions around the world. It did not impact compute, storage, database, AI technologies, or any other of the hundreds of services that we run. The issue stemmed from a misconfigured role—the same issue that could occur with any developer tool (AI powered or not) or manual action. We did not receive any customer inquiries regarding the interruption. We implemented numerous safeguards to prevent this from happening again—not because the event had a big impact (it didn't), but because we insist on learning from our operational experience to improve our security and resilience. Additional safeguards include mandatory peer review for production access. While operational incidents involving misconfigured access controls can occur with any developer tool—AI-powered or not—we think it is important to learn from these experiences. The Financial Times' claim that a second event impacted AWS is entirely false. For more than two decades, Amazon has achieved high operational excellence with our Correction of Error (COE) process. We review these together so that we can learn from any incident, irrespective of customer impact, to address issues before their potential impact grows larger. Update, February 21 2026, 11:58AM ET: This story has been updated to include Amazon's full statement in response to the Financial Times report. This article originally appeared on Engadget at https://www.engadget.com/ai/13-hour-aws-outage-reportedly-caused-by-amazons-own-ai-tools-170930190.html?src=rss",
          "content": "A recent Amazon Web Services (AWS) outage that lasted 13 hours was reportedly caused by one of its own AI tools, according to reporting by Financial Times. This happened in December after engineers deployed the Kiro AI coding tool to make certain changes, say four people familiar with the matter. Kiro is an agentic tool, meaning it can take autonomous actions on behalf of users. In this case, the bot reportedly determined that it needed to \"delete and recreate the environment.\" This is what allegedly led to the lengthy outage that primarily impacted China. Amazon says it was merely a \"coincidence that AI tools were involved\" and that \"the same issue could occur with any developer tool or manual action.\" The company blamed the outage on \"user error, not AI error.\" It said that by default the Kiro tool “requests authorization before taking any action” but that the staffer involved in the December incident had \"broader permissions than expected — a user access control issue, not an AI autonomy issue.\" Multiple Amazon employees spoke to Financial Times and noted that this was \"at least\" the second occasion in recent months in which the company's AI tools were at the center of a service disruption. \"The outages were small but entirely foreseeable,\" said one senior AWS employee. A builder shares why their workflow finally clicked.Instead of jumping straight to code, the IDE pushed them to start with specs.✔️ Clear requirements.✔️ Acceptance criteria.✔️ Traceable tasks.Their takeaway:Think first. Code later.Get the full breakdown here 👉… pic.twitter.com/eD7ZrEdEn5— Kiro (@kirodotdev) January 14, 2026 The company launched Kiro in July and has since pushed employees into using the tool. Leadership set an 80 percent weekly use goal and has been closely tracking adoption rates. Amazon also sells access to the agentic tool for a monthly subscription fee. These recent outages follow a more serious event from October, in which a 15-hour AWS outage disrupted services like Alexa, Snapchat, Fortnite and Venmo, among others. The company blamed a bug in its automation software for that one. However, Amazon disagrees with the characterization of certain products and services being unavailable as an outage. In response to the Financial Times report, the company shared the following statement, which it also published on its news blog: We want to address the inaccuracies in the Financial Times' reporting yesterday. The brief service interruption they reported on was the result of user error—specifically misconfigured access controls—not AI as the story claims. The disruption was an extremely limited event last December affecting a single service (AWS Cost Explorer—which helps customers visualize, understand, and manage AWS costs and usage over time) in one of our 39 Geographic Regions around the world. It did not impact compute, storage, database, AI technologies, or any other of the hundreds of services that we run. The issue stemmed from a misconfigured role—the same issue that could occur with any developer tool (AI powered or not) or manual action. We did not receive any customer inquiries regarding the interruption. We implemented numerous safeguards to prevent this from happening again—not because the event had a big impact (it didn't), but because we insist on learning from our operational experience to improve our security and resilience. Additional safeguards include mandatory peer review for production access. While operational incidents involving misconfigured access controls can occur with any developer tool—AI-powered or not—we think it is important to learn from these experiences. The Financial Times' claim that a second event impacted AWS is entirely false. For more than two decades, Amazon has achieved high operational excellence with our Correction of Error (COE) process. We review these together so that we can learn from any incident, irrespective of customer impact, to address issues before their potential impact grows larger. Update, February 21 2026, 11:58AM ET: This story has been updated to include Amazon's full statement in response to the Financial Times report. This article originally appeared on Engadget at https://www.engadget.com/ai/13-hour-aws-outage-reportedly-caused-by-amazons-own-ai-tools-170930190.html?src=rss",
          "feed_position": 12
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/computing/accessories/how-to-know-if-an-airtag-is-tracking-you-130000764.html",
          "published_at": "Sat, 21 Feb 2026 13:00:00 +0000",
          "title": "How to know if an AirTag is tracking you",
          "standfirst": "Apple’s AirTag is designed to help people keep track of personal belongings like keys, bags and luggage. But because AirTags and other Bluetooth trackers are small and discreet, concerns about unwanted tracking are understandable. Apple has spent years building safeguards into the AirTag and the Find My network to reduce the risk of misuse and to alert people if a tracker they don’t own appears to be moving with them.If you’re worried about whether an AirTag or similar tracker might be following you, here’s how Apple’s unwanted tracking alerts work, what notifications to look for and what you can do on both iPhone and Android.How AirTag tracking alerts workAirTags, compatible Find My network accessories and certain AirPods models use Apple’s Find My network, which relies on Bluetooth signals and nearby devices to update their location. To prevent misuse, Apple designed these products with features that are meant to alert someone if a tracker that isn’t linked to their Apple Account appears to be traveling with them.If an AirTag or another compatible tracker is separated from its owner and detected near you over time, your device may display a notification or the tracker itself may emit a sound. These alerts are intended to discourage someone from secretly tracking another person without their knowledge. Apple has also worked with Google on a cross-platform industry standard, so alerts can appear on both iOS and Android devices, not just iPhones.How to make sure tracking alerts are enabled on your iPhoneIf you use an iPhone or iPad, tracking notifications are on by default, but it’s worth confirming your settings.To receive unwanted tracking alerts, make sure that:Your device is running iOS 17.5 or later (or iPadOS 17.5 or later). Earlier versions back to iOS 14.5 support basic AirTag alerts, but newer versions add broader compatibility with other trackers.Bluetooth is turned on.Location Services are enabled.Notifications for Tracking Alerts are allowed.Airplane Mode is turned off.You can check these by opening Settings, then navigating to Privacy & Security, Location Services and Notifications. Apple also recommends turning on Significant Locations in the System Services menu, which helps your device determine when an unknown tracker has traveled with you to places like your home.Go to Settings, tap Privacy & Security, then select Location Services.Toggle Location Services on.Scroll down and tap System Services, then toggle Significant Locations on.If these settings are disabled, your iPhone may not be able to alert you when an AirTag or similar device is nearby.What tracking alerts look likeIf your iPhone detects a tracker that doesn’t belong to you moving with you, you may see a notification such as:AirTag Found Moving With YouAirPods Detected“Product Name” Found Moving With YouUnknown Accessory DetectedTapping the alert opens the Find My app, which shows a map of where the item was detected near you. The map uses dots to indicate locations where your device noticed the tracker nearby. This doesn’t mean the owner was actively watching your location at those times, only that the tracker was detected in close proximity.In some cases, the alert may have an innocent explanation. For example, you might be borrowing someone else’s keys, bag or AirPods. If the item belongs to someone in your Family Sharing group, you can temporarily pause alerts for that item by tapping the notification and opting to turn off alerts for that item either for one day or indefinitely. What to do if you hear an AirTag making a soundIf an AirTag or compatible tracker has been separated from its owner for a period of time and is moved, it may emit a sound on its own. This is another built-in safety feature meant to draw attention to the device.If you hear an unfamiliar chirping or beeping sound, especially from a bag, jacket pocket or vehicle, it’s worth checking your belongings to see if there’s an AirTag or similar tracker inside.How to find an unknown AirTag or trackerIf you receive an alert and believe the tracker is still with you, the Find My app offers tools to help locate it.From the alert, you can choose to play a sound on the device to help pinpoint where it’s hidden. Tap the alert.Tap Continue and then tap Play Sound.Listen for the sound or play it again to give yourself more time to find the item.If the tracker is an AirTag and you have a compatible iPhone with ultra wideband connectivity, you may also see a Find Nearby option, which uses Precision Finding to guide you toward it with distance and direction indicators.Tap the alert.Tap Continue and then tap Find Nearby.Follow the onscreen instructions. You may need to move around the space until your iPhone connects to the unknown AirTag.Your iPhone will display the distance and direction of the unknown AirTag, so you can use that information to identify where the unknown AirTag is. When the AirTag is within Bluetooth range of your iPhone, you can tap the Play Sound button to listen for it. You can also tap the Turn Flashlight On button to provide more light if it’s needed.If neither option is available, or if the tracker can’t be located electronically, manually check your belongings. Look through bags, pockets, jackets and vehicles. If you feel unsafe and can’t find the device, Apple recommends going to a safe public place and contacting local law enforcement.The new Apple AirTag that works with Find My app.AppleHow to get information about an AirTagIf you find an unknown AirTag, you can learn more about it without needing to unlock it or log in.Hold the top of your iPhone, or any NFC-capable smartphone, near the white side of the AirTag. A notification should appear.Tap the notification to open a webpage with details about the AirTag. This page includes the serial number and the last four digits of the phone number associated with the owner’s Apple Account.If the AirTag was marked as lost, the page may also include a message from the owner explaining how to contact them. This can help determine whether the situation is accidental or intentional.How to disable an AirTag that isn’t yoursIf you confirm that an AirTag is tracking you and it doesn’t belong to you, you can disable it so it stops sharing its location.From the Find My alert or information page, select Instructions to Disable and follow the steps provided. For an AirTag, this usually involves removing the battery, which immediately stops location updates. Disabling Bluetooth or turning off Location Services on your phone does not stop the AirTag from reporting its location. The device itself must be disabled.If you believe the tracker was used for malicious purposes, keep the AirTag and document its details before contacting law enforcement. Apple states that it can provide information to authorities when legally required.What Android users should knowAndroid devices running Android 6.0 or later can also receive alerts if a compatible Bluetooth tracker, including an AirTag, appears to be moving with you. These alerts are enabled automatically on supported versions of Android.Android users can also manually scan for unknown trackers at any time. Additionally, Apple offers a free Tracker Detect app on the Google Play Store. The app allows Android users to scan for AirTags and Find My network accessories within Bluetooth range that are separated from their owner. If Tracker Detect finds a nearby AirTag that’s been with you for at least 10 minutes, you can play a sound to help locate it.Wrap-upWhile no system is perfect, Apple has built multiple layers of protection into AirTag and the Find My network to reduce the risk of unwanted tracking. With alerts, audible warnings and cross-platform detection on both iOS and Android, most people will be notified if a tracker they don’t own is moving with them. Knowing what these alerts look like and how to respond can help you stay informed, avoid unnecessary panic and take appropriate action if something feels off.This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/how-to-know-if-an-airtag-is-tracking-you-130000764.html?src=rss",
          "content": "Apple’s AirTag is designed to help people keep track of personal belongings like keys, bags and luggage. But because AirTags and other Bluetooth trackers are small and discreet, concerns about unwanted tracking are understandable. Apple has spent years building safeguards into the AirTag and the Find My network to reduce the risk of misuse and to alert people if a tracker they don’t own appears to be moving with them.If you’re worried about whether an AirTag or similar tracker might be following you, here’s how Apple’s unwanted tracking alerts work, what notifications to look for and what you can do on both iPhone and Android.How AirTag tracking alerts workAirTags, compatible Find My network accessories and certain AirPods models use Apple’s Find My network, which relies on Bluetooth signals and nearby devices to update their location. To prevent misuse, Apple designed these products with features that are meant to alert someone if a tracker that isn’t linked to their Apple Account appears to be traveling with them.If an AirTag or another compatible tracker is separated from its owner and detected near you over time, your device may display a notification or the tracker itself may emit a sound. These alerts are intended to discourage someone from secretly tracking another person without their knowledge. Apple has also worked with Google on a cross-platform industry standard, so alerts can appear on both iOS and Android devices, not just iPhones.How to make sure tracking alerts are enabled on your iPhoneIf you use an iPhone or iPad, tracking notifications are on by default, but it’s worth confirming your settings.To receive unwanted tracking alerts, make sure that:Your device is running iOS 17.5 or later (or iPadOS 17.5 or later). Earlier versions back to iOS 14.5 support basic AirTag alerts, but newer versions add broader compatibility with other trackers.Bluetooth is turned on.Location Services are enabled.Notifications for Tracking Alerts are allowed.Airplane Mode is turned off.You can check these by opening Settings, then navigating to Privacy & Security, Location Services and Notifications. Apple also recommends turning on Significant Locations in the System Services menu, which helps your device determine when an unknown tracker has traveled with you to places like your home.Go to Settings, tap Privacy & Security, then select Location Services.Toggle Location Services on.Scroll down and tap System Services, then toggle Significant Locations on.If these settings are disabled, your iPhone may not be able to alert you when an AirTag or similar device is nearby.What tracking alerts look likeIf your iPhone detects a tracker that doesn’t belong to you moving with you, you may see a notification such as:AirTag Found Moving With YouAirPods Detected“Product Name” Found Moving With YouUnknown Accessory DetectedTapping the alert opens the Find My app, which shows a map of where the item was detected near you. The map uses dots to indicate locations where your device noticed the tracker nearby. This doesn’t mean the owner was actively watching your location at those times, only that the tracker was detected in close proximity.In some cases, the alert may have an innocent explanation. For example, you might be borrowing someone else’s keys, bag or AirPods. If the item belongs to someone in your Family Sharing group, you can temporarily pause alerts for that item by tapping the notification and opting to turn off alerts for that item either for one day or indefinitely. What to do if you hear an AirTag making a soundIf an AirTag or compatible tracker has been separated from its owner for a period of time and is moved, it may emit a sound on its own. This is another built-in safety feature meant to draw attention to the device.If you hear an unfamiliar chirping or beeping sound, especially from a bag, jacket pocket or vehicle, it’s worth checking your belongings to see if there’s an AirTag or similar tracker inside.How to find an unknown AirTag or trackerIf you receive an alert and believe the tracker is still with you, the Find My app offers tools to help locate it.From the alert, you can choose to play a sound on the device to help pinpoint where it’s hidden. Tap the alert.Tap Continue and then tap Play Sound.Listen for the sound or play it again to give yourself more time to find the item.If the tracker is an AirTag and you have a compatible iPhone with ultra wideband connectivity, you may also see a Find Nearby option, which uses Precision Finding to guide you toward it with distance and direction indicators.Tap the alert.Tap Continue and then tap Find Nearby.Follow the onscreen instructions. You may need to move around the space until your iPhone connects to the unknown AirTag.Your iPhone will display the distance and direction of the unknown AirTag, so you can use that information to identify where the unknown AirTag is. When the AirTag is within Bluetooth range of your iPhone, you can tap the Play Sound button to listen for it. You can also tap the Turn Flashlight On button to provide more light if it’s needed.If neither option is available, or if the tracker can’t be located electronically, manually check your belongings. Look through bags, pockets, jackets and vehicles. If you feel unsafe and can’t find the device, Apple recommends going to a safe public place and contacting local law enforcement.The new Apple AirTag that works with Find My app.AppleHow to get information about an AirTagIf you find an unknown AirTag, you can learn more about it without needing to unlock it or log in.Hold the top of your iPhone, or any NFC-capable smartphone, near the white side of the AirTag. A notification should appear.Tap the notification to open a webpage with details about the AirTag. This page includes the serial number and the last four digits of the phone number associated with the owner’s Apple Account.If the AirTag was marked as lost, the page may also include a message from the owner explaining how to contact them. This can help determine whether the situation is accidental or intentional.How to disable an AirTag that isn’t yoursIf you confirm that an AirTag is tracking you and it doesn’t belong to you, you can disable it so it stops sharing its location.From the Find My alert or information page, select Instructions to Disable and follow the steps provided. For an AirTag, this usually involves removing the battery, which immediately stops location updates. Disabling Bluetooth or turning off Location Services on your phone does not stop the AirTag from reporting its location. The device itself must be disabled.If you believe the tracker was used for malicious purposes, keep the AirTag and document its details before contacting law enforcement. Apple states that it can provide information to authorities when legally required.What Android users should knowAndroid devices running Android 6.0 or later can also receive alerts if a compatible Bluetooth tracker, including an AirTag, appears to be moving with you. These alerts are enabled automatically on supported versions of Android.Android users can also manually scan for unknown trackers at any time. Additionally, Apple offers a free Tracker Detect app on the Google Play Store. The app allows Android users to scan for AirTags and Find My network accessories within Bluetooth range that are separated from their owner. If Tracker Detect finds a nearby AirTag that’s been with you for at least 10 minutes, you can play a sound to help locate it.Wrap-upWhile no system is perfect, Apple has built multiple layers of protection into AirTag and the Find My network to reduce the risk of unwanted tracking. With alerts, audible warnings and cross-platform detection on both iOS and Android, most people will be notified if a tracker they don’t own is moving with them. Knowing what these alerts look like and how to respond can help you stay informed, avoid unnecessary panic and take appropriate action if something feels off.This article originally appeared on Engadget at https://www.engadget.com/computing/accessories/how-to-know-if-an-airtag-is-tracking-you-130000764.html?src=rss",
          "feed_position": 13,
          "image_url": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2021-04/c6e02161-a1fc-11eb-beff-7f401728d6fb"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/an-old-school-zelda-like-skate-bums-and-other-new-indie-games-worth-checking-out-120000770.html",
          "published_at": "Sat, 21 Feb 2026 12:00:00 +0000",
          "title": "An old-school Zelda-like, Skate Bums and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. As a reminder, the latest edition of Steam Next Fest runs from February 23 until March 2, during which you'll be able to check out demos for hundreds of upcoming games. A bunch are available already, including one for Denshattack!, which I definitely recommend checking out. As it turns out, doing Tony Hawk Pro Skater-style tricks with a high-speed Japanese train absolutely rips.On Thursday, there were four showcases highlighting indie games all in a single day. It's not exactly feasible for me to recap them in full here, unfortunately, but I can at least tell you about a few of the many highlights.The Black History Month edition of the Black Voices in Gaming Showcase includes trailers and interviews for some games that are already available, such as Space Warlord Baby Trading Simulator, Aerial_Knight's DropShot and Relooted. Of course, the stream featured plenty of games that are on the way too.Erased, from solo developer Jerron Jacques, looks pretty interesting. It's an open-world fighting game that takes place in a cyberpunk setting with dance battles, parkour, pets, strange creatures and much more. Jacques, who has been documenting the game's development process on social media, even carried out some of the parkour motion capture work personally.There was lots of good stuff in this week's Convergence Showcase too, including another peek at Mouse: P.I. for Hire as we get to see one of the game's bosses for the first time. This first-person shooter with rubber-hose animation is set to arrive on March 19.There were other welcome announcements for me in this showcase. First, there was a release date for the Zelda-inspired adventure Gecko Gods. I've had this on my wishlist since 2022, so I'm glad to learn it'll hit Nintendo Switch, PS5 and PC on April 16. In addition, record shop sim Wax Heads (which probably should have been called Low Fidelity, tbh) is coming to PC, Xbox Series X/S, PS5, and Nintendo Switch on May 5. You can check out a Steam Next Fest demo for that one now.The second edition of Indie Fan Fest had a trove of goodies as well. For one thing, Balatro publisher Playstack could be about to cause another mass reduction in collective productivity with Raccoin, which now has a release date of March 31. This is another roguelike deckbuilder, but this time it's in the form of a coin pusher. I didn't have a chance to check out the previous playtest to get a better sense of why there's so much buzz around this one, but I'll for sure be trying the Steam Next Fest demo, which is available now.It remains deeply weird to refer to a game under Acclaim's umbrella as an indie, but that's where we are now. The publisher is bringing Ridiculous Games' GridBeat to Nintendo Switch and Steam on March 26. This is a rhythm-based dungeon crawler in which you (a hacker) try to escape from a corporate network after pilfering valuable data. There's a Next Fest demo available for this one too. Meanwhile, a narrower release window for Japanese convenience store sim InKonbini: One Store. Many Stories was revealed. It's coming to Steam, PS5, Nintendo Switch and Xbox in April.Alongside a related sale on Steam, the first Quebec Games Celebration Showcase took place on Thursday. It's always neat to learn about games being made in my neck of the woods.One of those is Surfpunk, a co-op action RPG that looks a bit like Hades with surfing. Radical. You'll venture to procedurally generated islands in search of loot. There are four weapon classes to choose from and gadgets you can craft after collecting resources on your run. There's an updated Steam demo that's said to have around five hours of gameplay. Surfpunk (which is from Convergence: A League of Legends Story developer Double Stallion) will arrive later this year.I'm including this demo announcement trailer for Croak, a precision platformer from Woodrunner Games that appears to be heavily inspired by the likes of Celeste, separately for one main reason. You have to check out the studio's head of \"barketing.\" (Okay okay, the game's hand-drawn visuals look lovely too.)There's plenty of other interesting stuff in the Quebec Games Celebration Showcase, including another look at Tears of Metal from Paper Cult Games, the studio behind the very enjoyable Bloodroots. There's a Steam demo available for the hack-and-slash roguelite, which should be out this spring. Gothic sci-fi Metroidvania Silent Planet looks quite tasty too.New releasesUnder The Island looks and sounds very The Legend of Zelda: A Link to the Past-coded. But since that's my favorite game of all time, I am not complaining. I love that protagonist Nia appears to use a hockey stick as a weapon too. This action PRG from Slime King Games (and co-publishers Top Hat Studios and Doyoyo Games) has debuted to strong early reviews. It's available now on Steam, Xbox One, Xbox Series X/S, PS4, PS5 and Nintendo Switch for $20, though there's a 15 percent launch sale (you'll need to be a PS Plus member to get the discount on PS4 and PS5).Demon Tides — a 3D, open-world platformer from Bubsy 4D and Demon Turf developer Fabraz — has lots of movement mechanics, including paragliders and hookshots. You can shapeshift into different forms as well.You can create and share graffiti, and this will appear in other players' games (which is a neat touch). Demon Tides is out now on Steam. It'll usually cost $25, but until March 5, you can snap it up for $20.Skate Bums is a 2D skateboarding game in the tradition of the OlliOlli series. As novice skateboarder Lux, you'll try to take down the Skate Bums, a gang of bullies. There are \"weird characters,\" sick combos to pull off, coins to collect and wrecking balls to dodge. There's said to be a \"simple directional trick system\" while each run is apparently short. That seems ideal for quick, pick-up-and-play sessions on Nintendo Switch and Switch 2. I also just really like the title. Skate Bums, which is from Lucky Last Studio, will normally cost $15 but there's a 15 percent discount until February 27.Love Eternal is a psychological \"horror platformer about escaping the domain of a selfish god,\" which is a strong pitch from developer brlka and Demonschool publisher Ysbryd Games. You'll need to flip between different gravitational pulls as you navigate this precision platformer, which follows teenager Maya on her attempt to return to her own reality. During a dinner at home, Maya's family disappears and she suddenly appears in an \"eerie, desolate realm\" that looks like an Iron Age castle. That's a creepy enough set up to match the game's haunting atmosphere. Love Eternal is out now on Steam, PS4, PS5, Xbox One, Xbox Series X/S and Nintendo Switch for $10. There's a 15 percent launch discount (again, you'll need to be a PS Plus member to take advantage of that on PlayStation).Upcoming Woe Industries, the developer of You Have Billions Invested In Generative AI (and a bunch of other neat projects), has something intriguing on deck for next week — a standardized gaming test. You can start the Adventure Game Aptitude Test (AGAT) at any time between 1PM and 2PM ET on February 28. You'll have four hours to complete an '80s adventure game of Woe Industries’ choosing. The developer will seemingly be monitoring your browser and smartphone activity to ensure you don't consult a walkthrough. If you're successful, you'll receive an AGAT certification and diploma. Good luck!\"Musical narrative adventure\" People of Note is coming to Steam, Epic Games Store, the Xbox App on PC, Nintendo Switch 2, PS5 and Xbox Series X/S on April 7 for $25 (though there'll be a 10 percent launch discount). The game follows pop singer Cadence on her quest for stardom. Along the way, Cadence and her buds will have to overcome enemies in battles that have turn-based and rhythm-based elements.I mostly enjoyed playing through a preview several months ago, though I had to grit my teeth through the turn-based combat, which is not something I enjoy as a rule. However, Iridium Studios will allow players to turn off elements like that and environmental puzzles so more people who might have otherwise been turned off can enjoy People of Note. You can sample the game now on Steam via a 90-minute Next Fest demo.I don't fully understand what's going on in the reveal trailer for Titanium Court, which is from AP Thomson (a solo developer who previously worked on Consume Me) and publisher Fellow Traveller. Even the press release notes that it's \"impossibly difficult to describe.\" But it has an absorbing trailer soundtracked by an odd, Bill Callahan-esque song and it has already picked up several IGF award nominations, so I'm intrigued.What I am able to surmise is that it's a surrealist, roguelike strategy game with match-three, auto battle and tower defense elements. It's also for \"clowns and criminals,\" apparently. I'm gonna have to give the Steam Next Fest demo a shot to try to get my head around it. Titanium Court is coming to Steam “imminently.”Sometimes, a game pops up that makes me think \"how has no one done this before?\" Such is the case with Become. It's a third-person linear adventure from solo developer Valentin Wirth in which you take on the guise of a single sperm. You can probably guess what the goal is.The game has \"no explicit sexual acts, nudity or violence,\" according to its Steam page, though you will encounter some danger along your journey. You can upgrade your bespectacled spermatozoon via skill trees and seemingly adorn various pieces of headgear. Become is slated to hit Steam later this year.This article originally appeared on Engadget at https://www.engadget.com/gaming/an-old-school-zelda-like-skate-bums-and-other-new-indie-games-worth-checking-out-120000770.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. As a reminder, the latest edition of Steam Next Fest runs from February 23 until March 2, during which you'll be able to check out demos for hundreds of upcoming games. A bunch are available already, including one for Denshattack!, which I definitely recommend checking out. As it turns out, doing Tony Hawk Pro Skater-style tricks with a high-speed Japanese train absolutely rips.On Thursday, there were four showcases highlighting indie games all in a single day. It's not exactly feasible for me to recap them in full here, unfortunately, but I can at least tell you about a few of the many highlights.The Black History Month edition of the Black Voices in Gaming Showcase includes trailers and interviews for some games that are already available, such as Space Warlord Baby Trading Simulator, Aerial_Knight's DropShot and Relooted. Of course, the stream featured plenty of games that are on the way too.Erased, from solo developer Jerron Jacques, looks pretty interesting. It's an open-world fighting game that takes place in a cyberpunk setting with dance battles, parkour, pets, strange creatures and much more. Jacques, who has been documenting the game's development process on social media, even carried out some of the parkour motion capture work personally.There was lots of good stuff in this week's Convergence Showcase too, including another peek at Mouse: P.I. for Hire as we get to see one of the game's bosses for the first time. This first-person shooter with rubber-hose animation is set to arrive on March 19.There were other welcome announcements for me in this showcase. First, there was a release date for the Zelda-inspired adventure Gecko Gods. I've had this on my wishlist since 2022, so I'm glad to learn it'll hit Nintendo Switch, PS5 and PC on April 16. In addition, record shop sim Wax Heads (which probably should have been called Low Fidelity, tbh) is coming to PC, Xbox Series X/S, PS5, and Nintendo Switch on May 5. You can check out a Steam Next Fest demo for that one now.The second edition of Indie Fan Fest had a trove of goodies as well. For one thing, Balatro publisher Playstack could be about to cause another mass reduction in collective productivity with Raccoin, which now has a release date of March 31. This is another roguelike deckbuilder, but this time it's in the form of a coin pusher. I didn't have a chance to check out the previous playtest to get a better sense of why there's so much buzz around this one, but I'll for sure be trying the Steam Next Fest demo, which is available now.It remains deeply weird to refer to a game under Acclaim's umbrella as an indie, but that's where we are now. The publisher is bringing Ridiculous Games' GridBeat to Nintendo Switch and Steam on March 26. This is a rhythm-based dungeon crawler in which you (a hacker) try to escape from a corporate network after pilfering valuable data. There's a Next Fest demo available for this one too. Meanwhile, a narrower release window for Japanese convenience store sim InKonbini: One Store. Many Stories was revealed. It's coming to Steam, PS5, Nintendo Switch and Xbox in April.Alongside a related sale on Steam, the first Quebec Games Celebration Showcase took place on Thursday. It's always neat to learn about games being made in my neck of the woods.One of those is Surfpunk, a co-op action RPG that looks a bit like Hades with surfing. Radical. You'll venture to procedurally generated islands in search of loot. There are four weapon classes to choose from and gadgets you can craft after collecting resources on your run. There's an updated Steam demo that's said to have around five hours of gameplay. Surfpunk (which is from Convergence: A League of Legends Story developer Double Stallion) will arrive later this year.I'm including this demo announcement trailer for Croak, a precision platformer from Woodrunner Games that appears to be heavily inspired by the likes of Celeste, separately for one main reason. You have to check out the studio's head of \"barketing.\" (Okay okay, the game's hand-drawn visuals look lovely too.)There's plenty of other interesting stuff in the Quebec Games Celebration Showcase, including another look at Tears of Metal from Paper Cult Games, the studio behind the very enjoyable Bloodroots. There's a Steam demo available for the hack-and-slash roguelite, which should be out this spring. Gothic sci-fi Metroidvania Silent Planet looks quite tasty too.New releasesUnder The Island looks and sounds very The Legend of Zelda: A Link to the Past-coded. But since that's my favorite game of all time, I am not complaining. I love that protagonist Nia appears to use a hockey stick as a weapon too. This action PRG from Slime King Games (and co-publishers Top Hat Studios and Doyoyo Games) has debuted to strong early reviews. It's available now on Steam, Xbox One, Xbox Series X/S, PS4, PS5 and Nintendo Switch for $20, though there's a 15 percent launch sale (you'll need to be a PS Plus member to get the discount on PS4 and PS5).Demon Tides — a 3D, open-world platformer from Bubsy 4D and Demon Turf developer Fabraz — has lots of movement mechanics, including paragliders and hookshots. You can shapeshift into different forms as well.You can create and share graffiti, and this will appear in other players' games (which is a neat touch). Demon Tides is out now on Steam. It'll usually cost $25, but until March 5, you can snap it up for $20.Skate Bums is a 2D skateboarding game in the tradition of the OlliOlli series. As novice skateboarder Lux, you'll try to take down the Skate Bums, a gang of bullies. There are \"weird characters,\" sick combos to pull off, coins to collect and wrecking balls to dodge. There's said to be a \"simple directional trick system\" while each run is apparently short. That seems ideal for quick, pick-up-and-play sessions on Nintendo Switch and Switch 2. I also just really like the title. Skate Bums, which is from Lucky Last Studio, will normally cost $15 but there's a 15 percent discount until February 27.Love Eternal is a psychological \"horror platformer about escaping the domain of a selfish god,\" which is a strong pitch from developer brlka and Demonschool publisher Ysbryd Games. You'll need to flip between different gravitational pulls as you navigate this precision platformer, which follows teenager Maya on her attempt to return to her own reality. During a dinner at home, Maya's family disappears and she suddenly appears in an \"eerie, desolate realm\" that looks like an Iron Age castle. That's a creepy enough set up to match the game's haunting atmosphere. Love Eternal is out now on Steam, PS4, PS5, Xbox One, Xbox Series X/S and Nintendo Switch for $10. There's a 15 percent launch discount (again, you'll need to be a PS Plus member to take advantage of that on PlayStation).Upcoming Woe Industries, the developer of You Have Billions Invested In Generative AI (and a bunch of other neat projects), has something intriguing on deck for next week — a standardized gaming test. You can start the Adventure Game Aptitude Test (AGAT) at any time between 1PM and 2PM ET on February 28. You'll have four hours to complete an '80s adventure game of Woe Industries’ choosing. The developer will seemingly be monitoring your browser and smartphone activity to ensure you don't consult a walkthrough. If you're successful, you'll receive an AGAT certification and diploma. Good luck!\"Musical narrative adventure\" People of Note is coming to Steam, Epic Games Store, the Xbox App on PC, Nintendo Switch 2, PS5 and Xbox Series X/S on April 7 for $25 (though there'll be a 10 percent launch discount). The game follows pop singer Cadence on her quest for stardom. Along the way, Cadence and her buds will have to overcome enemies in battles that have turn-based and rhythm-based elements.I mostly enjoyed playing through a preview several months ago, though I had to grit my teeth through the turn-based combat, which is not something I enjoy as a rule. However, Iridium Studios will allow players to turn off elements like that and environmental puzzles so more people who might have otherwise been turned off can enjoy People of Note. You can sample the game now on Steam via a 90-minute Next Fest demo.I don't fully understand what's going on in the reveal trailer for Titanium Court, which is from AP Thomson (a solo developer who previously worked on Consume Me) and publisher Fellow Traveller. Even the press release notes that it's \"impossibly difficult to describe.\" But it has an absorbing trailer soundtracked by an odd, Bill Callahan-esque song and it has already picked up several IGF award nominations, so I'm intrigued.What I am able to surmise is that it's a surrealist, roguelike strategy game with match-three, auto battle and tower defense elements. It's also for \"clowns and criminals,\" apparently. I'm gonna have to give the Steam Next Fest demo a shot to try to get my head around it. Titanium Court is coming to Steam “imminently.”Sometimes, a game pops up that makes me think \"how has no one done this before?\" Such is the case with Become. It's a third-person linear adventure from solo developer Valentin Wirth in which you take on the guise of a single sperm. You can probably guess what the goal is.The game has \"no explicit sexual acts, nudity or violence,\" according to its Steam page, though you will encounter some danger along your journey. You can upgrade your bespectacled spermatozoon via skill trees and seemingly adorn various pieces of headgear. Become is slated to hit Steam later this year.This article originally appeared on Engadget at https://www.engadget.com/gaming/an-old-school-zelda-like-skate-bums-and-other-new-indie-games-worth-checking-out-120000770.html?src=rss",
          "feed_position": 15
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/843ff380-b255-11eb-bddf-b4000d3cf728",
      "popularity_score": 2018.4459202777778
    },
    {
      "id": "cluster_39",
      "coverage": 2,
      "updated_at": "Sun, 22 Feb 2026 19:40:01 -0500",
      "title": "US farmers are increasingly rejecting multimillion-dollar offers from data center developers; some estimate ~40K acres are needed globally for new AI projects (Niamh Rowe/The Guardian)",
      "neutral_headline": "US farmers are rejecting multimillion-dollar datacenter bids for their...",
      "bullet_summary": [
        "Reported by TechMeme, Guardian Tech"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260222/p16#a260222p16",
          "published_at": "Sun, 22 Feb 2026 19:40:01 -0500",
          "title": "US farmers are increasingly rejecting multimillion-dollar offers from data center developers; some estimate ~40K acres are needed globally for new AI projects (Niamh Rowe/The Guardian)",
          "standfirst": "Niamh Rowe / The Guardian: US farmers are increasingly rejecting multimillion-dollar offers from data center developers; some estimate ~40K acres are needed globally for new AI projects &mdash; Families are navigating the tough choice between unimaginable riches and the identity that comes with land",
          "content": "Niamh Rowe / The Guardian: US farmers are increasingly rejecting multimillion-dollar offers from data center developers; some estimate ~40K acres are needed globally for new AI projects &mdash; Families are navigating the tough choice between unimaginable riches and the identity that comes with land",
          "feed_position": 13,
          "image_url": "http://www.techmeme.com/260222/i16.jpg"
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2026/feb/21/us-farmers-datacenters",
          "published_at": "Sat, 21 Feb 2026 14:00:09 GMT",
          "title": "US farmers are rejecting multimillion-dollar datacenter bids for their land: ‘I’m not for sale’",
          "standfirst": "Families are navigating the tough choice between unimaginable riches and the identity that comes with landWhen two men knocked on Ida Huddleston’s door last May, they carried a contract worth more than $33m in exchange for the Kentucky farm that had fed her family for centuries.According to Huddleston, the men’s client, an unnamed “Fortune 100 company”, sought her 650 acres (260 hectares) in Mason county for an unspecified industrial development. Finding out any more would require signing a non-disclosure agreement. Continue reading...",
          "content": "Families are navigating the tough choice between unimaginable riches and the identity that comes with landWhen two men knocked on Ida Huddleston’s door last May, they carried a contract worth more than $33m in exchange for the Kentucky farm that had fed her family for centuries.According to Huddleston, the men’s client, an unnamed “Fortune 100 company”, sought her 650 acres (260 hectares) in Mason county for an unspecified industrial development. Finding out any more would require signing a non-disclosure agreement. Continue reading...",
          "feed_position": 0
        }
      ],
      "featured_image": "http://www.techmeme.com/260222/i16.jpg",
      "popularity_score": 2009.0892536111112
    },
    {
      "id": "cluster_53",
      "coverage": 2,
      "updated_at": "Sun, 22 Feb 2026 17:39:55 +0000",
      "title": "Trump says Netflix will face ‘consequences’ if it doesn’t fire board member Susan Rice",
      "neutral_headline": "Trump says Netflix will ‘pay the consequences’ if it doesn’t fire Susan Rice",
      "bullet_summary": [
        "Reported by TechCrunch, The Verge"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/22/trump-says-netflix-will-face-consequences-if-it-doesnt-fire-board-member-susan-rice/",
          "published_at": "Sun, 22 Feb 2026 17:39:55 +0000",
          "title": "Trump says Netflix will face ‘consequences’ if it doesn’t fire board member Susan Rice",
          "standfirst": "Netflix board member Susan Rice had predicted that corporations that “take a knee” to Trump will be “held accountable” when Democrats return to power.",
          "content": "Netflix board member Susan Rice had predicted that corporations that “take a knee” to Trump will be “held accountable” when Democrats return to power.",
          "feed_position": 5
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/policy/882881/trump-netflix-consequences-fire-susan-rice",
          "published_at": "2026-02-22T10:37:41-05:00",
          "title": "Trump says Netflix will ‘pay the consequences’ if it doesn’t fire Susan Rice",
          "standfirst": "Donald Trump threatened that there would be \"consequences\" for Netflix if it didn't fire board member Susan Rice. Rice served in both the Obama and Biden administrations, and recently appeared on Preet Bharara's podcast, where she said corporations that \"take a knee to Trump\" are going to be \"caught with more than their pants down. [&#8230;]",
          "content": "Former Ambassador to the UN Susan Rice at the State Department on September 26, 2023. | Photo: Alex Wong / Getty Images Donald Trump threatened that there would be \"consequences\" for Netflix if it didn't fire board member Susan Rice. Rice served in both the Obama and Biden administrations, and recently appeared on Preet Bharara's podcast, where she said corporations that \"take a knee to Trump\" are going to be \"caught with more than their pants down. They are going to be held accountable.\" Right-wing influencer and conspiracy theorist Laura Loomer was quick to jump on the appearance and accused Rice of \"threatening half the country with weaponized government and political retribution.\" She also pointed out that Netflix, whose board Rice is on, is trying to me … Read the full story at The Verge.",
          "feed_position": 4
        }
      ],
      "popularity_score": 2002.0875869444444
    },
    {
      "id": "cluster_0",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "Wikipedia blacklists Archive.today, starts removing 695,000 archive links",
      "neutral_headline": "Wikipedia blacklists Archive.today, starts removing 695,000 archive links",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/wikipedia-bans-archive-today-after-site-executed-ddos-and-altered-web-captures/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "Wikipedia blacklists Archive.today, starts removing 695,000 archive links",
          "standfirst": "",
          "content": "",
          "feed_position": 0
        }
      ],
      "popularity_score": 352.99861555555555
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Sat, 21 Feb 2026 23:54:38 +0000",
      "title": "NASA says it needs to haul the Artemis II rocket back to the hangar for repairs",
      "neutral_headline": "NASA says it needs to haul the Artemis II rocket back to the hangar for repairs",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/nasa-says-it-needs-to-haul-the-artemis-ii-rocket-back-to-the-hangar-for-repairs/",
          "published_at": "Sat, 21 Feb 2026 23:54:38 +0000",
          "title": "NASA says it needs to haul the Artemis II rocket back to the hangar for repairs",
          "standfirst": "\"Accessing and remediating any of these issues can only be performed in the VAB.\"",
          "content": "A day after NASA officials expressed optimism that they could be ready to launch the Artemis II mission around the Moon next month, the space agency's administrator announced Saturday that a new problem will require the removal of the rocket from its launch pad in Florida. The latest issue appeared Friday evening, when data showed an interruption in helium flow into the upper stage of the Space Launch System rocket, NASA Administrator Jared Isaacman wrote in a post on X. Isaacman posted a more thorough update Saturday, writing that engineers are still examining the potential cause of the problem, but any fixes must take place inside the Vehicle Assembly Building. That means NASA and contractor ground teams will immediately begin preparing to roll the 322-foot-tall (98-meter) SLS rocket off of Launch Complex 39B and back to the VAB. The rocket and its mobile launch platform will ride NASA's crawler-transporter for the 4-mile journey.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_0016-1-1152x648-1771717658.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/IMG_0016-1-1152x648-1771717658.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Sun, 22 Feb 2026 11:20:03 +0000",
      "title": "Study shows how rocket launches pollute the atmosphere",
      "neutral_headline": "Study shows how rocket launches pollute the atmosphere",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/study-shows-how-rocket-launches-pollute-the-atmosphere/",
          "published_at": "Sun, 22 Feb 2026 11:20:03 +0000",
          "title": "Study shows how rocket launches pollute the atmosphere",
          "standfirst": "Is the global atmospheric commons destined to be an industrial waste dumping ground?",
          "content": "New research published Thursday bolsters growing concerns that a handful of companies and countries are using the global atmospheric commons as a dumping ground for potentially toxic and climate-altering industrial waste byproducts from loosely regulated commercial space flights. The new study analyzed a plume of pollution trailing part of a Falcon rocket that crashed through the upper atmosphere on Feb. 19, 2025, after SpaceX lost control of its reentry. The rocket was launched earlier that month, carrying 20 to 22 Starlink satellites into orbit. The authors said it is the first time debris from a specific spacecraft disintegration has been traced and measured in the near-space region about 80 to 110 kilometers above Earth. Changes there can affect the stratosphere, where ozone and climate processes operate. Until recent years, human activities had little impact in that region.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/54717981613_dab21dfbc3_k-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/54717981613_dab21dfbc3_k-1152x648.jpg",
      "popularity_score": 333
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Sat, 21 Feb 2026 13:00:01 +0000",
      "title": "Dinosaur eggshells can reveal the age of other fossils",
      "neutral_headline": "Dinosaur eggshells can reveal the age of other fossils",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/dinosaur-eggshells-can-reveal-the-age-of-other-fossils/",
          "published_at": "Sat, 21 Feb 2026 13:00:01 +0000",
          "title": "Dinosaur eggshells can reveal the age of other fossils",
          "standfirst": "Like rocks, egg shells can trap isotopes, allowing us to use them to date samples.",
          "content": "When dinosaur fossils surface at a site, it is often not possible to tell how many millions of years ago their bones were buried. While the different strata of sedimentary rock represent periods of geologic history frozen in time, accurately dating them or the fossils trapped within them has frequently proven to be frustrating. Fossilized bones and teeth have been dated with some success before, but that success is inconsistent and depends on the specimens. Both fossilization and the process of sediment turning to rock can alter the bone in ways that interfere with accuracy. While uranium-lead dating is among the most widely used methods for dating materials, it is just an emerging technology when applied to directly dating fossils. Dinosaur eggshells might have finally cracked a way to date surrounding rocks and fossils. Led by paleontologist Ryan Tucker of Stellenbosch University, a team of researchers has devised a method of dating eggshells that reveals how long ago they were covered in what was once sand, mud, or other sediments. That information will give the burial time of any other fossils embedded in the same layer of rock.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2183166031-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2183166031-1152x648.jpg",
      "popularity_score": 319
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Sat, 21 Feb 2026 12:00:56 +0000",
      "title": "Have we leapt into commercial genetic testing without understanding it?",
      "neutral_headline": "Have we leapt into commercial genetic testing without understanding it",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/have-we-leapt-into-commercial-genetic-testing-without-understanding-it/",
          "published_at": "Sat, 21 Feb 2026 12:00:56 +0000",
          "title": "Have we leapt into commercial genetic testing without understanding it?",
          "standfirst": "A new book argues that tests might reshape human diversity even if they don't work.",
          "content": "Daphne O. Martschenko and Sam Trejo both want to make the world a better, fairer, more equitable place. But they disagree on whether studying social genomics—elucidating any potential genetic contributions to behaviors ranging from mental illnesses to educational attainment to political affiliation—can help achieve this goal. Martschenko’s argument is largely that genetic research and data have almost always been used thus far as a justification to further entrench extant social inequalities. But we know the solutions to many of the injustices in our world—trying to lift people out of poverty, for example—and we certainly don’t need more genetic research to implement them. Trejo’s point is largely that more information is generally better than less. We can’t foresee the benefits that could come from basic research, and this research is happening anyway, whether we like it or not, so we may as well try to harness it as best we can toward good and not ill. Obviously, they’re both right. In What We Inherit: How New Technologies and Old Myths Are Shaping Our Genomic Future, we get to see how their collaboration can shed light on our rapidly advancing genetic capabilities.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1491115807-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-1491115807-1152x648.jpg",
      "popularity_score": 308
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "Major government research lab appears to be squeezing out foreign scientists",
      "neutral_headline": "Major government research lab appears to be squeezing out foreign scientists",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/major-government-research-lab-appears-to-be-squeezing-out-foreign-scientists/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "Major government research lab appears to be squeezing out foreign scientists",
          "standfirst": "",
          "content": "",
          "feed_position": 5
        }
      ],
      "popularity_score": 302.99861555555555
    },
    {
      "id": "cluster_6",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "After fueling test, optimism grows for March launch of Artemis II to the Moon",
      "neutral_headline": "After fueling test, optimism grows for March launch of Artemis II to the Moon",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/nasa-reports-no-significant-leaks-in-artemis-ii-fueling-test-eyes-march-6-launch/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "After fueling test, optimism grows for March launch of Artemis II to the Moon",
          "standfirst": "",
          "content": "",
          "feed_position": 6
        }
      ],
      "popularity_score": 297.99861555555555
    },
    {
      "id": "cluster_7",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "Microsoft gaming chief Phil Spencer steps down after 38 years with company",
      "neutral_headline": "Microsoft gaming chief Phil Spencer steps down after 38 years with company",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/microsoft-gaming-chief-phil-spencer-steps-down-after-38-years-with-company/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "Microsoft gaming chief Phil Spencer steps down after 38 years with company",
          "standfirst": "",
          "content": "",
          "feed_position": 7
        }
      ],
      "popularity_score": 294.99861555555555
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "MAHA moms threaten to turn this car around as RFK Jr. flips on pesticide",
      "neutral_headline": "MAHA moms threaten to turn this car around as RFK Jr. flips on pesticide",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/maha-moms-threaten-to-turn-this-car-around-as-rfk-jr-flips-on-pesticide/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "MAHA moms threaten to turn this car around as RFK Jr. flips on pesticide",
          "standfirst": "",
          "content": "",
          "feed_position": 8
        }
      ],
      "popularity_score": 272.99861555555555
    },
    {
      "id": "cluster_9",
      "coverage": 1,
      "updated_at": "2026-02-23T11:34:34.703Z",
      "title": "Fury over Discord’s age checks explodes after shady Persona test in UK",
      "neutral_headline": "Fury over Discord’s age checks explodes after shady Persona test in UK",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/discord-and-persona-end-partnership-after-shady-uk-age-test-sparks-outcry/",
          "published_at": "2026-02-23T11:34:34.703Z",
          "title": "Fury over Discord’s age checks explodes after shady Persona test in UK",
          "standfirst": "",
          "content": "",
          "feed_position": 9
        }
      ],
      "popularity_score": 267.99861555555555
    }
  ]
}