{
  "updated_at": "2025-12-18T07:17:38.589Z",
  "clusters": [
    {
      "id": "cluster_24",
      "coverage": 2,
      "updated_at": "2025-12-17T16:24:00-05:00",
      "title": "Meta pauses third-party Horizon VR headsets program",
      "neutral_headline": "Meta pauses third-party Horizon VR headsets program",
      "bullet_summary": [
        "Meta has \"paused\" its program to license its VR operating system to other hardware companies so they could build their own headsets using the platform, as reported by Road to VR",
        "With the program, announced in April 2024, Meta announced that it would be licensing the Quest OS headset - which, at the same [&#8230;]",
        "The company said that it would revisit opportunities for third-party partnerships in the future"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/846762/meta-vr-headsets-third-party-program-horizon-os",
          "published_at": "2025-12-17T16:24:00-05:00",
          "title": "Meta pauses third-party Horizon VR headsets program",
          "standfirst": "Meta has \"paused\" its program to license its VR operating system to other hardware companies so they could build their own headsets using the platform, as reported by Road to VR . With the program, announced in April 2024, Meta announced that it would be licensing the Quest OS headset - which, at the same [&#8230;]",
          "content": "Meta has \"paused\" its program to license its VR operating system to other hardware companies so they could build their own headsets using the platform, as reported by Road to VR . With the program, announced in April 2024, Meta announced that it would be licensing the Quest OS headset - which, at the same time, it also renamed to Horizon OS - to hardware makers like Lenovo and Asus. In a blog post at the time, Meta said that the program would give \"more choice to consumers and a larger ecosystem for developers to build for.\" CEO Mark Zuckerberg said in a video that \"our goal is to make it so that the open model defines the next generation o … Read the full story at The Verge.",
          "feed_position": 9
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/17/meta-is-pausing-its-dream-of-sharing-quests-horizon-os-with-third-party-headset-makers/",
          "published_at": "Wed, 17 Dec 2025 19:32:52 +0000",
          "title": "Meta is pausing its dream of sharing Quest&#8217;s Horizon OS with third-party headset makers",
          "standfirst": "The company said that it would revisit opportunities for third-party partnerships in the future.",
          "content": "The company said that it would revisit opportunities for third-party partnerships in the future.",
          "feed_position": 5
        }
      ],
      "popularity_score": 2010.1059477777778
    },
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 00:19:11 +0000",
      "title": "NASA finally—and we really do mean it this time—has a full-time leader",
      "neutral_headline": "NASA finally—and we really do mean it this time—has a full-time leader",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/nasa-finally-and-we-really-do-mean-it-this-time-has-a-full-time-leader/",
          "published_at": "Thu, 18 Dec 2025 00:19:11 +0000",
          "title": "NASA finally—and we really do mean it this time—has a full-time leader",
          "standfirst": "A long and winding road to reach NASA's headquarters in Washington, DC.",
          "content": "Jared Isaacman, a pilot and financial tech billionaire, has commanded two groundbreaking spaceflights, including leading the first private spacewalk. But his most remarkable flying has occurred over the last year. And on Wednesday, he stuck the landing by earning formal Senate approval to become NASA’s 15th administrator. With a final tally of 67 to 30, Wednesday’s Senate confirmation came 377 days after President Trump first nominated Isaacman to serve as NASA administrator. Since that time, Isaacman had to navigate the following issues:Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249116324-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249116324-1024x648.jpg",
      "popularity_score": 346.02567
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 22:22:33 +0000",
      "title": "OpenAI’s new ChatGPT image generator makes faking photos easy",
      "neutral_headline": "OpenAI’s new ChatGPT image generator makes faking photos easy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/openais-new-chatgpt-image-generator-makes-faking-photos-easy/",
          "published_at": "Wed, 17 Dec 2025 22:22:33 +0000",
          "title": "OpenAI’s new ChatGPT image generator makes faking photos easy",
          "standfirst": "New GPT Image 1.5 allows more detailed conversational image editing, for better or worse.",
          "content": "For most of photography’s roughly 200-year history, altering a photo convincingly required either a darkroom, some Photoshop expertise, or, at minimum, a steady hand with scissors and glue. On Tuesday, OpenAI released a tool that reduces the process to typing a sentence. It’s not the first company to do so. While OpenAI had a conversational image-editing model in the works since GPT-4o in 2024, Google beat OpenAI to market in March with a public prototype, then refined it to a popular model called Nano Banana image model (and Nano Banana Pro). The enthusiastic response to Google’s image-editing model in the AI community got OpenAI’s attention. OpenAI’s new GPT Image 1.5 is an AI image synthesis model that reportedly generates images up to four times faster than its predecessor and costs about 20 percent less through the API. The model rolled out to all ChatGPT users on Tuesday and represents another step toward making photorealistic image manipulation a casual process that requires no particular visual skills.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/barbarian_crt_1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/barbarian_crt_1-1152x648.jpg",
      "popularity_score": 339.0817811111111
    },
    {
      "id": "cluster_17",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 22:46:21 +0000",
      "title": "Physicists 3D-printed a Christmas tree of ice",
      "neutral_headline": "Physicists 3D-printed a Christmas tree of ice",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/physicists-3d-printed-a-christmas-tree-of-ice/",
          "published_at": "Wed, 17 Dec 2025 22:46:21 +0000",
          "title": "Physicists 3D-printed a Christmas tree of ice",
          "standfirst": "New method uses no freezing technology or refrigeration equipment—just water and a vacuum.",
          "content": "Physicists at the University of Amsterdam came up with a really cool bit of Christmas decor: a miniature 3D-printed Christmas tree, a mere 8 centimeters tall, made of ice, without any refrigeration equipment or other freezing technology, and at minimal cost. The secret is evaporative cooling, according to a preprint posted to the physics arXiv. Evaporative cooling is a well-known phenomenon; mammals use it to regulate body temperature. You can see it in your morning cup of hot coffee: the hotter atoms rise to the top of the magnetic trap and “jump out” as steam. It also plays a role (along with shock wave dynamics and various other factors) in the formation of “wine tears.” It’s a key step in creating Bose-Einstein condensates. And evaporative cooling is also the main culprit behind the infamous “stall” that so frequently plagues aspiring BBQ pit masters eager to make a successful pork butt. The meat sweats as it cooks, releasing the moisture within, and that moisture evaporates and cools the meat, effectively canceling out the heat from the BBQ. That’s why a growing number of competitive pit masters wrap their meat in tinfoil after the first few hours (usually when the internal temperature hits 170° F).Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/icytree1-1152x648-1765997543.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/icytree1-1152x648-1765997543.jpg",
      "popularity_score": 331.4784477777778
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 20:56:32 +0000",
      "title": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
      "neutral_headline": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/man-sues-cops-who-jailed-him-for-37-days-for-trolling-a-charlie-kirk-vigil/",
          "published_at": "Wed, 17 Dec 2025 20:56:32 +0000",
          "title": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
          "standfirst": "Cops may be fined for jailing a man over his Facebook posts.",
          "content": "Larry Bushart, a man who was jailed for 37 days for reposting a Trump meme, has now sued the cops who allegedly schemed to keep him imprisoned for as long as possible simply because they disagreed with his point of view. Bushart is a former cop who lost his post-retirement job after a seemingly vengeful sheriff jailed him for trolling a Charlie Kirk vigil post in a Facebook group. Upset that Kirk’s death commanded more attention than other victims of gun violence, Bushart posted a string of memes, among which was an image of Trump with an actual quote saying “We have to get over it” about a 2024 school shooting. Perry County sheriff Nick Weems has since acknowledged that he “knew” that the meme referenced a prior school shooting. However, the entire time that Bushart was detained, Weems maintained that Bushart’s post incited “mass hysteria” from parents concerned that he was threatening violence at a local high school. Painting Bushart as indifferent to the supposed hysteria, Weems justified his arrest, as well as the $2 million bond ensuring Bushart couldn’t afford bail and remained behind bars.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Larry-Bushart-via-FIRE.jpg.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Larry-Bushart-via-FIRE.jpg.jpeg",
      "popularity_score": 327.64817
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 20:46:39 +0000",
      "title": "FCC chair scrubs website after learning it called FCC an “independent agency”",
      "neutral_headline": "FCC chair scrubs website after learning it called FCC an “independent agency”",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/fcc-deletes-independent-agency-from-website-as-carr-defends-allegiance-to-trump/",
          "published_at": "Wed, 17 Dec 2025 20:46:39 +0000",
          "title": "FCC chair scrubs website after learning it called FCC an “independent agency”",
          "standfirst": "Meanwhile, Ted Cruz wants to restrict FCC's power to intimidate broadcasters.",
          "content": "Federal Communications Commission Chairman Brendan Carr today faced blistering criticism in a Senate hearing for his September threats to revoke ABC station licenses over comments made by Jimmy Kimmel. While Democrats provided nearly all the criticism, Sen. Ted Cruz (R-Texas) said that Congress should act to restrict the FCC’s power to intimidate news broadcasters. As an immediate result of today’s hearing, the FCC removed a statement from its website that said it is an independent agency. Carr, who has embraced President Trump’s declaration that independent agencies may no longer operate independently from the White House, apparently didn’t realize that the website still called the FCC an independent agency. “Yes or no, is the FCC an independent agency?” Sen. Ben Ray Luján (D-N.M.) asked. Carr answered that the FCC is not independent, prompting Luján to point to a statement on the FCC website calling the FCC “an independent US government agency overseen by Congress.”Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/brendan-carr-hearing-1152x648-1766003281.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/brendan-carr-hearing-1152x648-1766003281.jpg",
      "popularity_score": 317.4834475
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 19:18:29 +0000",
      "title": "Donut Lab’s hub motor meets WATT’s battery to create new EV skateboard",
      "neutral_headline": "Donut Lab’s hub motor meets WATT’s battery to create new EV skateboard",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/donut-labs-hub-motor-meets-watts-battery-to-create-new-ev-skateboard/",
          "published_at": "Wed, 17 Dec 2025 19:18:29 +0000",
          "title": "Donut Lab’s hub motor meets WATT’s battery to create new EV skateboard",
          "standfirst": "A prototype of the EV platform will be shown off at CES next month.",
          "content": "One of the big stories of last year’s Consumer Electronics Show in Las Vegas was the debut of Donut Lab’s diminutive but powerful electric motors. When I spoke with Donut earlier this year, the company told me that it was looking at applications ranging from drones to large automotive motors, but also things like wind turbines and even washing machines. Now, almost a year later, we have our first look at an electric vehicle that uses the technology, thanks to a new collaboration between Donut Lab and WATT Electric Vehicle Company. WATT had previously developed the Passenger and Commercial EV Skateboard (PACES), a lightweight aluminum platform for low-volume EVs. Now, it’s integrating Donut’s motors, first with one for each rear wheel, although there will eventually be an all-wheel-drive variant, too. The small EV chassis is rather intriguing—with the motors in the rear wheel hubs, the layout is even more space-efficient than a more conventional EV, which still needs to find a few cubic feet to package its drive unit(s). The two companies see plenty of potential for the platform, which they say could give rise to “multiple vehicle configurations from beach buggies to high-performance sports cars to commercial delivery vehicles.”Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Heroshot-Angle-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Heroshot-Angle-1152x648.jpg",
      "popularity_score": 297.0140030555556
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 18:41:25 +0000",
      "title": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
      "neutral_headline": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/us-threatens-crackdown-on-eu-firms-as-clash-over-tech-regulations-intensifies/",
          "published_at": "Wed, 17 Dec 2025 18:41:25 +0000",
          "title": "Bursting AI bubble may be EU’s “secret weapon” in clash with Trump, expert says",
          "standfirst": "Spotify and Accenture caught in crossfire as Trump attacks EU tech regulations.",
          "content": "The US threatened to restrict some of the largest service providers in the European Union as retaliation for EU tech regulations and investigations are increasingly drawing Donald Trump’s ire. On Tuesday, the Office of the US Trade Representative (USTR) issued a warning on X, naming Spotify, Accenture, Amadeus, Mistral, Publicis, and DHL among nine firms suddenly yanked into the middle of the US-EU tech fight. “The European Union and certain EU Member States have persisted in a continuing course of discriminatory and harassing lawsuits, taxes, fines, and directives against US service providers,” USTR’s post said.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2233373547-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2233373547-1152x648.jpg",
      "popularity_score": 295.3962252777778
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 16:10:43 +0000",
      "title": "Trump admin threatens to break up major climate research center",
      "neutral_headline": "Trump admin threatens to break up major climate research center",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/trump-admin-threatens-to-break-up-major-climate-research-center/",
          "published_at": "Wed, 17 Dec 2025 16:10:43 +0000",
          "title": "Trump admin threatens to break up major climate research center",
          "standfirst": "Major research institution dismissed as a source of \"climate alarmism.\"",
          "content": "On Tuesday, the head of the Office of Management and Budget, Russell Vought, announced that a major climate research center will be “broken up.” The National Center for Atmospheric Research, or NCAR, is a significant contributor to research on the weather, climate, and other atmospheric phenomena. The move will be a crippling blow to climate research in the US and is being widely decried by scientists. Vought initially gave a statement regarding NCAR to USA Today and later confirmed the outlet’s reporting on social media. Calling it “one of the largest sources of climate alarmism in the country,” Vought also decried what he termed “woke” activities at NCAR. These appear to be fairly typical efforts made to attract underrepresented groups to the sciences—efforts that were uncontroversial prior to the current administration. NCAR is primarily based in a complex on the outskirts of Boulder, Colorado, and maintains a supercomputing center in Wyoming. Much of its funding comes from the National Science Foundation, but the day-to-day management is handled by the University Corporation for Atmospheric Research (UCAR), a nonprofit that represents 130 individual educational institutions. In addition to climate science, researchers based there study Earth and space weather, atmospheric chemistry, and their impacts on the environment and humans. NCAR hosts a series of webpages that explain its research and all the ways it helps society.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1086618384-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1086618384-1152x648.jpg",
      "popularity_score": 275.8845586111111
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 16:00:25 +0000",
      "title": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
      "neutral_headline": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/google-releases-gemini-3-flash-promising-improved-intelligence-and-efficiency/",
          "published_at": "Wed, 17 Dec 2025 16:00:25 +0000",
          "title": "Google releases Gemini 3 Flash, promising improved intelligence and efficiency",
          "standfirst": "Google's Gemini 3 family is now complete with release of Gemini 3 Flash.",
          "content": "Google began its transition to Gemini 3 a few weeks ago with the launch of the Pro model, and the arrival of Gemini 3 Flash kicks it into high gear. The new, faster Gemini 3 model is coming to the Gemini app and search, and developers will be able to access it immediately via the Gemini API, Vertex AI, AI Studio, and Antigravity. Google’s bigger gen AI model is also picking up steam, with both Gemini 3 Pro and its image component (Nano Banana Pro) expanding in search. This may come as a shock, but Google says Gemini 3 Flash is faster and more capable than its previous base model. As usual, Google has a raft of benchmark numbers that show modest improvements for the new model. It bests the old 2.5 Flash in basic academic and reasoning tests like GPQA Diamond and MMMU Pro (where it even beats 3 Pro). It gets a larger boost in Humanity’s Last Exam (HLE), which tests advanced domain-specific knowledge. Gemini 3 Flash has tripled the old models’ score in HLE, landing at 33.7 percent without tool use. That’s just a few points behind the Gemini 3 Pro model. Credit: Google Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/gemini-3_flash_model_blog_header_dark_bleed_2096x1182-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/gemini-3_flash_model_blog_header_dark_bleed_2096x1182-1152x648.png",
      "popularity_score": 269.71289194444444
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 15:25:25 +0000",
      "title": "Browser extensions with 8 million users collect extended AI conversations",
      "neutral_headline": "Browser extensions with 8 million users collect extended AI conversations",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/12/browser-extensions-with-8-million-users-collect-extended-ai-conversations/",
          "published_at": "Wed, 17 Dec 2025 15:25:25 +0000",
          "title": "Browser extensions with 8 million users collect extended AI conversations",
          "standfirst": "The extensions, available for Chromium browsers, harvest full AI conversations over months.",
          "content": "Browser extensions with more than 8 million installs are harvesting complete and extended conversations from users’ AI conversations and selling them for marketing purposes, according to data collected from the Google and Microsoft pages hosting them. Security firm Koi discovered the eight extensions, which as of late Tuesday night remained available in both Google’s and Microsoft’s extension stores. Seven of them carry “Featured” badges, which are endorsements meant to signal that the companies have determined the extensions meet their quality standards. The free extensions provide functions such as VPN routing to safeguard online privacy and ad blocking for ad-free browsing. All provide assurances that user data remains anonymous and isn’t shared for purposes other than their described use. A gold mine for marketers and data brokers An examination of the extensions’ underlying code tells a much more complicated story. Each contains eight of what Koi calls “executor” scripts, with each being unique for ChatGPT, Claude, Gemini, and five other leading AI chat platforms. The scripts are injected into webpages anytime the user visits one of these platforms. From there, the scripts override browsers’ built-in functions for making network requests and receiving responses.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/electronic-privacy-invasion-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/electronic-privacy-invasion-1152x648.jpg",
      "popularity_score": 262.1295586111111
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:52:43 +0000",
      "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "neutral_headline": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/leaked-debug-kit-suggests-apple-is-testing-a-new-imac-pro-among-many-other-macs/",
          "published_at": "Tue, 16 Dec 2025 18:52:43 +0000",
          "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
          "standfirst": "Resurrected high-end all-in-one could be a worthy successor to 2017's iMac Pro.",
          "content": "Apple doesn’t like to talk about its upcoming products before it’s ready, but sometimes the company’s software does the talking for it. So far this week we’ve had a couple of software-related leaks that have outed products Apple is currently testing—one a pre-release build of iOS 26, and the other some leaked files from a kernel debug kit (both via MacRumors). Most of the new devices referenced in these leaks are straightforward updates to products that already exist: a new Apple TV, a HomePod mini 2, new AirTags and AirPods, an M4 iPad Air, a 12th-generation iPad to replace the current A16 version, next-generation iPhones (including the 17e, 18, and the rumored foldable model), a new Studio Display model, some new smart home products we’ve already heard about elsewhere, and M5 updates for the MacBook Air, Mac mini, Mac Studio, and the other MacBook Pros. There’s also yet another reference to the lower-cost MacBook that Apple is apparently planning to replace the M1 MacBook Air it still sells via Walmart for $599. For power users, though, the most interesting revelation might be that Apple is working on a higher-end Apple Silicon iMac powered by an M5 Max chip. The kernel debug kit references an iMac with the internal identifier J833c, based on a platform identified as H17C—and H17C is apparently based on the M5 Max, rather than a lower-end M5 chip. (For those who don’t have Apple’s branding memorized, “Max” is associated with Apple’s second-fastest chips; the M5 Max would be faster than the M5 or M5 Pro, but slower than the rumored M5 Ultra.)Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg",
      "popularity_score": 151
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 12:00:13 +0000",
      "title": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
      "neutral_headline": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/trump-spent-2025-attacking-science-that-could-set-back-his-genesis-mission/",
          "published_at": "Wed, 17 Dec 2025 12:00:13 +0000",
          "title": "“A Band-Aid on a giant gash”: Trump’s attacks on science may ruin his AI moonshot",
          "standfirst": "Trump’s AI “Manhattan Project” will fail if DOGE cuts are kept, critics say.",
          "content": "By executive order last month, Donald Trump launched his so-called “Genesis Mission.” Described as a “historic national effort” to “invest in AI-enabled science to accelerate scientific advancement,” Trump claimed his mission would address key challenges to American energy dominance, innovation, and national security. This mission, Trump boasted, would be a game-changer to science akin to putting a man on the moon or firing the first nuclear weapons. By building “an integrated AI platform” trained on “the world’s largest collection” of federal scientific data sets, he promised, the government could set off cascades of scientific breakthroughs.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/trump-project-genesis-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/trump-project-genesis-1152x648.jpg",
      "popularity_score": 148.7095586111111
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 15:09:03 +0000",
      "title": "Electric vehicles cause tension in the automotive aftermarket",
      "neutral_headline": "Electric vehicles cause tension in the automotive aftermarket",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/how-is-ev-technology-being-accepted-by-the-aftermarket/",
          "published_at": "Wed, 17 Dec 2025 15:09:03 +0000",
          "title": "Electric vehicles cause tension in the automotive aftermarket",
          "standfirst": "At SEMA, we heard Trump-like talking points but saw skateboard chassis, too.",
          "content": "After federal clean vehicle tax credits ended in September, the electric vehicle industry reached a crossroads. Well, technically, it has been there since Trump took office. This is a weird period in automotive history; A chunk of the industry is full-steam ahead with EV development, another is cutting back, and the consumer is left wondering what the electrification landscape will look like next year, let alone in three, during the next administration. But what about the automotive aftermarket? Typically, this corner benefits from whatever progress is made on the OEM front—have Trump’s policies expanded or contracted its EV technological development? I recently spent some time chatting with personnel of the Specialty Equipment Market Association (SEMA) at its yearly tradeshow in Las Vegas to find out. I also hit the bricks (or, rather, bright carpeting) of the massive show itself, seeking out some new, unique developments in the space that behoove EV tech’s inherent benefits. Above one of the show’s several sprawling halls, I met with Mike Spagnola, SEMA’s CEO, and Karen Bailey-Chapman, senior vice president, public and government affairs, to learn what the organization’s official stance is. First and foremost: It doesn’t want to be told what to do.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/SEMAPhotos20251-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/SEMAPhotos20251-1152x648.jpg",
      "popularity_score": 142.85678083333335
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:25:05 +0000",
      "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "neutral_headline": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/the-4-3-billion-space-telescope-trump-tried-to-cancel-is-now-complete/",
          "published_at": "Tue, 16 Dec 2025 21:25:05 +0000",
          "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
          "standfirst": "\"We're going to be making 3D movies of what is going on in the Milky Way galaxy.\"",
          "content": "A few weeks ago, technicians inside a cavernous clean room in Maryland made the final connection to complete assembly of NASA’s Nancy Grace Roman Space Telescope. Parts of this new observatory, named for NASA’s first chief astronomer, recently completed a spate of tests to ensure it can survive the shaking and intense sound of a rocket launch. Engineers placed the core of the telescope inside a thermal vacuum chamber, where it withstood the airless conditions and extreme temperature swings it will see in space. Then, on November 25, teams at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, joined the inner and outer portions of the Roman Space Telescope. With this milestone, NASA declared the observatory complete and on track for launch as soon as fall 2026.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_102",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:00:57 +0000",
      "title": "Utah leaders hinder efforts to develop solar energy supply",
      "neutral_headline": "Utah leaders hinder efforts to develop solar energy supply",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/utah-leaders-hinder-efforts-to-develop-solar-energy-supply/",
          "published_at": "Tue, 16 Dec 2025 17:00:57 +0000",
          "title": "Utah leaders hinder efforts to develop solar energy supply",
          "standfirst": "Solar power accounts for two-thirds of the new projects waiting to connect to the state’s power grid.",
          "content": "Utah Gov. Spencer Cox believes his state needs more power—a lot more. By some estimates, Utah will require as much electricity in the next five years as it generated all last century to meet the demands of a growing population as well as chase data centers and AI developers to fuel its economy. To that end, Cox announced Operation Gigawatt last year, declaring the state would double energy production in the next decade. Although the announcement was short on details, Cox, a Republican, promised his administration would take an “any of the above” approach, which aims to expand all sources of energy production. Despite that goal, the Utah Legislature’s Republican supermajority, with Cox’s acquiescence, has taken a hard turn against solar power—which has been coming online faster than any other source in Utah and accounts for two-thirds of the new projects waiting to connect to the state’s power grid.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 14:41:36 +0000",
      "title": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
      "neutral_headline": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/twitter-comeback-bid-draws-lawsuit-from-elon-musks-x-corp/",
          "published_at": "Wed, 17 Dec 2025 14:41:36 +0000",
          "title": "Twitter comeback bid draws lawsuit from Elon Musk’s X Corp",
          "standfirst": "“Huge uphill battle” to obtain and use Twitter name.",
          "content": "On Tuesday, X Corporation, formerly known as Twitter, sued “Operation Bluebird,” the new startup that is seeking to reclaim the allegedly abandoned Twitter trademark and relaunch a new social media network under that name. In its 43-page lawsuit, which was filed in federal court in Delaware, X Corporation alleges trademark infringement, adding that despite Bluebird’s “purported plan, it cannot bring Twitter ‘back’—Twitter never left and continues to be exclusively owned by X Corp.” One of Bluebird’s leaders, Michael Peroff, told Ars in an email that Operation Bluebird was “fully expecting” a lawsuit from X Corporation and that “we planned for it.”Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-twitter-broken-phone-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/getty-twitter-broken-phone-1152x648.jpg",
      "popularity_score": 136.39928083333334
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 12:30:15 +0000",
      "title": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
      "neutral_headline": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/us-oil-industry-doesnt-see-profit-in-trumps-pro-petroleum-moves/",
          "published_at": "Wed, 17 Dec 2025 12:30:15 +0000",
          "title": "US oil industry doesn’t see profit in Trump’s “pro-petroleum” moves",
          "standfirst": "The financial picture around drilling is moving against the Trump administration’s hopes",
          "content": "As the Trump administration makes announcement after announcement about its efforts to promote the US fossil fuel industry, the industry isn’t exactly jumping at new opportunities. Some high-profile oil and gas industry leaders and organizations have objected to changes to long-standing government policy positions that give companies firm ground on which to make their plans. And the financial picture around oil and gas drilling is moving against the Trump administration’s hopes. Though politicians may tout new opportunities to drill offshore or in Arctic Alaska, the commercial payoff is not clear and even unlikely.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2245935569-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2245935569-1152x648.jpg",
      "popularity_score": 134.21011416666667
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:57:55 +0000",
      "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "neutral_headline": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/texas-sues-biggest-tv-makers-alleging-smart-tvs-spy-on-users-without-consent/",
          "published_at": "Tue, 16 Dec 2025 21:57:55 +0000",
          "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
          "standfirst": "Automated Content Recognition brings \"mass surveillance\" to homes, lawsuits say.",
          "content": "Texas Attorney General Ken Paxton sued five large TV manufacturers yesterday, alleging that their smart TVs spy on viewers without consent. Paxton sued Samsung, the longtime TV market share leader, along with LG, Sony, Hisense, and TCL. “These companies have been unlawfully collecting personal data through Automated Content Recognition (‘ACR’) technology,” Paxton’s office alleged in a press release that contains links to all five lawsuits. “ACR in its simplest terms is an uninvited, invisible digital invader. This software can capture screenshots of a user’s television display every 500 milliseconds, monitor viewing activity in real time, and transmit that information back to the company without the user’s knowledge or consent. The companies then sell that consumer information to target ads across platforms for a profit. This technology puts users’ privacy and sensitive information, such as passwords, bank information, and other personal information at risk.” The lawsuits allege violations of the Texas Deceptive Trade Practices Act, seeking damages of up to $10,000 for each violation and up to $250,000 for each violation affecting people 65 years or older. Texas also wants restraining orders prohibiting the collection, sharing, and selling of ACR data while the lawsuits are pending.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:25:57 +0000",
      "title": "Senators count the shady ways data centers pass energy costs on to Americans",
      "neutral_headline": "Senators count the shady ways data centers pass energy costs on to Americans",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/shady-data-center-deals-doom-americans-to-higher-energy-bills-senators-say/",
          "published_at": "Tue, 16 Dec 2025 20:25:57 +0000",
          "title": "Senators count the shady ways data centers pass energy costs on to Americans",
          "standfirst": "Senators demand Big Tech pay upfront for data center spikes in electricity bills.",
          "content": "Senators launched a probe Tuesday demanding that tech companies explain exactly how they plan to prevent data center projects from increasing electricity bills in communities where prices are already skyrocketing. In letters to seven AI firms, Senators Elizabeth Warren (D-Mass.), Chris Van Hollen (D-Md.), and Richard Blumenthal (D-Conn.) cited a study estimating that “electricity prices have increased by as much as 267 percent in the past five years” in “areas located near significant data center activity.” Prices increase, senators noted, when utility companies build out extra infrastructure to meet data centers’ energy demands—which can amount to one customer suddenly consuming as much power as an entire city. They also increase when demand for local power outweighs supply. In some cases, residents are blindsided by higher bills, not even realizing a data center project was approved, because tech companies seem intent on dodging backlash and frequently do not allow terms of deals to be publicly disclosed.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:28:32 +0000",
      "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "neutral_headline": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/journalist-insists-half-life-3-will-launch-with-steam-machine-in-spring-2026/",
          "published_at": "Tue, 16 Dec 2025 17:28:32 +0000",
          "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
          "standfirst": "\"Everybody I've talked to are still adamant,\" even after previous rumors didn't pan out.",
          "content": "If you can take your mind way back to the beginning of 2025, you might remember a fresh wave of rumors suggesting that Half-Life 3 was finally reaching the final stages of production, and could be announced and/or released at any moment. Now, though, 2025 seems set to come to a close without any official news of a game fans have been waiting literal decades for. That doesn’t necessarily mean a Half-Life 3 announcement and/or release isn’t imminent, though. On the contrary, veteran journalist Mike Straw insisted on a recent Insider Gaming podcast that “everybody I’ve talked to are still adamant [Half-Life 3] is a game that will be a launch title with the Steam Machine.” Straw—who has a long history of reporting gaming rumors from anonymous sources—said this Half-Life 3 information is “not [from] these run-of-the-mill sources that haven’t gotten me information before. … These aren’t like random, one-off people.” And those sources are “still adamant that the game is coming in the spring,” Straw added, noting that he was “specifically told [that] spring 2026 [is the window] for the Steam Machine, for the Frame, for the Controller, [and] for Half-Life 3.”Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg",
      "popularity_score": 133
    }
  ]
}