{
  "updated_at": "2025-12-17T03:51:51.526Z",
  "clusters": [
    {
      "id": "cluster_24",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:57:55 +0000",
      "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "neutral_headline": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/texas-sues-biggest-tv-makers-alleging-smart-tvs-spy-on-users-without-consent/",
          "published_at": "Tue, 16 Dec 2025 21:57:55 +0000",
          "title": "Texas sues biggest TV makers, alleging smart TVs spy on users without consent",
          "standfirst": "Automated Content Recognition brings \"mass surveillance\" to homes, lawsuits say.",
          "content": "Texas Attorney General Ken Paxton sued five large TV manufacturers yesterday, alleging that their smart TVs spy on viewers without consent. Paxton sued Samsung, the longtime TV market share leader, along with LG, Sony, Hisense, and TCL. “These companies have been unlawfully collecting personal data through Automated Content Recognition (‘ACR’) technology,” Paxton’s office alleged in a press release that contains links to all five lawsuits. “ACR in its simplest terms is an uninvited, invisible digital invader. This software can capture screenshots of a user’s television display every 500 milliseconds, monitor viewing activity in real time, and transmit that information back to the company without the user’s knowledge or consent. The companies then sell that consumer information to target ads across platforms for a profit. This technology puts users’ privacy and sensitive information, such as passwords, bank information, and other personal information at risk.” The lawsuits allege violations of the Texas Deceptive Trade Practices Act, seeking damages of up to $10,000 for each violation and up to $250,000 for each violation affecting people 65 years or older. Texas also wants restraining orders prohibiting the collection, sharing, and selling of ACR data while the lawsuits are pending.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/smart-tv-and-phone-1152x648-1765917384.jpg",
      "popularity_score": 347.100965
    },
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 21:25:05 +0000",
      "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "neutral_headline": "The $4.3 billion space telescope Trump tried to cancel is now complete",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/the-4-3-billion-space-telescope-trump-tried-to-cancel-is-now-complete/",
          "published_at": "Tue, 16 Dec 2025 21:25:05 +0000",
          "title": "The $4.3 billion space telescope Trump tried to cancel is now complete",
          "standfirst": "\"We're going to be making 3D movies of what is going on in the Milky Way galaxy.\"",
          "content": "A few weeks ago, technicians inside a cavernous clean room in Maryland made the final connection to complete assembly of NASA’s Nancy Grace Roman Space Telescope. Parts of this new observatory, named for NASA’s first chief astronomer, recently completed a spate of tests to ensure it can survive the shaking and intense sound of a rocket launch. Engineers placed the core of the telescope inside a thermal vacuum chamber, where it withstood the airless conditions and extreme temperature swings it will see in space. Then, on November 25, teams at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, joined the inner and outer portions of the Roman Space Telescope. With this milestone, NASA declared the observatory complete and on track for launch as soon as fall 2026.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Trailer_still_1-1-1152x648.jpg",
      "popularity_score": 344.55374277777776
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 18:52:43 +0000",
      "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "neutral_headline": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/leaked-debug-kit-suggests-apple-is-testing-a-new-imac-pro-among-many-other-macs/",
          "published_at": "Tue, 16 Dec 2025 18:52:43 +0000",
          "title": "Software leaks point to the first Apple Silicon “iMac Pro,” among other devices",
          "standfirst": "Resurrected high-end all-in-one could be a worthy successor to 2017's iMac Pro.",
          "content": "Apple doesn’t like to talk about its upcoming products before it’s ready, but sometimes the company’s software does the talking for it. So far this week we’ve had a couple of software-related leaks that have outed products Apple is currently testing—one a pre-release build of iOS 26, and the other some leaked files from a kernel debug kit (both via MacRumors). Most of the new devices referenced in these leaks are straightforward updates to products that already exist: a new Apple TV, a HomePod mini 2, new AirTags and AirPods, an M4 iPad Air, a 12th-generation iPad to replace the current A16 version, next-generation iPhones (including the 17e, 18, and the rumored foldable model), a new Studio Display model, some new smart home products we’ve already heard about elsewhere, and M5 updates for the MacBook Air, Mac mini, Mac Studio, and the other MacBook Pros. There’s also yet another reference to the lower-cost MacBook that Apple is apparently planning to replace the M1 MacBook Air it still sells via Walmart for $599. For power users, though, the most interesting revelation might be that Apple is working on a higher-end Apple Silicon iMac powered by an M5 Max chip. The kernel debug kit references an iMac with the internal identifier J833c, based on a platform identified as H17C—and H17C is apparently based on the M5 Max, rather than a lower-end M5 chip. (For those who don’t have Apple’s branding memorized, “Max” is associated with Apple’s second-fastest chips; the M5 Max would be faster than the M5 or M5 Pro, but slower than the rumored M5 Ultra.)Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/iMac-Pro-front-scaled-1-1152x648.jpeg",
      "popularity_score": 332.01429833333333
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 20:25:57 +0000",
      "title": "Senators count the shady ways data centers pass energy costs on to Americans",
      "neutral_headline": "Senators count the shady ways data centers pass energy costs on to Americans",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/shady-data-center-deals-doom-americans-to-higher-energy-bills-senators-say/",
          "published_at": "Tue, 16 Dec 2025 20:25:57 +0000",
          "title": "Senators count the shady ways data centers pass energy costs on to Americans",
          "standfirst": "Senators demand Big Tech pay upfront for data center spikes in electricity bills.",
          "content": "Senators launched a probe Tuesday demanding that tech companies explain exactly how they plan to prevent data center projects from increasing electricity bills in communities where prices are already skyrocketing. In letters to seven AI firms, Senators Elizabeth Warren (D-Mass.), Chris Van Hollen (D-Md.), and Richard Blumenthal (D-Conn.) cited a study estimating that “electricity prices have increased by as much as 267 percent in the past five years” in “areas located near significant data center activity.” Prices increase, senators noted, when utility companies build out extra infrastructure to meet data centers’ energy demands—which can amount to one customer suddenly consuming as much power as an entire city. They also increase when demand for local power outweighs supply. In some cases, residents are blindsided by higher bills, not even realizing a data center project was approved, because tech companies seem intent on dodging backlash and frequently do not allow terms of deals to be publicly disclosed.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249021916-1024x648.jpg",
      "popularity_score": 325.5681872222222
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:28:32 +0000",
      "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "neutral_headline": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/journalist-insists-half-life-3-will-launch-with-steam-machine-in-spring-2026/",
          "published_at": "Tue, 16 Dec 2025 17:28:32 +0000",
          "title": "Reporter suggests Half-Life 3 will be a Steam Machine launch title",
          "standfirst": "\"Everybody I've talked to are still adamant,\" even after previous rumors didn't pan out.",
          "content": "If you can take your mind way back to the beginning of 2025, you might remember a fresh wave of rumors suggesting that Half-Life 3 was finally reaching the final stages of production, and could be announced and/or released at any moment. Now, though, 2025 seems set to come to a close without any official news of a game fans have been waiting literal decades for. That doesn’t necessarily mean a Half-Life 3 announcement and/or release isn’t imminent, though. On the contrary, veteran journalist Mike Straw insisted on a recent Insider Gaming podcast that “everybody I’ve talked to are still adamant [Half-Life 3] is a game that will be a launch title with the Steam Machine.” Straw—who has a long history of reporting gaming rumors from anonymous sources—said this Half-Life 3 information is “not [from] these run-of-the-mill sources that haven’t gotten me information before. … These aren’t like random, one-off people.” And those sources are “still adamant that the game is coming in the spring,” Straw added, noting that he was “specifically told [that] spring 2026 [is the window] for the Steam Machine, for the Frame, for the Controller, [and] for Half-Life 3.”Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2017/08/024-1152x648-1740609184.jpg",
      "popularity_score": 302.61124277777776
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 17:00:57 +0000",
      "title": "Utah leaders hinder efforts to develop solar energy supply",
      "neutral_headline": "Utah leaders hinder efforts to develop solar energy supply",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/utah-leaders-hinder-efforts-to-develop-solar-energy-supply/",
          "published_at": "Tue, 16 Dec 2025 17:00:57 +0000",
          "title": "Utah leaders hinder efforts to develop solar energy supply",
          "standfirst": "Solar power accounts for two-thirds of the new projects waiting to connect to the state’s power grid.",
          "content": "Utah Gov. Spencer Cox believes his state needs more power—a lot more. By some estimates, Utah will require as much electricity in the next five years as it generated all last century to meet the demands of a growing population as well as chase data centers and AI developers to fuel its economy. To that end, Cox announced Operation Gigawatt last year, declaring the state would double energy production in the next decade. Although the announcement was short on details, Cox, a Republican, promised his administration would take an “any of the above” approach, which aims to expand all sources of energy production. Despite that goal, the Utah Legislature’s Republican supermajority, with Cox’s acquiescence, has taken a hard turn against solar power—which has been coming online faster than any other source in Utah and accounts for two-thirds of the new projects waiting to connect to the state’s power grid.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241255023-1152x648.jpg",
      "popularity_score": 298.1515205555556
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 15:38:57 +0000",
      "title": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
      "neutral_headline": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/2026-mercedes-cla-first-drive-entry-level-doesnt-mean-basic/",
          "published_at": "Tue, 16 Dec 2025 15:38:57 +0000",
          "title": "2026 Mercedes CLA first drive: Entry level doesn’t mean basic",
          "standfirst": "Starting at $47,250, Mercedes' new electric sedan is quite compelling.",
          "content": "Mercedes-Benz provided flights from Washington to San Francisco and accommodation so Ars could drive the CLA. Ars does not accept paid editorial content. SAN FRANCISCO—Automakers are starting to follow somewhat familiar paths as they continue their journeys to electrification. Electric vehicles are, at first, strange new tech, and usually look like it. Mercedes-Benz’s EQS and EQE are good examples—with bodies that look like bars of soap worn down in the shower, they stood out. For early adopters and trailblazers that might be fine, but you need to sell cars to normal people if you want to survive, and that means making EVs more normal. Which is what Mercedes did with its newest one, the all-electric CLA. The normal looks belie the amount of new technology that Mercedes has packed into the CLA, though. The car sticks to the four-door coupe look that the company pioneered a couple of decades ago, but there’s a thoroughly modern electric powertrain connected to the wheels, run by four powerful networked computers. And yes, there’s AI. (For the pedants, “coupe” means cut down, not two-door, so the name is accurate.) The CLA is the first of a new series of Mercedes that will use the same modular architecture, and interestingly, it’s powertrain agnostic—a hybrid CLA is coming in time, too. But first the battery EV, which makes good use of some technology Mercedes developed for the EQXX concept car.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026-Mercedes-Benz-CLA-4-1152x648-1765897346.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026-Mercedes-Benz-CLA-4-1152x648-1765897346.jpg",
      "popularity_score": 286.7848538888889
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Tue, 16 Dec 2025 15:09:45 +0000",
      "title": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
      "neutral_headline": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/ars-live-3-former-cdc-leaders-detail-impacts-of-rfk-jr-s-anti-science-agenda/",
          "published_at": "Tue, 16 Dec 2025 15:09:45 +0000",
          "title": "Ars Live Today: 3 former CDC leaders detail impacts of RFK Jr.’s anti-science agenda",
          "standfirst": "Join us today, December 16, at 2 pm ET to hear from leaders who resigned in protest.",
          "content": "The Centers for Disease Control and Prevention is in critical condition. This year, the premier public health agency had its funding brutally cut and staff gutted, its mission sabotaged, and its headquarters riddled with literal bullets. The over 500 rounds fired were meant for its scientists and public health experts, who endured only to be sidelined, ignored, and overruled by Health Secretary Robert F. Kennedy Jr., an anti-vaccine activist hellbent on warping the agency to fit his anti-science agenda. Then, on August 27, Kennedy fired CDC Director Susan Monarez just weeks after she was confirmed by the Senate. She had refused to blindly approve vaccine recommendations from a panel of vaccine skeptics and contrarians that he had hand-selected. The agency descended into chaos, and Monarez wasn’t the only one to leave the agency that day. Three top leaders had reached their breaking point and coordinated their resignations upon the dramatic ouster: Drs. Demetre Daskalakis, Debra Houry, and Daniel Jernigan walked out of the agency as their colleagues rallied around them.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2231820155-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2231820155-1152x648.jpg",
      "popularity_score": 285.2981872222222
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 22:41:43 +0000",
      "title": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
      "neutral_headline": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/merriam-webster-crowns-slop-word-of-the-year-as-ai-content-floods-internet/",
          "published_at": "Mon, 15 Dec 2025 22:41:43 +0000",
          "title": "Merriam-Webster’s word of the year delivers a dismissive verdict on junk AI content",
          "standfirst": "Dictionary codifies the term that took hold in 2024 for low-quality AI-generated content.",
          "content": "Like most tools, generative AI models can be misused. And when the misuse gets bad enough that a major dictionary notices, you know it has become a cultural phenomenon. On Sunday, Merriam-Webster announced that “slop” is its 2025 Word of the Year, reflecting how the term has become shorthand for the flood of low-quality AI-generated content that has spread across social media, search results, and the web at large. The dictionary defines slop as “digital content of low quality that is produced usually in quantity by means of artificial intelligence.” “It’s such an illustrative word,” Merriam-Webster President Greg Barlow told The Associated Press. “It’s part of a transformative technology, AI, and it’s something that people have found fascinating, annoying, and a little bit ridiculous.”Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241620003-1152x648-1765829622.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2241620003-1152x648-1765829622.jpg",
      "popularity_score": 268
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 22:14:28 +0000",
      "title": "Stranger Things S5 trailer teases Vol. 2",
      "neutral_headline": "Stranger Things S5 trailer teases Vol. 2",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/stranger-things-s5-trailer-teases-vol-2/",
          "published_at": "Mon, 15 Dec 2025 22:14:28 +0000",
          "title": "Stranger Things S5 trailer teases Vol. 2",
          "standfirst": "\"Everything we've ever assumed about the Upside Down has been dead wrong.\"",
          "content": "We’re 10 days away from the next installment of the fifth and final season of Stranger Things, and Netflix has released a new trailer for what it’s calling Volume 2. This will cover episodes five through seven, with the final episode comprising Vol. 3. (Spoilers for Season 5, Vol. 1 below.) Season 4 ended with Vecna—the Big Bad behind it all—opening the gate that allowed the Upside Down to leak into Hawkins. We got a time jump for S5, Vol. 1, but in a way, we came full circle, since those events coincided with the third anniversary of Will’s original disappearance in S1.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/vecna1-1152x648-1765835577.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/vecna1-1152x648-1765835577.jpg",
      "popularity_score": 255
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 20:10:25 +0000",
      "title": "Murder-suicide case shows OpenAI selectively hides data after users die",
      "neutral_headline": "Murder-suicide case shows OpenAI selectively hides data after users die",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/openai-refuses-to-say-where-chatgpt-logs-go-when-users-die/",
          "published_at": "Mon, 15 Dec 2025 20:10:25 +0000",
          "title": "Murder-suicide case shows OpenAI selectively hides data after users die",
          "standfirst": "OpenAI accused of hiding full ChatGPT logs in murder-suicide case.",
          "content": "OpenAI is facing increasing scrutiny over how it handles ChatGPT data after users die, only selectively sharing data in lawsuits over ChatGPT-linked suicides. Last week, OpenAI was accused of hiding key ChatGPT logs from the days before a 56-year-old bodybuilder, Stein-Erik Soelberg, took his own life after “savagely” murdering his mother, 83-year-old Suzanne Adams. According to the lawsuit—which was filed by Adams’ estate on behalf of surviving family members—Soelberg struggled with mental health problems after a divorce led him to move back into Adams’ home in 2018. But allegedly Soelberg did not turn violent until ChatGPT became his sole confidant, validating a wide range of wild conspiracies, including a dangerous delusion that his mother was part of a network of conspirators spying on him, tracking him, and making attempts on his life.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Stein-Erik-Soelberg-and-Suzanne-Adams-via-complaint-1152x648-1765827196.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Stein-Erik-Soelberg-and-Suzanne-Adams-via-complaint-1152x648-1765827196.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 21:15:55 +0000",
      "title": "Microsoft will finally kill obsolete cipher that has wreaked decades of havoc",
      "neutral_headline": "Microsoft will finally kill obsolete cipher that has wreaked decades of havoc",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2025/12/microsoft-will-finally-kill-obsolete-cipher-that-has-wreaked-decades-of-havoc/",
          "published_at": "Mon, 15 Dec 2025 21:15:55 +0000",
          "title": "Microsoft will finally kill obsolete cipher that has wreaked decades of havoc",
          "standfirst": "The weak RC4 for administrative authentication has been a hacker holy grail for decades.",
          "content": "Microsoft is killing off an obsolete and vulnerable encryption cipher that Windows has supported by default for 26 years following more than a decade of devastating hacks that exploited it and recently faced blistering criticism from a prominent US senator. When the software maker rolled out Active Directory in 2000, it made RC4 a sole means of securing the Windows component, which administrators use to configure and provision fellow administrator and user accounts inside large organizations. RC4, short for Rivist Cipher 4, is a nod to mathematician and cryptographer Ron Rivest of RSA Security, who developed the stream cipher in 1987. Within days of the trade-secret-protected algorithm being leaked in 1994, a researcher demonstrated a cryptographic attack that significantly weakened the security it had been believed to provide. Despite the known susceptibility, RC4 remained a staple in encryption protocols, including SSL and its successor TLS, until about a decade ago. Out with the old One of the most visible holdouts in supporting RC4 has been Microsoft. Eventually, Microsoft upgraded Active Directory to support the much more secure AES encryption standard. But by default, Windows servers have continued to respond to RC4-based authentication requests and return an RC4-based response. The RC4 fallback has been a favorite weakness hackers have exploited to compromise enterprise networks. Use of RC4 played a key role in last year’s breach of health giant Ascension. The breach caused life-threatening disruptions at 140 hospitals and put the medical records of 5.6 million patients into the hands of the attackers. US Senator Ron Wyden (D-Ore.) in September called on the Federal Trade Commission to investigate Microsoft for “gross cybersecurity negligence,” citing the continued default support for RC4.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/microsoft-logo-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/microsoft-logo-1024x648.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 20:20:05 +0000",
      "title": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
      "neutral_headline": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/microsoft-takes-down-mod-that-recreated-halo-3-in-counter-strike-2/",
          "published_at": "Mon, 15 Dec 2025 20:20:05 +0000",
          "title": "Microsoft takes down mod that re-created Halo 3 in Counter-Strike 2",
          "standfirst": "Project Misriah creator vows to use new experience \"to cook up something else.\"",
          "content": "Last month saw the release of Project Misriah, an ambitious modding project that tried to re-create the feel of Halo 3 inside Valve’s Counter-Strike 2. That project has now been taken down from the Steam Workshop, though, after drawing a Digital Millennium Copyright Act complaint from Microsoft. Modder Froddoyo introduced Project Misriah on November 16 as “a workshop collection of Halo ported maps and assets that aims to bring a Halo 3 multiplayer-like experience to Counter-Strike 2.” Far from just being inspired by Halo 3, the mod directly copied multiple sound effects, character models, maps, and even movement mechanics from Bungie and Microsoft’s popular series. In the weeks since, Project Misriah has drawn a lot of praise from both Halo fans and those impressed by what modders could pull off with the Source 2 engine. But last Wednesday, modder Froddoyo shared a DMCA request from Microsoft citing the “unauthorized use of Halo game content in a [Steam] workshop not associated with Halo games.”Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/mistriah-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/mistriah-1152x648.png",
      "popularity_score": 145
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 19:38:32 +0000",
      "title": "UK to “encourage” Apple and Google to put nudity-blocking systems on phones",
      "neutral_headline": "UK to “encourage” Apple and Google to put nudity-blocking systems on phones",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/uk-to-encourage-apple-and-google-to-put-nudity-blocking-systems-on-phones/",
          "published_at": "Mon, 15 Dec 2025 19:38:32 +0000",
          "title": "UK to “encourage” Apple and Google to put nudity-blocking systems on phones",
          "standfirst": "Government seeks \"nudity-detection algorithms\" in iOS and Android, report says.",
          "content": "The UK government reportedly will “encourage” Apple and Google to prevent phones from displaying nude images except when users verify that they are adults. The forthcoming push for nudity-blocking systems was reported by the Financial Times today. The report said the UK won’t institute a legal requirement “for now.” But asking companies to block nude images could be the first step toward making it mandatory if the government doesn’t get what it wants. “The UK government wants technology companies to block explicit images on phones and computers by default to protect children, with adults having to verify their age to create and access such content,” the FT report said. “Ministers want the likes of Apple and Google to incorporate nudity-detection algorithms into their device operating systems to prevent users taking photos or sharing images of genitalia unless they are verified as adults.”Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/phone-locking-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/phone-locking-1152x648.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 18:13:24 +0000",
      "title": "Google will end dark web reports that alerted users to leaked data",
      "neutral_headline": "Google will end dark web reports that alerted users to leaked data",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/google-is-shutting-down-dark-web-reports-in-january-because-they-werent-helpful/",
          "published_at": "Mon, 15 Dec 2025 18:13:24 +0000",
          "title": "Google will end dark web reports that alerted users to leaked data",
          "standfirst": "Google says the reports lacked \"helpful next steps.\"",
          "content": "Google began offering “dark web reports” a while back, but the company has just announced the feature will be going away very soon. In an email to users of the service, Google says it will stop telling you about dark web data leaks in February. This probably won’t negatively impact your security or privacy because, as Google points out in its latest email, there’s really nothing you can do about the dark web. The dark web reports launched in March 2023 as a perk for Google One subscribers. The reports were expanded to general access in 2024. Now, barely a year later, Google has decided it doesn’t see the value in this type of alert for users. Dark web reports provide a list of partially redacted user data retrieved from shadowy forums and sites where such information is bought and sold. However, that’s all it is—a list. The dark web consists of so-called hidden services hosted inside the Tor network. You need a special browser or connection tools in order to access Tor hidden services, and its largely anonymous nature has made it a favorite hangout for online criminals. If a company with your personal data has been hacked, that data probably lives somewhere on the dark web.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/google-logo-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/google-logo-1152x648.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 12:30:44 +0000",
      "title": "Verizon refused to unlock man’s iPhone, so he sued the carrier and won",
      "neutral_headline": "Verizon refused to unlock man’s iPhone, so he sued the carrier and won",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/verizon-refused-to-unlock-mans-iphone-so-he-sued-the-carrier-and-won/",
          "published_at": "Mon, 15 Dec 2025 12:30:44 +0000",
          "title": "Verizon refused to unlock man’s iPhone, so he sued the carrier and won",
          "standfirst": "Verizon changed policy after he bought the phone, wouldn't unlock it despite FCC rule.",
          "content": "When Verizon refused to unlock an iPhone purchased by Kansas resident Patrick Roach, he had no intention of giving up without a fight. Roach sued the wireless carrier in small claims court and won. Roach bought a discounted iPhone 16e from Verizon’s Straight Talk brand on February 28, 2025, as a gift for his wife’s birthday. He intended to pay for one month of service, cancel, and then switch the phone to the US Mobile service plan that the couple uses. Under federal rules that apply to Verizon and a Verizon unlocking policy that was in place when Roach bought the phone, this strategy should have worked. “The best deals tend to be buying it from one of these MVNOs [Mobile Virtual Network Operators] and then activating it until it unlocks and then switching it to whatever you are planning to use it with. It usually saves you about half the value of the phone,” Roach said in a phone interview.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/verizon-jerks-locked-phone-1152x648-1765486982.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/verizon-jerks-locked-phone-1152x648-1765486982.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 21:05:18 +0000",
      "title": "Ford ends F-150 Lightning production, starts battery storage business",
      "neutral_headline": "Ford ends F-150 Lightning production, starts battery storage business",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/ford-ends-f-150-lightning-production-starts-battery-storage-business/",
          "published_at": "Mon, 15 Dec 2025 21:05:18 +0000",
          "title": "Ford ends F-150 Lightning production, starts battery storage business",
          "standfirst": "It looks like battery electric vehicles are out of fashion at the Blue Oval.",
          "content": "Ford’s F-150 Lightning production line has fallen silent, and its employees are now building more gas and hybrid trucks. The automaker continues to retreat from the big bet it made on Americans embracing full-size battery electric pickup trucks, and will focus instead on cheaper vehicles, hybrids, and range-extended electric vehicles—or EREVs—instead, it announced today. One of those EREVs will be the Lighting’s replacement. With a gasoline generator that just charges the battery—series hybrid fans rejoice—the next Lightning comes with the towing ability that Ford says its customers consider “non-negotiable,” and up to 700 miles (1,126 km) of range. “Our next-generation F-150 Lightning EREV will be every bit as revolutionary. It delivers everything Lightning customers love – near instantaneous torque and pure electric driving. But with a high-power generator enabling an estimated range of 700+ miles, it tows like a locomotive. Heavy-duty towing and cross-country travel will be as effortless as the daily commute,” said Doug Field, Ford’s chief EV, digital and design officer.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250038446-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250038446-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 19:53:04 +0000",
      "title": "Filmmaker Rob Reiner, wife, killed in horrific home attack",
      "neutral_headline": "Filmmaker Rob Reiner, wife, killed in horrific home attack",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/r-i-p-rob-reiner-beloved-filmmaker-dead-at-78/",
          "published_at": "Mon, 15 Dec 2025 19:53:04 +0000",
          "title": "Filmmaker Rob Reiner, wife, killed in horrific home attack",
          "standfirst": "The Reiners' troubled 32-year-old son, Nick, has been arrested in conjunction with the killings.",
          "content": "We woke up this morning to the horrifying news that beloved actor and director Rob Reiner and his wife Michele were killed in their Brentwood home in Los Angeles last night. Both had been stabbed multiple times. Details are scarce, but the couple’s 32-year-old son, Nick—who has long struggled with addiction and recently moved back in with his parents—has been arrested in connection with the killings, with bail set at $4 million. [UPDATE: Nick Reiner’s bail has been revoked and he faces possible life in prison.] “As a result of the initial investigation, it was determined that the Reiners were the victims of homicide,” the LAPD said. “The investigation further revealed that Nick Reiner, the 32-year-old son of Robert and Michele Reiner, was responsible for their deaths. Nick Reiner was located and arrested at approximately 9:15 p.m. He was booked for murder and remains in custody with no bail. On Tuesday, December 16, 2025, the case will be presented to the Los Angeles County District Attorney’s Office for filing consideration.” “It is with profound sorrow that we announce the tragic passing of Michele and Rob Reiner,” the family said in a statement confirming the deaths. “We are heartbroken by this sudden loss, and we ask for privacy during this unbelievably difficult time.”Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/reiner1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/reiner1-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 16:44:01 +0000",
      "title": "Oh look, yet another Starship clone has popped up in China",
      "neutral_headline": "Oh look, yet another Starship clone has popped up in China",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/oh-look-yet-another-starship-clone-has-popped-up-in-china/",
          "published_at": "Mon, 15 Dec 2025 16:44:01 +0000",
          "title": "Oh look, yet another Starship clone has popped up in China",
          "standfirst": "Chinese companies are no longer hiding their intent to clone SpaceX. They're advertising it.",
          "content": "Every other week, it seems, a new Chinese launch company pops up with a rocket design and a plan to reach orbit within a few years. For a long time, the majority of these companies revealed designs that looked a lot like SpaceX’s Falcon 9 rocket. The first of these copy cats, the medium-lift Zhuque-3 rocket built by LandSpace, launched earlier this month. Its primary mission was nominal, but the Zhuque-3 rocket failed its landing attempt, which is understandable for a first flight. Doubtless there will be more Chinese Falcon 9-like rockets making their debut in the near future. However, over the last year, there has been a distinct change in announcements from China when it comes to new launch technology. Just as SpaceX is seeking to transition from its workhorse Falcon 9 rocket—which has now been flying for a decade and a half—to the fully reusable Starship design, so too are Chinese companies modifying their visions.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/china-rocket.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/china-rocket.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Mon, 15 Dec 2025 15:24:41 +0000",
      "title": "Roomba maker iRobot swept into bankruptcy",
      "neutral_headline": "Roomba maker iRobot swept into bankruptcy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/roomba-maker-irobot-swept-into-bankruptcy/",
          "published_at": "Mon, 15 Dec 2025 15:24:41 +0000",
          "title": "Roomba maker iRobot swept into bankruptcy",
          "standfirst": "Shenzhen-based Picea Robotics, its lender and primary supplier, will acquire all of iRobot’s shares.",
          "content": "Roomba maker iRobot has filed for bankruptcy and will be taken over by its Chinese supplier after the company that popularized the robot vacuum cleaner fell under the weight of competition from cheaper rivals. The US-listed group on Sunday said it had filed for Chapter 11 bankruptcy in Delaware as part of a restructuring agreement with Shenzhen-based Picea Robotics, its lender and primary supplier, which will acquire all of iRobot’s shares. The deal comes nearly two years after a proposed $1.5 billion acquisition by Amazon fell through over competition concerns from EU regulators.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-633690806-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-633690806-1152x648.jpg",
      "popularity_score": 130
    }
  ]
}