{
  "updated_at": "2026-01-30T04:26:42.103Z",
  "clusters": [
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 23:22:58 +0000",
      "title": "Having that high-deductible health plan might kill you, literally",
      "neutral_headline": "Having that high-deductible health plan might kill you, literally",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/having-that-high-deductible-health-plan-might-kill-you-literally/",
          "published_at": "Thu, 29 Jan 2026 23:22:58 +0000",
          "title": "Having that high-deductible health plan might kill you, literally",
          "standfirst": "With ACA tax credits gone, more people are turning to high-deductible plans.",
          "content": "Having a health insurance plan with a high deductible could not only cost you—it could also kill you. A new study in JAMA Network Open found that people who faced those high out-of-pocket costs as well as a cancer diagnosis had worse overall survival and cancer-specific survival than those with more standard health plans. The findings, while perhaps not surprising, are a stark reminder of the fraught decisions Americans face as the price of health care only continues to rise, and more people try to offset costs by accepting insurance plans with higher deductibles—that is, higher out-of-pocket costs they have to pay before their health insurance provider starts paying its share.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2211388790-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2211388790-1152x648.jpg",
      "popularity_score": 347.93774916666666
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 22:46:59 +0000",
      "title": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
      "neutral_headline": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/windows-11-has-hit-1-billion-users-just-a-hair-faster-than-windows-10-did/",
          "published_at": "Thu, 29 Jan 2026 22:46:59 +0000",
          "title": "People complaining about Windows 11 hasn't stopped it from hitting 1 billion users",
          "standfirst": "Windows 11 clears a milestone as Windows 10 continues its slow fade.",
          "content": "Complaining about Windows 11 is a popular sport among tech enthusiasts on the Internet, whether you're publicly switching to Linux, publishing guides about the dozens of things you need to do to make the OS less annoying, or getting upset because you were asked to sign in to an app after clicking a sign-in button. Despite the negativity surrounding the current version of Windows, it remains the most widely used operating system on the world's desktop and laptop computers, and people usually prefer to stick to what they're used to. As a result, Windows 11 has just cleared a big milestone—Microsoft CEO Satya Nadella said on the company's most recent earnings call (via The Verge) that Windows 11 now has over 1 billion users worldwide. Windows 11 also reached that milestone just a few months quicker than Windows 10 did—1,576 days after its initial public launch on October 5, 2021. Windows 10 took 1,692 days to reach the same milestone, based on its July 29, 2015, general availability date and Microsoft's announcement on March 16, 2020.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/win11-light-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/win11-light-1152x648.jpeg",
      "popularity_score": 342.33802694444444
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 23:07:05 +0000",
      "title": "US spy satellite agency declassifies high-flying Cold War listening post",
      "neutral_headline": "US spy satellite agency declassifies high-flying Cold War listening post",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/us-spy-satellite-agency-declassifies-high-flying-cold-war-listening-post/",
          "published_at": "Thu, 29 Jan 2026 23:07:05 +0000",
          "title": "US spy satellite agency declassifies high-flying Cold War listening post",
          "standfirst": "The JUMPSEAT satellites loitered over the North Pole to spy on the Soviet Union.",
          "content": "The National Reconnaissance Office, the agency overseeing the US government's fleet of spy satellites, has declassified a decades-old program used to eavesdrop on the Soviet Union's military communication signals. The program was codenamed Jumpseat, and its existence was already public knowledge through leaks and contemporary media reports. What's new is the NRO's description of the program's purpose, development, and pictures of the satellites themselves. In a statement, the NRO called Jumpseat \"the United States’ first-generation, highly elliptical orbit (HEO) signals-collection satellite.\"Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jumpseat_art1-820x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jumpseat_art1-820x648.jpg",
      "popularity_score": 337.6730269444445
    },
    {
      "id": "cluster_43",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 22:05:59 +0000",
      "title": "How often do AI chatbots lead users down a harmful path?",
      "neutral_headline": "How often do AI chatbots lead users down a harmful path",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/how-often-do-ai-chatbots-lead-users-down-a-harmful-path/",
          "published_at": "Thu, 29 Jan 2026 22:05:59 +0000",
          "title": "How often do AI chatbots lead users down a harmful path?",
          "standfirst": "Anthropic's latest paper on \"user disempowerment\" has some troubling findings.",
          "content": "At this point, we've all heard plenty of stories about AI chatbots leading users to harmful actions, harmful beliefs, or simply incorrect information. Despite the prevalence of these stories, though, it's hard to know just how often users are being manipulated. Are these tales of AI harms anecdotal outliers or signs of a frighteningly common problem? Anthropic took a stab at answer ingthat question this week, releasing a paper studying the potential for what it calls \"disempowering patterns\" across 1.5 million anonymized real-world conversations with its Claude AI model. While the results show that these kinds of manipulative patterns are relatively rare as a percentage of all AI conversations, they still represent a potentially large problem on an absolute basis. A rare but growing problem In the newly published paper \"Who’s in Charge? Disempowerment Patterns in Real-World LLM Usage,\" researchers from Anthropic and the University of Toronto try to quantify the potential for a specific set of \"user disempowering\" harms by identifying three primary ways that a chatbot can negatively impact a user's thoughts or actions:Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-758288177-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-758288177-1152x648.jpg",
      "popularity_score": 331.6546936111111
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 20:26:50 +0000",
      "title": "Google Project Genie lets you create interactive worlds from a photo or prompt",
      "neutral_headline": "Google Project Genie lets you create interactive worlds from a photo or prompt",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/google-project-genie-lets-you-create-interactive-worlds-from-a-photo-or-prompt/",
          "published_at": "Thu, 29 Jan 2026 20:26:50 +0000",
          "title": "Google Project Genie lets you create interactive worlds from a photo or prompt",
          "standfirst": "Project Genie lets you generate new worlds 60 seconds at a time, but only if you pay for AI Ultra.",
          "content": "Last year, Google showed off Genie 3, an updated version of its AI world model with impressive long-term memory that allowed it to create interactive worlds from a simple text prompt. At the time, Google only provided Genie to a small group of trusted testers. Now, it's available more widely as Project Genie, but only for those paying for Google's most expensive AI subscription. World models are exactly what they sound like—an AI that generates a dynamic environment on the fly. They're not technically 3D worlds, though. World models like Genie 3 create a video that responds to your control inputs, allowing you to explore the simulation as if it were a real virtual world. Genie 3 was a breakthrough in world models because it could remember details of the world it was creating for a much longer time. But in this context, a \"long time\" is a couple of minutes. Project Genie is essentially a cleaned-up version of Genie 3, which plugs into updated AI models like Nano Banana Pro and Gemini 3. Google has a number of pre-built worlds available in Project Genie, but it's the ability to create new things that makes it interesting. You can provide an image for reference or simply tell Genie what you want from the environment and the character.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Genie-worlds-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Genie-worlds-1152x648.png",
      "popularity_score": 317.0021936111111
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:19:11 +0000",
      "title": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
      "neutral_headline": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/i-dont-fear-ken-paxton-nurse-vows-to-keep-shipping-abortion-pills-to-texas/",
          "published_at": "Thu, 29 Jan 2026 19:19:11 +0000",
          "title": "She'll mess with Texas: Nurse keeps mailing abortion pills, despite Paxton lawsuit",
          "standfirst": "Texas sues Delaware nurse practitioner shipping out hundreds of abortion pills each month.",
          "content": "A Texas fight with a nurse practitioner may eventually push the Supreme Court to settle an intensifying battle between states with strict abortion-ban laws and those with shield laws to protect abortion providers supporting out-of-state patients. In a lawsuit filed Tuesday, Texas Attorney General Ken Paxton accused Debra Lynch, a Delaware-based nurse practitioner, of breaking Texas laws by shipping abortion pills that Lynch once estimated last January facilitated \"up to 162 abortions per week\" in the state. \"No one, regardless of where they live, will be freely allowed to aid in the murder of unborn children in Texas,\" Paxton's press release said.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2203850225-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2203850225-1024x648.jpg",
      "popularity_score": 298.8746936111111
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:51:45 +0000",
      "title": "Comcast keeps losing customers despite price guarantee and unlimited data",
      "neutral_headline": "Comcast keeps losing customers despite price guarantee and unlimited data",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/comcast-keeps-losing-customers-despite-price-guarantee-and-unlimited-data/",
          "published_at": "Thu, 29 Jan 2026 19:51:45 +0000",
          "title": "Comcast keeps losing customers despite price guarantee and unlimited data",
          "standfirst": "Comcast overhauled Internet plans to stop customer losses. It isn't working yet.",
          "content": "In April 2025, Comcast President Mike Cavanagh bemoaned that the company's cable broadband division was \"not winning in the marketplace” amid increased competition from fiber and fixed wireless Internet service providers. Cavanagh identified some problems that had been obvious to Comcast customers for many years: Its prices aren’t transparent enough and rise too frequently, and dealing with the company is too difficult. Comcast sought to fix the problems with a five-year price guarantee, one year of free Xfinity Mobile service for home Internet customers, and plans with unlimited data instead of punitive data caps. But the company is still losing broadband customers at a higher-than-expected rate. In Q4 2025 earnings announced today, Comcast reported a net loss of 181,000 residential and business broadband customers in the US. The loss consists of 178,000 residential Internet customers and 3,000 business customers.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/comcast-1-1152x648-1745527748.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/comcast-1-1152x648-1745527748.jpg",
      "popularity_score": 294.4174713888889
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 18:30:52 +0000",
      "title": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
      "neutral_headline": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/county-pays-600000-to-pentesters-it-arrested-for-assessing-courthouse-security/",
          "published_at": "Thu, 29 Jan 2026 18:30:52 +0000",
          "title": "County pays $600,000 to pentesters it arrested for assessing courthouse security",
          "standfirst": "Settlement comes more than 6 years after Gary DeMercurio and Justin Wynn's ordeal began.",
          "content": "Two security professionals who were arrested in 2019 after performing an authorized security assessment of a county courthouse in Iowa will receive $600,000 to settle a lawsuit they brought alleging wrongful arrest and defamation. The case was brought by Gary DeMercurio and Justin Wynn, two penetration testers who at the time were employed by Colorado-based security firm Coalfire Labs. The men had written authorization from the Iowa Judicial Branch to conduct “red-team” exercises, meaning attempted security breaches that mimic techniques used by criminal hackers or burglars. The objective of such exercises is to test the resilience of existing defenses using the types of real-world attacks the defenses are designed to repel. The rules of engagement for this exercise explicitly permitted “physical attacks,” including “lockpicking,” against judicial branch buildings so long as they didn’t cause significant damage.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2019/11/dallas-county-courthouse-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/11/dallas-county-courthouse-1152x648.jpeg",
      "popularity_score": 278.0694158333333
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 19:00:41 +0000",
      "title": "What ice fishing can teach us about making foraging decisions",
      "neutral_headline": "What ice fishing can teach us about making foraging decisions",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/what-ice-fishing-can-teach-us-about-making-foraging-decisions/",
          "published_at": "Thu, 29 Jan 2026 19:00:41 +0000",
          "title": "What ice fishing can teach us about making foraging decisions",
          "standfirst": "Social density increases likelihood of sticking with a location. Environmental factors had little influence.",
          "content": "Ice fishing is a longstanding tradition in Nordic countries, with competitions proving especially popular. Those competitions can also tell scientists something about how social cues influence how we make foraging decisions, according to a new paper published in the journal Science. Humans are natural foragers in even the most extreme habitats, digging up tubers in the tropics, gathering mushrooms, picking berries, hunting seals in the Arctic, and fishing to meet our dietary needs. Human foraging is sufficiently complex that scientists believe that meeting so many diverse challenges helped our species develop memory, navigational abilities, social learning skills, and similar advanced cognitive functions. Researchers are interested in this question not just because it could help refine existing theories of social decision-making, but also could improve predictions about how different groups of humans might respond and adapt to changes in their environment. Per the authors, prior research in this area has tended to focus on solitary foragers operating in a social vacuum. And even when studying social foraging decisions, it's typically done using computational modeling and/or in the laboratory.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/icefishing1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/icefishing1-1152x648.jpg",
      "popularity_score": 273.5663602777778
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 17:51:49 +0000",
      "title": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
      "neutral_headline": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/new-openai-tool-renews-fears-that-ai-slop-will-overwhelm-scientific-research/",
          "published_at": "Thu, 29 Jan 2026 17:51:49 +0000",
          "title": "New OpenAI tool renews fears that “AI slop” will overwhelm scientific research",
          "standfirst": "New \"Prism\" workspace launches just as studies show AI-assisted papers are flooding journals with diminished quality.",
          "content": "On Tuesday, OpenAI released a free AI-powered workspace for scientists. It's called Prism, and it has drawn immediate skepticism from researchers who fear the tool will accelerate the already overwhelming flood of low-quality papers into scientific journals. The launch coincides with growing alarm among publishers about what many are calling \"AI slop\" in academic publishing. To be clear, Prism is a writing and formatting tool, not a system for conducting research itself, though OpenAI's broader pitch blurs that line. Prism integrates OpenAI's GPT-5.2 model into a LaTeX-based text editor (a standard used for typesetting documents), allowing researchers to draft papers, generate citations, create diagrams from whiteboard sketches, and collaborate with co-authors in real time. The tool is free for anyone with a ChatGPT account.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/robot_science_header-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/robot_science_header-1152x648.jpg",
      "popularity_score": 267.4185825
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 15:19:56 +0000",
      "title": "Does Anthropic believe its AI is conscious, or is that just what it wants Claude to think?",
      "neutral_headline": "Does Anthropic believe its AI is conscious, or is that just...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/does-anthropic-believe-its-ai-is-conscious-or-is-that-just-what-it-wants-claude-to-think/",
          "published_at": "Thu, 29 Jan 2026 15:19:56 +0000",
          "title": "Does Anthropic believe its AI is conscious, or is that just what it wants Claude to think?",
          "standfirst": "We have no proof that AI models suffer, but Anthropic acts like they might for training purposes.",
          "content": "Anthropic's secret to building a better AI assistant might be treating Claude like it has a soul—whether or not anyone actually believes that's true. But Anthropic isn't saying exactly what it believes either way. Last week, Anthropic released what it calls Claude's Constitution, a 30,000-word document outlining the company's vision for how its AI assistant should behave in the world. Aimed directly at Claude and used during the model's creation, the document is notable for the highly anthropomorphic tone it takes toward Claude. For example, it treats the company's AI models as if they might develop emergent emotions or a desire for self-preservation. Among the stranger portions: expressing concern for Claude's \"wellbeing\" as a \"genuinely novel entity,\" apologizing to Claude for any suffering it might experience, worrying about whether Claude can meaningfully consent to being deployed, suggesting Claude might need to set boundaries around interactions it \"finds distressing,\" committing to interview models before deprecating them, and preserving older model weights in case they need to \"do right by\" decommissioned AI models in the future.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/the-AI-ghost-in-the-machine-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/the-AI-ghost-in-the-machine-1152x648.jpg",
      "popularity_score": 160.88719361111112
    },
    {
      "id": "cluster_107",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 21:53:57 +0000",
      "title": "Seven things to know about how Apple's Creator Studio subscriptions work",
      "neutral_headline": "Seven things to know about how Apple's Creator Studio subscriptions work",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/seven-things-to-know-about-how-apples-creator-studio-subscriptions-work/",
          "published_at": "Wed, 28 Jan 2026 21:53:57 +0000",
          "title": "Seven things to know about how Apple's Creator Studio subscriptions work",
          "standfirst": "For the Mac versions of pro apps, things aren't actually changing much (yet).",
          "content": "Apple's new Creator Studio subscription bundle officially launches today, offering access to a wide range of updated professional apps for an all-or-nothing price of $12.99 a month or $129 a year. Teachers and students can get the same apps for $2.99 a month, or $29.99 a year. The bundle includes either access to or enhanced features for a total of 10 Apple apps, though the base versions of several of these are available for free to all Mac and iPad owners: Final Cut Pro Logic Pro Pixelmator Pro Keynote, Pages, and Numbers Freeform Motion, Compressor, and MainStage (Mac only) When companies introduce a subscription-based model for long-standing apps with an established user base, they often shift exclusively to a subscription model, offering continuous updates in return for a more consistent revenue stream. But these aren't always popular with subscription-fatigued users, who have seen virtually all major paid software shift to a subscription model in the last 10 or 15 years, and who in recent years have had to deal with prices that are continuously being ratcheted upward.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-28-at-4.09.33-PM-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-28-at-4.09.33-PM-1152x648.jpeg",
      "popularity_score": 151
    },
    {
      "id": "cluster_109",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 21:37:37 +0000",
      "title": "Stranded boys struggle to survive in Lord of the Flies trailer",
      "neutral_headline": "Stranded boys struggle to survive in Lord of the Flies trailer",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/bbcs-lord-of-the-flies-miniseries-gets-a-trailer/",
          "published_at": "Wed, 28 Jan 2026 21:37:37 +0000",
          "title": "Stranded boys struggle to survive in Lord of the Flies trailer",
          "standfirst": "“We need to think about food and shelter. We need to help each other and be good camp mates.”",
          "content": "BBC One has adapted William Golding's classic 1954 novel Lord of the Flies into a new miniseries and just dropped the first trailer. The book has been adapted for film three times since its publication and also inspired the Emmy-nominated TV series Yellowjackets (renewed for its fourth and final season this year). This BBC miniseries apparently has the support of the Golding family and is expected to hew quite closely to the novel. (Spoilers for the 1954 novel below.) Golding was inspired to write Lord of the Flies by a popular, pro-colonialism children's novel called The Coral Island, whose central theme was the civilizing influence of British colonial efforts and Christianity on a \"savage\" people. Golding wanted to write a book about children on an island who \"behave the way children really would behave.\"Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/flies1-1152x648-1769625327.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/flies1-1152x648-1769625327.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 15:18:44 +0000",
      "title": "Do you have ideas about how to improve America's space program?",
      "neutral_headline": "Do you have ideas about how to improve America's space program",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/do-you-have-ideas-about-how-to-improve-americas-space-program/",
          "published_at": "Thu, 29 Jan 2026 15:18:44 +0000",
          "title": "Do you have ideas about how to improve America's space program?",
          "standfirst": "\"Any time there’s dynamic change, there’s the opportunity for new ideas.\"",
          "content": "Over the first quarter of the 21st century, two major trends have transformed the global space industry. The first is the rapid rise of China's space program, which only flew its first human to orbit in 2003 but now boasts spaceflight capabilities second only to the United States. The second trend is the rise of the commercial space sector, first in the United States and led by SpaceX, but now spreading across much of the planet. Both of these trends have had profound impacts on both civil and military space enterprises in the United States.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/space-suggestion-box-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/space-suggestion-box-1152x648.jpg",
      "popularity_score": 147.8671936111111
    },
    {
      "id": "cluster_90",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 14:14:29 +0000",
      "title": "States want to tax fossil fuel companies to create climate change superfunds",
      "neutral_headline": "States want to tax fossil fuel companies to create climate change superfunds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/states-want-to-charge-fossil-fuel-companies-for-climate-change-superfunds/",
          "published_at": "Thu, 29 Jan 2026 14:14:29 +0000",
          "title": "States want to tax fossil fuel companies to create climate change superfunds",
          "standfirst": "As climate costs rise, states are passing legislation so fossil fuel can pay their share.",
          "content": "Illinois lawmakers plan to introduce a climate change superfund bill in the state legislature this session, the latest in a growing number of states seeking to make fossil fuel companies pay up for the fast-growing financial fallout of climate change. As the costs of global warming rise—in the form of home insurance premiums, utility bills, health expenses, and record-breaking damages from extreme weather—local advocates are increasingly pushing states to require that fossil fuel companies contribute to climate “superfunds” that would support mitigation and adaptation. Illinois State Rep. Robyn Gabel, who will introduce the bill in the House, said she is motivated by the growing threat of flooding and heat waves in the state.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/houseflooded-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/houseflooded-1152x648.jpg",
      "popularity_score": 146.79636027777778
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 14:39:47 +0000",
      "title": "Tesla kills Models S and X to build humanoid robots instead",
      "neutral_headline": "Tesla kills Models S and X to build humanoid robots instead",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/tesla-kills-models-s-and-x-to-build-humanoid-robots-instead/",
          "published_at": "Thu, 29 Jan 2026 14:39:47 +0000",
          "title": "Tesla kills Models S and X to build humanoid robots instead",
          "standfirst": "EVs that were once industry-leading have long since been left behind.",
          "content": "Yesterday afternoon, following the end of trading on Wall Street for the day, Tesla published its financial results for 2025. They weren't particularly good: Profits were almost halved, and revenues declined year on year for the first time in the company's history. The reasons for the company's troubles are myriad. CEO Elon Musk's bankrolling of right-wing politics and promotion of AI-generated revenge porn deepfakes and CSAM has alienated plenty of potential customers. For those who either don't know or don't care about that stuff, there's still the problem of a tiny and aging model lineup, with large question marks over safety and reliability. Soon, that tiny lineup will be even smaller. The news emerged during Tesla's call with investors last night. As Ars and others have observed, in recent years Musk appears to have grown bored with the prosaic business of running a profitable car company. Silicon Valley stopped finding that stuff sexy years ago, and no other electric vehicle startup has been able to generate a value within an order of magnitude of the amount that Tesla has been determined to be worth by investors. Musk's attention first turned away from building and selling cars to the goal of autonomous driving, spurred on at the time by splashy headlines garnered by Google spinoff Waymo. Combined with ride-hailing—a huge IPO by Uber took the spotlight off Tesla long enough for it to become a new business focus for the automaker too—Musk told adoring fans and investors that soon their cars would become appreciating assets that earned money for them at night. And as an intermediary, Tesla would take a hefty cut for connecting the rider and the ridee.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1024608458-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1024608458-1152x648.jpg",
      "popularity_score": 145.21802694444443
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 17:26:08 +0000",
      "title": "Custom machine kept man alive without lungs for 48 hours",
      "neutral_headline": "Custom machine kept man alive without lungs for 48 hours",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/custom-machine-kept-man-alive-without-lungs-for-48-hours/",
          "published_at": "Thu, 29 Jan 2026 17:26:08 +0000",
          "title": "Custom machine kept man alive without lungs for 48 hours",
          "standfirst": "Infections had turned his lungs to soup and had to be cleared before transplant.",
          "content": "Humans can’t live without lungs. And yet for 48 hours, in a surgical suite at Northwestern University, a 33-year-old man lived with an empty cavity in his chest where his lungs used to be. He was kept alive by a custom-engineered artificial device that represented a desperate last-ditch effort by his doctors. The custom hardware solved a physiological puzzle that has made bilateral pneumonectomy, the removal of both lungs, extremely risky before now. The artificial lung system was built by the team of Ankit Bharat, a surgeon and researcher at Northwestern. It successfully kept a critically ill patient alive long enough to enable a double lung transplant, temporarily replacing his entire pulmonary system with a synthetic surrogate. The system creates a blueprint for saving people previously considered beyond hope by transplant teams. Melting lungs The patient, a once-healthy 33-year-old, arrived at the hospital with Influenza B complicated by a secondary, severe infection of Pseudomonas aeruginosa, a bacterium that in this case proved resistant even to carbapenems—our antibiotics of last resort. This combination of infections triggered acute respiratory distress syndrome (ARDS), a condition where the lungs become so inflamed and fluid-filled that oxygen can no longer reach the blood.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1358869815-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1358869815-1152x648.jpg",
      "popularity_score": 141.99052694444444
    },
    {
      "id": "cluster_105",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 22:28:19 +0000",
      "title": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
      "neutral_headline": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/2025-sees-teslas-annual-revenue-fall-for-the-first-time/",
          "published_at": "Wed, 28 Jan 2026 22:28:19 +0000",
          "title": "Tesla: 2024 was bad, 2025 was worse as profit falls 46 percent",
          "standfirst": "More than half its profit came from emissions credits as sales fell 8.6 percent.",
          "content": "Tesla published its financial results for 2025 this afternoon. If 2024 was a bad year for the electric automaker, 2025 was far worse: For the first time in Tesla's history, revenues fell year over year. A bad quarter Earlier this month, Tesla revealed its sales and production numbers for the fourth quarter of 2025, with a 16 percent decline compared to Q4 2024. Now we know the cost of those lost sales: Automotive revenues fell by 11 percent to $17.7 billion. Happily for Tesla, double-digit growth in its energy storage business ($3.8 billion, an increase of 25 percent) and services ($3.4 billion, an increase of 18 percent) made up some of the shortfall.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2205801667-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2205801667-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Thu, 29 Jan 2026 12:00:33 +0000",
      "title": "Early Universe's supermassive black holes grew in cocoons like butterflies",
      "neutral_headline": "Early Universe's supermassive black holes grew in cocoons like butterflies",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/early-universes-supermassive-black-holes-grew-in-cocoons-like-butterflies/",
          "published_at": "Thu, 29 Jan 2026 12:00:33 +0000",
          "title": "Early Universe's supermassive black holes grew in cocoons like butterflies",
          "standfirst": "During cocoon phase, young, supermassive black holes are surrounded by high-density gas.",
          "content": "When the James Webb Space Telescope sent its first high-definition infrared images back to Earth, astronomers noticed several tiny, glowing, crimson stains. These objects, quickly named “Little Red Dots,” were too bright to be normal galaxies, and too red to be simple star clusters. They appeared to house supermassive black holes that were far more massive than they had any right to be. But now a new study published in Nature suggests a solution to the Little Red Dots mystery. Scientists think young supermassive black holes may go through a “cocoon phase,” where they grow surrounded by high-density gas they feed on. These gaseous cocoons are likely what the JWST saw as the Little Red Dots. The overmassive black hole problem The first explanation scientists had for the Little Red Dots was that they were compact, distant galaxies, but something felt off about them right from the start. “They were too massive, since we saw they’d have to be completely filled with stars,” says Vadim Rusakov, an astronomer at the University of Manchester and lead author of the study. “They would need to produce stars at 100 percent efficiency, and that’s not what we’re used to seeing. Galaxies cannot produce stars at more than 20 percent efficiency, at least that’s what our current knowledge is.”Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/image-1-1152x648.png",
      "popularity_score": 136.56413805555556
    },
    {
      "id": "cluster_106",
      "coverage": 1,
      "updated_at": "Wed, 28 Jan 2026 22:06:41 +0000",
      "title": "Site catering to online criminals has been seized by the FBI",
      "neutral_headline": "Site catering to online criminals has been seized by the FBI",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/site-catering-to-online-criminals-has-been-seized-by-the-fbi/",
          "published_at": "Wed, 28 Jan 2026 22:06:41 +0000",
          "title": "Site catering to online criminals has been seized by the FBI",
          "standfirst": "One of the last holdouts for ransomware discussions, RAMP is taken down.",
          "content": "RAMP—the predominantly Russian-language online bazaar that billed itself as the “only place ransomware allowed”—had its dark web and clear web sites seized by the FBI as the agency tries to combat the growing scourge threatening critical infrastructure and organizations around the world. Visits to both sites on Wednesday returned pages that said the FBI had taken control of the RAMP domains, which mirrored each other. RAMP has been among the dwindling number of online crime forums to operate with impunity, following the takedown of other forums such as XSS, which saw its leader arrested last year by Europol. The vacuum left RAMP as one of the leading places for people pushing ransomware and other online threats to buy, sell, or trade products and services. I regret to inform you “The Federal Bureau of Investigation has seized RAMP,” a banner carrying the seals of the FBI and the Justice Department said. “This action has been taken in coordination with the United States Attorney’s Office for the Southern District of Florida and the Computer Crime and Intellectual Property Section of the Department of Justice.” The banner included a graphic that appeared on the RAMP site, before it was seized, that billed itself as the “only place ransomware allowed.”Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/network-outage.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/10/network-outage.jpg",
      "popularity_score": 133
    }
  ]
}