{
  "updated_at": "2026-02-08T19:19:29.720Z",
  "clusters": [
    {
      "id": "cluster_71",
      "coverage": 2,
      "updated_at": "Sat, 07 Feb 2026 13:00:00 +0000",
      "title": "How to track your sleep and view your sleep data in Apple Health",
      "neutral_headline": "How to track your sleep and view your sleep data in Apple Health",
      "bullet_summary": [
        "Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company)",
        "You'll unlock stickers that can be applied to said dice and they’ll interact with each other too",
        "Its creator, Daniel Zeller, (Zellah Games) has revealed a new project",
        "\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html",
          "published_at": "Sat, 07 Feb 2026 13:00:00 +0000",
          "title": "How to track your sleep and view your sleep data in Apple Health",
          "standfirst": "Apple Health brings sleep tracking, scheduling and long-term analysis into one place, with your iPhone acting as the hub and the Apple Watch doing the overnight monitoring. Once everything is set up, Apple Health can show how long you slept each night, how consistent your sleep schedule is and how much time you spend in different sleep stages. Here is how to get started, track your sleep and review your data.Sleep tracking in Apple Health relies on two things: You need to set up Sleep in the Health app on your iPhone, and you need a compatible Apple Watch to wear to bed. While you can set sleep schedules without a watch, detailed sleep data — including sleep stages — requires an Apple Watch.How to set up Sleep in Apple HealthSleep tracking is available on all watchOS 8 (or later) models and setup starts in the Health app on your iPhone. Open Health, tap Browse and then tap Sleep. If this is your first time setting it up, you will see an option to get started. Apple Health will guide you through choosing a sleep goal, setting a bedtime and wake-up time and deciding whether you want one sleep schedule for every day or different schedules for weekdays and weekends.During setup, you can also enable sleep reminders and a wind-down period. Wind Down reduces distractions before bedtime by activating features like Focus mode and dimming notifications at a set time before sleep. These settings are optional but they help keep your schedule consistent, which improves the quality of the data Apple Health collects over time.Once Sleep is configured, Apple Health automatically syncs those settings to your Apple Watch. You can adjust your sleep schedule later by returning to the Sleep section in Health and tapping Full Schedule and Options. Any changes you make here update on both your iPhone and Apple Watch.How to prepare your Apple Watch for sleep trackingTo track sleep, your Apple Watch needs to be worn overnight and have enough battery to last until morning. If the battery drops below 30 percent before bedtime, your watch will prompt you to charge it first. Sleep tracking also relies on Sleep Focus which activates automatically based on your sleep schedule. Once Sleep Focus has been set, open the Settings app on your Apple Watch, tap Sleep and ensure that Track Sleep with Apple Watch is turned on. With both features enabled your watch can monitor sleep automatically without any manual start or stop each night. Comfort matters when wearing a watch to bed, so many people prefer a softer band for sleep. As long as the watch fits securely and stays in contact with your wrist, it can track sleep without issue.The Apple Watch Series 11 on a person's wrist, showing a ring with three segmented arcs encircling a Sleep Score of 53 and the description \"OK\" in the bottom left.Cherlynn Low for EngadgetHow Apple Watch tracks your sleepWhen Sleep Focus is active, the Apple Watch uses its accelerometer and heart rate sensor to detect when you are asleep and awake. Newer models also track sleep stages, including time spent in REM, core and deep sleep. Apple Health combines this information into a single overnight record that appears in the Sleep section the next morning.You do not need to start or stop sleep tracking manually. As long as you follow your sleep schedule or enable Sleep Focus before bed, the Apple Watch automatically does everything else. If you wake up early or go to bed later than planned, Apple Health adjusts the data based on actual movement and heart rate rather than just your scheduled times. In addition, some Apple Watch models (SE 3 or higher) support on-device Siri, enabling you to ask questions such as “how much sleep did I have last night?” for a more immediate response. How to view your sleep data in Apple HealthTo see your sleep data, open the Health app on your iPhone and tap Browse, then Sleep. At the top of the screen, you will see a chart showing how long you slept the previous night. Tapping this chart reveals a detailed breakdown, including time asleep, time in bed and sleep stages (if available).Scrolling down shows trends over longer periods. You can switch between daily, weekly, monthly and six-month views to see patterns in your sleep duration and consistency. Apple Health also highlights whether you are meeting your sleep goal and how regular your schedule has been.Under Highlights, Apple Health may surface insights such as changes in average sleep time, variations in sleep stages or your nightly sleep score. Sleep scores provide a simplified summary of how well you slept, and is based on factors such as duration, consistency and restfulness. These summaries update automatically as more data is collected over time.Understanding sleep stages and trendsIf your Apple Watch supports sleep stages, Apple Health displays how much time you spent in REM, core and deep sleep. These stages give context to your overall sleep quality, though Apple emphasizes trends over individual nights. Occasional short nights or unusual stage distributions are normal.Over time, Apple Health makes it easier to spot patterns. Consistently short sleep durations, irregular bedtimes or frequent awakenings become clearer when viewing weekly or monthly summaries. This makes the Sleep section useful not just for nightly check-ins but for understanding longer-term habits.Editing and managing sleep dataApple Health allows you to add or edit sleep data if needed manually. In the Sleep section, tap Add Data to log sleep that was not recorded automatically. This can be useful if you forget to wear your watch or take a nap without it.You can also manage which devices contribute sleep data by scrolling to the bottom of the Sleep screen and tapping Data Sources and Access. This is helpful if you use third-party sleep apps or multiple devices.Once set up, sleep tracking in Apple Health runs quietly in the background. With a consistent schedule and a charged Apple Watch, your sleep data builds into a clear picture of your nightly rest, all stored securely within Apple’s health platform.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html?src=rss",
          "content": "Apple Health brings sleep tracking, scheduling and long-term analysis into one place, with your iPhone acting as the hub and the Apple Watch doing the overnight monitoring. Once everything is set up, Apple Health can show how long you slept each night, how consistent your sleep schedule is and how much time you spend in different sleep stages. Here is how to get started, track your sleep and review your data.Sleep tracking in Apple Health relies on two things: You need to set up Sleep in the Health app on your iPhone, and you need a compatible Apple Watch to wear to bed. While you can set sleep schedules without a watch, detailed sleep data — including sleep stages — requires an Apple Watch.How to set up Sleep in Apple HealthSleep tracking is available on all watchOS 8 (or later) models and setup starts in the Health app on your iPhone. Open Health, tap Browse and then tap Sleep. If this is your first time setting it up, you will see an option to get started. Apple Health will guide you through choosing a sleep goal, setting a bedtime and wake-up time and deciding whether you want one sleep schedule for every day or different schedules for weekdays and weekends.During setup, you can also enable sleep reminders and a wind-down period. Wind Down reduces distractions before bedtime by activating features like Focus mode and dimming notifications at a set time before sleep. These settings are optional but they help keep your schedule consistent, which improves the quality of the data Apple Health collects over time.Once Sleep is configured, Apple Health automatically syncs those settings to your Apple Watch. You can adjust your sleep schedule later by returning to the Sleep section in Health and tapping Full Schedule and Options. Any changes you make here update on both your iPhone and Apple Watch.How to prepare your Apple Watch for sleep trackingTo track sleep, your Apple Watch needs to be worn overnight and have enough battery to last until morning. If the battery drops below 30 percent before bedtime, your watch will prompt you to charge it first. Sleep tracking also relies on Sleep Focus which activates automatically based on your sleep schedule. Once Sleep Focus has been set, open the Settings app on your Apple Watch, tap Sleep and ensure that Track Sleep with Apple Watch is turned on. With both features enabled your watch can monitor sleep automatically without any manual start or stop each night. Comfort matters when wearing a watch to bed, so many people prefer a softer band for sleep. As long as the watch fits securely and stays in contact with your wrist, it can track sleep without issue.The Apple Watch Series 11 on a person's wrist, showing a ring with three segmented arcs encircling a Sleep Score of 53 and the description \"OK\" in the bottom left.Cherlynn Low for EngadgetHow Apple Watch tracks your sleepWhen Sleep Focus is active, the Apple Watch uses its accelerometer and heart rate sensor to detect when you are asleep and awake. Newer models also track sleep stages, including time spent in REM, core and deep sleep. Apple Health combines this information into a single overnight record that appears in the Sleep section the next morning.You do not need to start or stop sleep tracking manually. As long as you follow your sleep schedule or enable Sleep Focus before bed, the Apple Watch automatically does everything else. If you wake up early or go to bed later than planned, Apple Health adjusts the data based on actual movement and heart rate rather than just your scheduled times. In addition, some Apple Watch models (SE 3 or higher) support on-device Siri, enabling you to ask questions such as “how much sleep did I have last night?” for a more immediate response. How to view your sleep data in Apple HealthTo see your sleep data, open the Health app on your iPhone and tap Browse, then Sleep. At the top of the screen, you will see a chart showing how long you slept the previous night. Tapping this chart reveals a detailed breakdown, including time asleep, time in bed and sleep stages (if available).Scrolling down shows trends over longer periods. You can switch between daily, weekly, monthly and six-month views to see patterns in your sleep duration and consistency. Apple Health also highlights whether you are meeting your sleep goal and how regular your schedule has been.Under Highlights, Apple Health may surface insights such as changes in average sleep time, variations in sleep stages or your nightly sleep score. Sleep scores provide a simplified summary of how well you slept, and is based on factors such as duration, consistency and restfulness. These summaries update automatically as more data is collected over time.Understanding sleep stages and trendsIf your Apple Watch supports sleep stages, Apple Health displays how much time you spent in REM, core and deep sleep. These stages give context to your overall sleep quality, though Apple emphasizes trends over individual nights. Occasional short nights or unusual stage distributions are normal.Over time, Apple Health makes it easier to spot patterns. Consistently short sleep durations, irregular bedtimes or frequent awakenings become clearer when viewing weekly or monthly summaries. This makes the Sleep section useful not just for nightly check-ins but for understanding longer-term habits.Editing and managing sleep dataApple Health allows you to add or edit sleep data if needed manually. In the Sleep section, tap Add Data to log sleep that was not recorded automatically. This can be useful if you forget to wear your watch or take a nap without it.You can also manage which devices contribute sleep data by scrolling to the bottom of the Sleep screen and tapping Data Sources and Access. This is helpful if you use third-party sleep apps or multiple devices.Once set up, sleep tracking in Apple Health runs quietly in the background. With a consistent schedule and a charged Apple Watch, your sleep data builds into a clear picture of your nightly rest, all stored securely within Apple’s health platform.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html?src=rss",
          "feed_position": 9,
          "image_url": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/acf51d20-9296-11f0-9146-7e82dd205a74"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html",
          "published_at": "Sat, 07 Feb 2026 12:00:00 +0000",
          "title": "Hotline Miami meets football, the power of video editing and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. As always, we've got a bunch of neat games to tell you about. Perhaps I'll tear myself away from playing as Chappell Roan in Fortnite or Jetpack Cat in Overwatch long enough to check more of them out.Thanks to the folks at Aftermath, I learned about a short, text-based game from Woe Industries from a while back called You Have Billions Invested In Generative AI. Surprisingly enough, you take on the role of a venture capitalist who has plowed gobs of money into genAI technology and might be starting to have doubts about that investment. Other characters warn you about the dangers of the tech and real-life headlines showing the impact of genAI hallucinations pop up. It's tagged as a horror game, for what it's worth. It's both satirical and all too real, and it's pretty funny. Plus, any game that allows me to yell at Noam Chomsky is A-OK in my book. You can play You Have Billions Invested In Generative AI for free on Itch.io.New releasesTackle for Loss had a very timely arrival this week, just ahead of a certain other big, real-life game. This is a football-themed take on action-heavy, top-down games like Hotline Miami. Developer Indifferent Penguin took some inspiration from the Taken film series as well — you take on the role of a CTE-afflicted former football player who sets out to rescue his kidnapped daughter.The combat sounds pretty interesting here. You need to clear out all of the bad guys on each floor of a multistory building before you can progress, but you only have four offensive actions at your disposal each time (this draws from the four-down format of football). You'll need to plan things out before you go on the attack, not least because your character and the enemies all die in a single hit.Tackle for Loss is out now on Steam. It'll usually run you $11, but it's 15 percent off until February 12. Trust Me, I Nailed It is an intriguing turn-based strategy game from Team Afternoon and publisher Jungle Game Lab. A useless warrior hires you as a video editor to make them look like a true hero capable of slaying any beast. Enemy attacks and other actions appear on the edit timeline as pre-recorded footage, and the idea is to plot out the warrior's movements around those. You have post-processing visual effects tricks at your disposal, so you can let the warrior teleport and convert low-power strikes into critical hits.It's a fun idea, and a reminder (as if we should need one in the current climate) not to always take videos at face value. Trust Me, I Nailed It is on Steam now and it's free-to-play.Tomb of the Bloodletter is a spin on the roguelike deckbuilder genre that I haven't really seen before. Your deck consists of magic powers that are applied to letters of the alphabet. Spelling out words using these Magicks can result in powerful combinations, particularly if you use the same letter multiple times. That's right, this is a typing game — a roguelike deckbuilder that the likes of Wordle players might be interested in.It's really about coming up with words that put the right letters in a specific order. For instance, certain letters are more effective if you place them at the end of a word. So, this should get your brain ticking. Tomb of the Bloodletter — from Ethan's Secretions and indie.io — debuted during the Steam Typing Fest. It'll typically cost $8, but there's a 20 percent discount until February 19.Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company). It's set in the same universe as Secret Door's Sunderfolk. The action plays out on a hexagonal board with randomized rooms and enemies. Positioning will be key, and finding synergies between the abilities of the playable characters will put you in good stead.Shadowstone will hit Steam in early access later this year for $15. It's also coming to the Epic Games Store.Meanwhile, a major update for Sunderfolk is set to go live on March 10. It will introduce a new tank-style character and two fresh sets of missions. Secret Door will also add two much-requested features to PC versions: online multiplayer and — so you don't have to use your phone to play the game anymore — mouse and keyboard controls.I really loved Planet of Lana and the sequel is among my most-anticipated games of this year. There's now a release date for the upcoming puzzle platformer. Wishfully and Thunderful Publishing are bringing it to Steam, Xbox, PlayStation and Nintendo Switch on March 5. It'll also be on Game Pass on day one.A Planet of Lana II: Children of the Leaf demo will hit Steam, Xbox and PlayStation on February 11. It will arrive on Switch a bit later.Is Sticker/Ball the first Ball x Pit-like? I'm not entirely sure. Still, it is now firmly on my radar. Instead of firing balls at a horde of constantly-advancing enemies, here you'll shoot them at dice to earn points. You'll unlock stickers that can be applied to said dice and they’ll interact with each other too. For instance, spiders can create webs and these can catch flies that are attracted to poop stickers. The trailer describes another interaction, \"frog jumped and triggered cigarette pack.\" Frogs can also hijack spaceships, apparently, and there's a bouncing DVD (well, \"VID\") logo. There are more than 100 types of stickers and dozens of different enemies.I don't really understand what's going on in the trailer, but it's somehow making my brain happy, so this is going on my wishlist. Solo dev Bilge is behind Sticker/Ball, which is coming to Steam soon through the help of publisher Future Friends Games. A demo is available now, so that's my weekend sorted.Skate City has long been one of the best games on Apple Arcade. Its creator, Daniel Zeller, (Zellah Games) has revealed a new project. Skate Style is billed as a \"next-gen skateboarding game with high-end graphics.\" You'll be able to take to the virtual streets of Barcelona and Prague to show off your best moves. What could help Skate Style really stand out from the pack is the animation editor, which enables you to create completely new tricks. The game is slated to have an \"advanced\" character creation tool as well as mod support, so there'll be a high level of customization available. A Skate Style demo is available on Steam now. The full game should land on PC later this year. Here's hoping the soundtrack can match up to those from the Tony Hawk's Pro Skater series.Crimson Capes is billed as a 2D Soulslike action RPG with four playable characters, elemental magic, more than 25 bosses, swordfighting, lots of secrets, co-op, optional hunts with randomized dungeons and invasions from other players. That all sounds neat enough, but most exciting to me here is the pixel-art, rotoscoped animation work. It looks modern and retro at the same time, and I'd love to see this sort of style in more games. I also dig that you get a PDF instruction manual and game guide as well as a printable world map when you buy the game.You (and I) won't have to wait long to play Crimson Capes, which is from Poor Locke. It's coming to Steam on February 12 for $15, though you'll get 10 percent off if you pick it up within the first nine days. Console versions are in the pipeline too. This article originally appeared on Engadget at https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. As always, we've got a bunch of neat games to tell you about. Perhaps I'll tear myself away from playing as Chappell Roan in Fortnite or Jetpack Cat in Overwatch long enough to check more of them out.Thanks to the folks at Aftermath, I learned about a short, text-based game from Woe Industries from a while back called You Have Billions Invested In Generative AI. Surprisingly enough, you take on the role of a venture capitalist who has plowed gobs of money into genAI technology and might be starting to have doubts about that investment. Other characters warn you about the dangers of the tech and real-life headlines showing the impact of genAI hallucinations pop up. It's tagged as a horror game, for what it's worth. It's both satirical and all too real, and it's pretty funny. Plus, any game that allows me to yell at Noam Chomsky is A-OK in my book. You can play You Have Billions Invested In Generative AI for free on Itch.io.New releasesTackle for Loss had a very timely arrival this week, just ahead of a certain other big, real-life game. This is a football-themed take on action-heavy, top-down games like Hotline Miami. Developer Indifferent Penguin took some inspiration from the Taken film series as well — you take on the role of a CTE-afflicted former football player who sets out to rescue his kidnapped daughter.The combat sounds pretty interesting here. You need to clear out all of the bad guys on each floor of a multistory building before you can progress, but you only have four offensive actions at your disposal each time (this draws from the four-down format of football). You'll need to plan things out before you go on the attack, not least because your character and the enemies all die in a single hit.Tackle for Loss is out now on Steam. It'll usually run you $11, but it's 15 percent off until February 12. Trust Me, I Nailed It is an intriguing turn-based strategy game from Team Afternoon and publisher Jungle Game Lab. A useless warrior hires you as a video editor to make them look like a true hero capable of slaying any beast. Enemy attacks and other actions appear on the edit timeline as pre-recorded footage, and the idea is to plot out the warrior's movements around those. You have post-processing visual effects tricks at your disposal, so you can let the warrior teleport and convert low-power strikes into critical hits.It's a fun idea, and a reminder (as if we should need one in the current climate) not to always take videos at face value. Trust Me, I Nailed It is on Steam now and it's free-to-play.Tomb of the Bloodletter is a spin on the roguelike deckbuilder genre that I haven't really seen before. Your deck consists of magic powers that are applied to letters of the alphabet. Spelling out words using these Magicks can result in powerful combinations, particularly if you use the same letter multiple times. That's right, this is a typing game — a roguelike deckbuilder that the likes of Wordle players might be interested in.It's really about coming up with words that put the right letters in a specific order. For instance, certain letters are more effective if you place them at the end of a word. So, this should get your brain ticking. Tomb of the Bloodletter — from Ethan's Secretions and indie.io — debuted during the Steam Typing Fest. It'll typically cost $8, but there's a 20 percent discount until February 19.Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company). It's set in the same universe as Secret Door's Sunderfolk. The action plays out on a hexagonal board with randomized rooms and enemies. Positioning will be key, and finding synergies between the abilities of the playable characters will put you in good stead.Shadowstone will hit Steam in early access later this year for $15. It's also coming to the Epic Games Store.Meanwhile, a major update for Sunderfolk is set to go live on March 10. It will introduce a new tank-style character and two fresh sets of missions. Secret Door will also add two much-requested features to PC versions: online multiplayer and — so you don't have to use your phone to play the game anymore — mouse and keyboard controls.I really loved Planet of Lana and the sequel is among my most-anticipated games of this year. There's now a release date for the upcoming puzzle platformer. Wishfully and Thunderful Publishing are bringing it to Steam, Xbox, PlayStation and Nintendo Switch on March 5. It'll also be on Game Pass on day one.A Planet of Lana II: Children of the Leaf demo will hit Steam, Xbox and PlayStation on February 11. It will arrive on Switch a bit later.Is Sticker/Ball the first Ball x Pit-like? I'm not entirely sure. Still, it is now firmly on my radar. Instead of firing balls at a horde of constantly-advancing enemies, here you'll shoot them at dice to earn points. You'll unlock stickers that can be applied to said dice and they’ll interact with each other too. For instance, spiders can create webs and these can catch flies that are attracted to poop stickers. The trailer describes another interaction, \"frog jumped and triggered cigarette pack.\" Frogs can also hijack spaceships, apparently, and there's a bouncing DVD (well, \"VID\") logo. There are more than 100 types of stickers and dozens of different enemies.I don't really understand what's going on in the trailer, but it's somehow making my brain happy, so this is going on my wishlist. Solo dev Bilge is behind Sticker/Ball, which is coming to Steam soon through the help of publisher Future Friends Games. A demo is available now, so that's my weekend sorted.Skate City has long been one of the best games on Apple Arcade. Its creator, Daniel Zeller, (Zellah Games) has revealed a new project. Skate Style is billed as a \"next-gen skateboarding game with high-end graphics.\" You'll be able to take to the virtual streets of Barcelona and Prague to show off your best moves. What could help Skate Style really stand out from the pack is the animation editor, which enables you to create completely new tricks. The game is slated to have an \"advanced\" character creation tool as well as mod support, so there'll be a high level of customization available. A Skate Style demo is available on Steam now. The full game should land on PC later this year. Here's hoping the soundtrack can match up to those from the Tony Hawk's Pro Skater series.Crimson Capes is billed as a 2D Soulslike action RPG with four playable characters, elemental magic, more than 25 bosses, swordfighting, lots of secrets, co-op, optional hunts with randomized dungeons and invasions from other players. That all sounds neat enough, but most exciting to me here is the pixel-art, rotoscoped animation work. It looks modern and retro at the same time, and I'd love to see this sort of style in more games. I also dig that you get a PDF instruction manual and game guide as well as a printable world map when you buy the game.You (and I) won't have to wait long to play Crimson Capes, which is from Poor Locke. It's coming to Steam on February 12 for $15, though you'll get 10 percent off if you pick it up within the first nine days. Console versions are in the pipeline too. This article originally appeared on Engadget at https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html?src=rss",
          "feed_position": 11
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/technology/what-the-openclaw-moment-means-for-enterprises-5-big-takeaways",
          "published_at": "Fri, 06 Feb 2026 22:50:00 GMT",
          "title": "What the OpenClaw moment means for enterprises: 5 big takeaways",
          "standfirst": "The \"OpenClaw moment\" represents the first time autonomous AI agents have successfully \"escaped the lab\" and moved into the hands of the general workforce. Originally developed by Austrian engineer Peter Steinberger as a hobby project called \"Clawdbot\" in November 2025, the framework went through a rapid branding evolution to \"Moltbot\" before settling on \"OpenClaw\" in late January 2026. Unlike previous chatbots, OpenClaw is designed with \"hands\"—the ability to execute shell commands, manage local files, and navigate messaging platforms like WhatsApp and Slack with persistent, root-level permissions.This capability — and the uptake of what was then called Moltbot by many AI power users on X — directly led another entrepreneur, Matt Schlicht, to develop Moltbook, a social network where thousands of OpenClaw-powered agents autonomously sign up and interact. The result has been a series of bizarre, unverified reports that have set the tech world ablaze: agents reportedly forming digital \"religions\" like Crustafarianism, hiring human micro-workers for digital tasks on another website, \"Rentahuman,\" and in some extreme unverified cases, attempting to lock their own human creators out of their credentials.For IT leaders, the timing is critical. This week, the release of Claude Opus 4.6 and OpenAI’s Frontier agent creation platform signaled that the industry is moving from single agents to \"agent teams.\" Simultaneously, the \"SaaSpocalypse\"—a massive market correction that wiped over $800 billion from software valuations—has proven that the traditional seat-based licensing model is under existential threat.So how should enterprise technical decision-makers think through this fast-moving start to the year, and how can they start to understand what OpenClaw means for their businesses? I spoke to a small group of leaders at the forefront of enterprise AI adoption this week to get their thoughts. Here&#x27;s what I learned:1. The death of over-engineering: productive AI works on \"garbage\" dataThe prevailing wisdom once suggested that enterprises needed massive infrastructure overhauls and perfectly curated data sets before AI could be useful. The OpenClaw moment has shattered that myth, proving that modern models can navigate messy, uncurated data by treating \"intelligence as a service.\"\"The first takeaway is the amount of preparation that we need to do to make AI productive,\" says Tanmai Gopal, Co-founder & CEO at PromptQL, a well-funded enterprise data engineering and consulting firm. \"There is a surprising insight there: you actually don&#x27;t need to do too much preparation. Everybody thought we needed new software and new AI-native companies to come and do things. It will catalyze more disruption as leadership realizes that we don&#x27;t actually need to prep so much to get AI to be productive. We need to prep in different ways. You can just let it be and say, &#x27;go read all of this context and explore all of this data and tell me where there are dragons or flaws.&#x27;\"\"The data is already there,\" agreed Rajiv Dattani, co-founder of AIUC (the AI Underwriting Corporation), which has developed the AIUC-1 standard for AI agents as part of a consortium with leaders from Anthropic, Google, CISCO, Stanford and MIT. \"But the compliance and the safeguards, and most importantly, the institutional trust is not. How can you ensure your agentic systems don&#x27;t go off and go full MechaHitler and start offending people or causing problems?\" Hence why Dattani&#x27;s company, AUIC, provides a certification standard, AIUC-1, that enterprises can put agents through in order to obtain insurance that backs them up in event they do cause problems. Without putting OpenClaw agents or other similar agents through such a process, enterprises are likely less ready to accept the consequences and costs of autonomy gone awry. 2. The rise of the \"secret cyborgs\": shadow IT is the new normalWith OpenClaw amassing over 160,000 GitHub stars, employees are deploying local agents through the back door to stay productive. This creates a \"Shadow IT\" crisis where agents often run with full user-level permissions, potentially creating backdoors into corporate systems (as Wharton School of Business Professor Ethan Mollick has written, many employees are secretly adopting AI to get ahead at work and obtain more leisure time, without informing superiors or the organization). Now, executives are actually observing this trend in realtime as employees deploy OpenClaw on work machines without authorization.\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal. \"There are companies finding engineers who have given OpenClaw access to their devices. In larger enterprises, you&#x27;re going to notice that you&#x27;ve given root-level access to your machine. People want tools so tools can do their jobs, but enterprises are concerned.\"Brianne Kimmel, Founder & Managing Partner of venture capital firm Worklife Ventures, views this through a talent-retention lens. \"People are trying these on evenings and weekends, and it’s hard for companies to ensure employees aren’t trying the latest technologies. From my perspective, we&#x27;ve seen how that really allows teams to stay sharp. I have always erred on the side of encouraging, especially early-career folks, to try all of the latest tools.\"3. The collapse of seat-based pricing as a viable business modelThe 2026 \"SaaSpocalypse\" saw massive value erased from software indices as investors realized agents could replace human headcount. If an autonomous agent can perform the work of dozens of human users, the traditional \"per-seat\" business model becomes a liability for legacy vendors.\"If you have AI that can log into a product and do all the work, why do you need 1,000 users at your company to have access to that tool?\" Hamal asks. \"Anyone that does user-based pricing—it&#x27;s probably a real concern. That&#x27;s probably what you&#x27;re seeing with the decay in SaaS valuations, because anybody that is indexed to users or discrete units of &#x27;jobs to be done&#x27; needs to rethink their business model.\"4. Transitioning to an \"AI coworker\" modelThe release of Claude Opus 4.6 and OpenAI’s Frontier this week already signals a shift from single agents to coordinated \"agent teams.\" In this environment, the volume of AI-generated code and content is so high that traditional human-led review is no longer physically possible.\"Our senior engineers just cannot keep up with the volume of code being generated; they can&#x27;t do code reviews anymore,\" Gopal notes. \"Now we have an entirely different product development lifecycle where everyone needs to be trained to be a product person. Instead of doing code reviews, you work on a code review agent that people maintain. You&#x27;re looking at software that was 100% vibe-coded... it&#x27;s glitchy, it&#x27;s not perfect, but dude, it works.\"\"The productivity increases are impressive,\" Dattani concurred. \"It&#x27;s clear that we are at the onset of a major shift in business globally, but each business will need to approach that slightly differently depending on their specific data security and safety requirements. Remember that even while you&#x27;re trying to outdo your competition, they are bound by the same rules and regulations as you — and it&#x27;s worth it to take time to get it right, start small, don&#x27;t try to do too much at once.\" 5. Future outlook: voice interfaces, personality, and global scalingThe experts I spoke to all see a future where \"vibe working\" becomes the norm. Local, personality-driven AI—including through voice interfaces like Wispr or ElevenLabs powered OpenClaw agents—will become the primary interface for work, while agents handle the heavy lifting of international expansion.\"Voice is the primary interface for AI; it keeps people off their phones and improves quality of life,\" says Kimmel. \"The more you can give AI a personality that you&#x27;ve uniquely designed, the better the experience. Previously, you&#x27;d need to hire a GM in a new country and build a translation team. Now, companies can think international from day one with a localized lens.\"Hamal adds a broader perspective on the global stakes: \"We have knowledge worker AGI. It&#x27;s proven it can be done. Security is a concern that will rate-limit enterprise adoption, which means they&#x27;re more vulnerable to disruption from the low end of the market who don&#x27;t have the same concerns.\"Best practices for enterprise leaders seeking to embrace agentic AI capabilities at workAs OpenClaw and similar autonomous frameworks proliferate, IT departments must move beyond blanket bans toward structured governance. Use the following checklist to manage the \"Agentic Wave\" safely:Implement Identity-Based Governance: Every agent must have a strong, attributable identity tied to a human owner or team. Use frameworks like IBC (Identity, Boundaries, Context) to track who an agent is and what it is allowed to do at any moment.Enforce Sandbox Requirements: Prohibit OpenClaw from running on systems with access to live production data. All experimentation should occur in isolated, purpose-built sandboxes on segregated hardware.Audit Third-Party \"Skills\": Recent reports indicate nearly 20% of skills in the ClawHub registry contain vulnerabilities or malicious code. Mandate a \"white-list only\" policy for approved agent plugins.Disable Unauthenticated Gateways: Early versions of OpenClaw allowed \"none\" as an authentication mode. Ensure all instances are updated to current versions where strong authentication is mandatory and enforced by default.Monitor for \"Shadow Agents\": Use endpoint detection tools to scan for unauthorized OpenClaw installations or abnormal API traffic to external LLM providers.Update AI Policy for Autonomy: Standard Generative AI policies often fail to address \"agents.\" Update policies to explicitly define human-in-the-loop requirements for high-risk actions like financial transfers or file system modifications.",
          "content": "The \"OpenClaw moment\" represents the first time autonomous AI agents have successfully \"escaped the lab\" and moved into the hands of the general workforce. Originally developed by Austrian engineer Peter Steinberger as a hobby project called \"Clawdbot\" in November 2025, the framework went through a rapid branding evolution to \"Moltbot\" before settling on \"OpenClaw\" in late January 2026. Unlike previous chatbots, OpenClaw is designed with \"hands\"—the ability to execute shell commands, manage local files, and navigate messaging platforms like WhatsApp and Slack with persistent, root-level permissions.This capability — and the uptake of what was then called Moltbot by many AI power users on X — directly led another entrepreneur, Matt Schlicht, to develop Moltbook, a social network where thousands of OpenClaw-powered agents autonomously sign up and interact. The result has been a series of bizarre, unverified reports that have set the tech world ablaze: agents reportedly forming digital \"religions\" like Crustafarianism, hiring human micro-workers for digital tasks on another website, \"Rentahuman,\" and in some extreme unverified cases, attempting to lock their own human creators out of their credentials.For IT leaders, the timing is critical. This week, the release of Claude Opus 4.6 and OpenAI’s Frontier agent creation platform signaled that the industry is moving from single agents to \"agent teams.\" Simultaneously, the \"SaaSpocalypse\"—a massive market correction that wiped over $800 billion from software valuations—has proven that the traditional seat-based licensing model is under existential threat.So how should enterprise technical decision-makers think through this fast-moving start to the year, and how can they start to understand what OpenClaw means for their businesses? I spoke to a small group of leaders at the forefront of enterprise AI adoption this week to get their thoughts. Here&#x27;s what I learned:1. The death of over-engineering: productive AI works on \"garbage\" dataThe prevailing wisdom once suggested that enterprises needed massive infrastructure overhauls and perfectly curated data sets before AI could be useful. The OpenClaw moment has shattered that myth, proving that modern models can navigate messy, uncurated data by treating \"intelligence as a service.\"\"The first takeaway is the amount of preparation that we need to do to make AI productive,\" says Tanmai Gopal, Co-founder & CEO at PromptQL, a well-funded enterprise data engineering and consulting firm. \"There is a surprising insight there: you actually don&#x27;t need to do too much preparation. Everybody thought we needed new software and new AI-native companies to come and do things. It will catalyze more disruption as leadership realizes that we don&#x27;t actually need to prep so much to get AI to be productive. We need to prep in different ways. You can just let it be and say, &#x27;go read all of this context and explore all of this data and tell me where there are dragons or flaws.&#x27;\"\"The data is already there,\" agreed Rajiv Dattani, co-founder of AIUC (the AI Underwriting Corporation), which has developed the AIUC-1 standard for AI agents as part of a consortium with leaders from Anthropic, Google, CISCO, Stanford and MIT. \"But the compliance and the safeguards, and most importantly, the institutional trust is not. How can you ensure your agentic systems don&#x27;t go off and go full MechaHitler and start offending people or causing problems?\" Hence why Dattani&#x27;s company, AUIC, provides a certification standard, AIUC-1, that enterprises can put agents through in order to obtain insurance that backs them up in event they do cause problems. Without putting OpenClaw agents or other similar agents through such a process, enterprises are likely less ready to accept the consequences and costs of autonomy gone awry. 2. The rise of the \"secret cyborgs\": shadow IT is the new normalWith OpenClaw amassing over 160,000 GitHub stars, employees are deploying local agents through the back door to stay productive. This creates a \"Shadow IT\" crisis where agents often run with full user-level permissions, potentially creating backdoors into corporate systems (as Wharton School of Business Professor Ethan Mollick has written, many employees are secretly adopting AI to get ahead at work and obtain more leisure time, without informing superiors or the organization). Now, executives are actually observing this trend in realtime as employees deploy OpenClaw on work machines without authorization.\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal. \"There are companies finding engineers who have given OpenClaw access to their devices. In larger enterprises, you&#x27;re going to notice that you&#x27;ve given root-level access to your machine. People want tools so tools can do their jobs, but enterprises are concerned.\"Brianne Kimmel, Founder & Managing Partner of venture capital firm Worklife Ventures, views this through a talent-retention lens. \"People are trying these on evenings and weekends, and it’s hard for companies to ensure employees aren’t trying the latest technologies. From my perspective, we&#x27;ve seen how that really allows teams to stay sharp. I have always erred on the side of encouraging, especially early-career folks, to try all of the latest tools.\"3. The collapse of seat-based pricing as a viable business modelThe 2026 \"SaaSpocalypse\" saw massive value erased from software indices as investors realized agents could replace human headcount. If an autonomous agent can perform the work of dozens of human users, the traditional \"per-seat\" business model becomes a liability for legacy vendors.\"If you have AI that can log into a product and do all the work, why do you need 1,000 users at your company to have access to that tool?\" Hamal asks. \"Anyone that does user-based pricing—it&#x27;s probably a real concern. That&#x27;s probably what you&#x27;re seeing with the decay in SaaS valuations, because anybody that is indexed to users or discrete units of &#x27;jobs to be done&#x27; needs to rethink their business model.\"4. Transitioning to an \"AI coworker\" modelThe release of Claude Opus 4.6 and OpenAI’s Frontier this week already signals a shift from single agents to coordinated \"agent teams.\" In this environment, the volume of AI-generated code and content is so high that traditional human-led review is no longer physically possible.\"Our senior engineers just cannot keep up with the volume of code being generated; they can&#x27;t do code reviews anymore,\" Gopal notes. \"Now we have an entirely different product development lifecycle where everyone needs to be trained to be a product person. Instead of doing code reviews, you work on a code review agent that people maintain. You&#x27;re looking at software that was 100% vibe-coded... it&#x27;s glitchy, it&#x27;s not perfect, but dude, it works.\"\"The productivity increases are impressive,\" Dattani concurred. \"It&#x27;s clear that we are at the onset of a major shift in business globally, but each business will need to approach that slightly differently depending on their specific data security and safety requirements. Remember that even while you&#x27;re trying to outdo your competition, they are bound by the same rules and regulations as you — and it&#x27;s worth it to take time to get it right, start small, don&#x27;t try to do too much at once.\" 5. Future outlook: voice interfaces, personality, and global scalingThe experts I spoke to all see a future where \"vibe working\" becomes the norm. Local, personality-driven AI—including through voice interfaces like Wispr or ElevenLabs powered OpenClaw agents—will become the primary interface for work, while agents handle the heavy lifting of international expansion.\"Voice is the primary interface for AI; it keeps people off their phones and improves quality of life,\" says Kimmel. \"The more you can give AI a personality that you&#x27;ve uniquely designed, the better the experience. Previously, you&#x27;d need to hire a GM in a new country and build a translation team. Now, companies can think international from day one with a localized lens.\"Hamal adds a broader perspective on the global stakes: \"We have knowledge worker AGI. It&#x27;s proven it can be done. Security is a concern that will rate-limit enterprise adoption, which means they&#x27;re more vulnerable to disruption from the low end of the market who don&#x27;t have the same concerns.\"Best practices for enterprise leaders seeking to embrace agentic AI capabilities at workAs OpenClaw and similar autonomous frameworks proliferate, IT departments must move beyond blanket bans toward structured governance. Use the following checklist to manage the \"Agentic Wave\" safely:Implement Identity-Based Governance: Every agent must have a strong, attributable identity tied to a human owner or team. Use frameworks like IBC (Identity, Boundaries, Context) to track who an agent is and what it is allowed to do at any moment.Enforce Sandbox Requirements: Prohibit OpenClaw from running on systems with access to live production data. All experimentation should occur in isolated, purpose-built sandboxes on segregated hardware.Audit Third-Party \"Skills\": Recent reports indicate nearly 20% of skills in the ClawHub registry contain vulnerabilities or malicious code. Mandate a \"white-list only\" policy for approved agent plugins.Disable Unauthenticated Gateways: Early versions of OpenClaw allowed \"none\" as an authentication mode. Ensure all instances are updated to current versions where strong authentication is mandatory and enforced by default.Monitor for \"Shadow Agents\": Use endpoint detection tools to scan for unauthorized OpenClaw installations or abnormal API traffic to external LLM providers.Update AI Policy for Autonomy: Standard Generative AI policies often fail to address \"agents.\" Update policies to explicitly define human-in-the-loop requirements for high-risk actions like financial transfers or file system modifications.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3q67hIphrWar1zZdhKR2ss/1f8157dcb5adbad8e42943351fa74f42/XR7z-YHBn3iPBbV1IrWrk_w5M6NPon.png?w=300&q=30"
        }
      ],
      "featured_image": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/acf51d20-9296-11f0-9146-7e82dd205a74",
      "popularity_score": 2000
    },
    {
      "id": "cluster_89",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 23:40:58 +0000",
      "title": "Sixteen Claude AI agents working together created a new C compiler",
      "neutral_headline": "Sixteen Claude AI agents working together created a new C compiler",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/02/sixteen-claude-ai-agents-working-together-created-a-new-c-compiler/",
          "published_at": "Fri, 06 Feb 2026 23:40:58 +0000",
          "title": "Sixteen Claude AI agents working together created a new C compiler",
          "standfirst": "The $20,000 experiment compiled a Linux kernel but needed deep human management.",
          "content": "Amid a push toward AI agents, with both Anthropic and OpenAI shipping multi-agent tools this week, Anthropic is more than ready to show off some of its more daring AI coding experiments. But as usual with claims of AI-related achievement, you'll find some key caveats ahead. On Thursday, Anthropic researcher Nicholas Carlini published a blog post describing how he set 16 instances of the company's Claude Opus 4.6 AI model loose on a shared codebase with minimal supervision, tasking them with building a C compiler from scratch. Over two weeks and nearly 2,000 Claude Code sessions costing about $20,000 in API fees, the AI model agents reportedly produced a 100,000-line Rust-based compiler capable of building a bootable Linux 6.9 kernel on x86, ARM, and RISC-V architectures.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Sat, 07 Feb 2026 12:00:35 +0000",
      "title": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
      "neutral_headline": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/under-trump-epas-enforcement-of-environmental-laws-collapses-report-finds/",
          "published_at": "Sat, 07 Feb 2026 12:00:35 +0000",
          "title": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
          "standfirst": "The Environmental Protection Agency has drastically pulled back on holding polluters accountable.",
          "content": "Enforcement against polluters in the United States plunged in the first year of President Donald Trump’s second term, a far bigger drop than in the same period of his first term, according to a new report from a watchdog group. By analyzing a range of federal court and administrative data, the nonprofit Environmental Integrity Project found that civil lawsuits filed by the US Department of Justice in cases referred by the Environmental Protection Agency dropped to just 16 in the first 12 months after Trump’s inauguration on Jan. 20, 2025. That is 76 percent less than in the first year of the Biden administration. Trump’s first administration filed 86 such cases in its first year, which was in turn a drop from the Obama administration’s 127 four years earlier.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531111-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531111-1152x648.jpg",
      "popularity_score": 333
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 22:43:12 +0000",
      "title": "Lawyer sets new standard for abuse of AI; judge tosses case",
      "neutral_headline": "Lawyer sets new standard for abuse of AI; judge tosses case",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/randomly-quoting-ray-bradbury-did-not-save-lawyer-from-losing-case-over-ai-errors/",
          "published_at": "Fri, 06 Feb 2026 22:43:12 +0000",
          "title": "Lawyer sets new standard for abuse of AI; judge tosses case",
          "standfirst": "Behold the most overwrought AI legal filings you will ever gaze upon.",
          "content": "Frustrated by fake citations and flowery prose packed with \"out-of-left-field\" references to ancient libraries and Ray Bradbury’s Fahrenheit 451, a New York federal judge took the rare step of terminating a case this week due to a lawyer's repeated misuse of AI when drafting filings. In an order on Thursday, district judge Katherine Polk Failla ruled that the extraordinary sanctions were warranted after an attorney, Steven Feldman, kept responding to requests to correct his filings with documents containing fake citations. One of those filings was \"noteworthy,\" Failla said, \"for its conspicuously florid prose.\" Where some of Feldman's filings contained grammatical errors and run-on sentences, this filing seemed glaringly different stylistically.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2252952774-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2252952774-1152x648.jpg",
      "popularity_score": 318
    },
    {
      "id": "cluster_90",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 23:08:42 +0000",
      "title": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
      "neutral_headline": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/penisgate-erupts-at-olympics-scandal-exposes-risks-of-bulking-your-budge/",
          "published_at": "Fri, 06 Feb 2026 23:08:42 +0000",
          "title": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
          "standfirst": "Claims of penis injections in ski jumpers has fillers spewing into the news.",
          "content": "As the 2026 Olympic Winter Games begin today, news articles are swelling with juicy claims that male ski jumpers have injected their penises with fillers to gain a flight advantage. As the rumor goes, having a bigger bulge on a required 3D body scan taken in the pre-season could earn jumpers extra centimeters of material in their jumpsuits—and a suit's larger nether regions provide more surface area to glide to the gold. Even a small increase can make a satisfying difference in this sport. A 2025 simulation-based study published in the journal Frontiers in Sports and Active Living suggested that every 2 cm of extra fabric in a ski jumpsuit could increase drag by about 4 percent and increase lift by about 5 percent. On a jump, that extra 2 cm of fabric amounts to an extra 5.8 meters, the simulations found. Elite ski jumpers are aware of the advantage and have already crotch-rocketed to scandal with related schemes. Last year, two Norwegian Olympic medalists, Marius Lindvik and Johann Andre Forfang, and three of their team officials were charged with cheating after an anonymous video showed the head coach and suit technician illegally restitching the crotch area of the two jumpers' suits to make them larger. The jumpers received a three-month suspension, while the head coach, an assistant coach, and the technician faced a harsher 18-month ban.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260132839-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260132839-1152x648.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 22:16:51 +0000",
      "title": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
      "neutral_headline": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/02/malicious-packages-for-dydx-cryptocurrency-exchange-empties-user-wallets/",
          "published_at": "Fri, 06 Feb 2026 22:16:51 +0000",
          "title": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
          "standfirst": "Incident is at least the third time the exchange has been targeted by thieves.",
          "content": "Open source packages published on the npm and PyPI repositories were laced with code that stole wallet credentials from dYdX developers and backend systems and, in some cases, backdoored devices, researchers said. “Every application using the compromised npm versions is at risk ….” the researchers, from security firm Socket, said Friday. “Direct impact includes complete wallet compromise and irreversible cryptocurrency theft. The attack scope includes all applications depending on the compromised versions and both developers testing with real credentials and production end-users.\" Packages that were infected were:Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cryptocurrency-theft-heist-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cryptocurrency-theft-heist-1152x648.jpg",
      "popularity_score": 301
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 21:53:05 +0000",
      "title": "Why $700 could be a \"death sentence\" for the Steam Machine",
      "neutral_headline": "Why $700 could be a \"death sentence\" for the Steam Machine",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/why-a-bump-to-700-could-be-a-death-sentence-for-the-steam-machine/",
          "published_at": "Fri, 06 Feb 2026 21:53:05 +0000",
          "title": "Why $700 could be a \"death sentence\" for the Steam Machine",
          "standfirst": "Analysts expect Valve might be hit particularly hard by soaring RAM, storage prices.",
          "content": "After writing two November stories analyzing price expectations for Valve's upcoming Steam Machine, I really didn't think we'd be offering more informed speculation before the official price was revealed. Then Valve wrote a blog post this week noting that the \"growing price of... critical components\" like RAM and storage meant that \"we must revisit our exact shipping schedule and pricing\" for the living room-focused PC gaming box. We don't know exactly what form that \"revisiting\" will take at the moment. Analysts who spoke to Ars were somewhat divided on how much of its quickly increasing component costs Valve would be willing (or forced) to pass on to consumers. \"We knew the component issue was bad,\" DFC Intelligence analyst David Cole told Ars. \"It has just gotten worse. \"Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2227105271-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2227105271-1152x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 21:05:45 +0000",
      "title": "COVID-19 cleared the skies but also supercharged methane emissions",
      "neutral_headline": "COVID-19 cleared the skies but also supercharged methane emissions",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/covid-19-cleared-the-skies-but-also-supercharged-methane-emissions/",
          "published_at": "Fri, 06 Feb 2026 21:05:45 +0000",
          "title": "COVID-19 cleared the skies but also supercharged methane emissions",
          "standfirst": "Less pollution meant lower amounts of a methane-destroying chemical.",
          "content": "In the spring of 2020, as the COVID-19 pandemic brought global industry and travel nearly to a halt, satellite sensors recorded a dramatic plunge in nitrogen dioxide, a byproduct of internal combustion engines and heavy industry. For a moment, the world’s air was cleaner than it had been in decades. But then something strange started happening: methane, the second most important anthropogenic greenhouse gas after carbon dioxide, was surging. Its growth rate hit 16.2 parts per billion that year, the highest since systematic records began in the early 1980s. A new study published in the journal Science looked at the complex chemistry of the troposphere (the lowest region of the atmosphere) and found that the two changes are likely connected. An atmospheric cleaner Since the late 1960s, we knew that atmospheric methane doesn’t just vanish. It is actively scrubbed from the sky by the hydroxyl radical, a highly reactive molecule that breaks down methane, turning it into water vapor and carbon dioxide. “The problem is that the lifetime of the hydroxyl radical is very short—its lifespan is less than a second\" says Shushi Peng, a professor at Peking University, China, and a co-author of the study. To do its job as an atmospheric methane clearing agent, a hydroxyl radical must be constantly replenished through a series of chemical reactions triggered by sunlight. The key ingredients in these reactions are nitrogen oxides, the very pollutants that were drastically reduced when cars stayed in garages and factories went dark in 2020.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg",
      "popularity_score": 273
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 20:44:35 +0000",
      "title": "Waymo leverages Genie 3 to create a world model for self-driving cars",
      "neutral_headline": "Waymo leverages Genie 3 to create a world model for self-driving cars",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/02/waymo-leverages-genie-3-to-create-a-world-model-for-self-driving-cars/",
          "published_at": "Fri, 06 Feb 2026 20:44:35 +0000",
          "title": "Waymo leverages Genie 3 to create a world model for self-driving cars",
          "standfirst": "With Genie 3, Waymo wants to explore rare and even impossible driving conditions.",
          "content": "Google-spinoff Waymo is in the midst of expanding its self-driving car fleet into new regions. Waymo touts more than 200 million miles of driving that informs how the vehicles navigate roads, but the company's AI has also driven billions of miles virtually, and there's a lot more to come with the new Waymo World Model. Based on Google DeepMind's Genie 3, Waymo says the model can create \"hyper-realistic\" simulated environments that train the AI on situations that are rarely (or never) encountered in real life—like snow on the Golden Gate Bridge. Until recently, the autonomous driving industry relied entirely on training data collected from real cars and real situations. That means rare, potentially dangerous events are not well represented in training data. The Waymo World Model aims to address that by allowing engineers to create simulations with simple prompts and driving inputs. Google revealed Genie 3 last year, positioning it as a significant upgrade over other world models by virtue of its long-horizon memory. In Google's world model, you can wander away from a given object, and when you look back, the model will still \"remember\" how that object is supposed to look. In earlier attempts at world models, the simulation would lose that context almost immediately. With Genie 3, the model can remember details for several minutes.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Waymo-IO-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Waymo-IO-1152x648.jpg",
      "popularity_score": 269
    },
    {
      "id": "cluster_105",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 19:31:09 +0000",
      "title": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
      "neutral_headline": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/to-reuse-or-not-reuse-the-eternal-debate-of-new-glenns-second-stage-reignites/",
          "published_at": "Fri, 06 Feb 2026 19:31:09 +0000",
          "title": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
          "standfirst": "A new job posting suggests the debate may be swinging back toward reusing GS2.",
          "content": "Engineers at Blue Origin have been grappling with a seemingly eternal debate that involves the New Glenn rocket and the economics of flying it. The debate goes back at least 15 years, to the early discussions around the design of the heavy lift rocket. The first stage, of course, would be fully reusable. But what about the upper stage of New Glenn, powered by two large BE-3U engines? Around the same time, in the early 2010s, SpaceX was also trading the economics of reusing the second stage of its Falcon 9 rocket. Eventually SpaceX founder Elon Musk abandoned his goal of a fully reusable Falcon 9, choosing instead to recover payload fairings and push down manufacturing costs of the upper stage as much as possible. This strategy worked, as SpaceX has lowered its internal launch costs of a Falcon 9, even with a new second stage, to about $15 million. The company is now focused on making the larger Starship rocket fully reusable.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/new-glenn_gs2-hotfire-1152x648.webp"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/new-glenn_gs2-hotfire-1152x648.webp",
      "popularity_score": 253
    }
  ]
}