{
  "updated_at": "2026-01-13T11:14:52.344Z",
  "clusters": [
    {
      "id": "cluster_52",
      "coverage": 2,
      "updated_at": "Mon, 12 Jan 2026 20:53:36 GMT",
      "title": "Can Google save Apple AI? Gemini to power a new, personalized Siri",
      "neutral_headline": "Can Google save Apple AI? Gemini to power a new, personalized Siri",
      "bullet_summary": [
        "Apple and Google have embarked on a non-exclusive, multi-year partnership that will involve Apple using Gemini models and Google cloud technology for future foundational models",
        "Reported by ZDNet, TechCrunch"
      ],
      "items": [
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/gemini-apple-intelligence-siri-upgrade/",
          "published_at": "Mon, 12 Jan 2026 20:53:36 GMT",
          "title": "Can Google save Apple AI? Gemini to power a new, personalized Siri",
          "standfirst": "A new deal between Apple and Google makes Gemini the cloud-based technology driving Apple Intelligence and Siri. Here's what that could look like.",
          "content": "A new deal between Apple and Google makes Gemini the cloud-based technology driving Apple Intelligence and Siri. Here's what that could look like.",
          "feed_position": 18
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/12/googles-gemini-to-power-apples-ai-features-like-siri/",
          "published_at": "Mon, 12 Jan 2026 17:12:41 +0000",
          "title": "Google’s Gemini to power Apple’s AI features like Siri",
          "standfirst": "Apple and Google have embarked on a non-exclusive, multi-year partnership that will involve Apple using Gemini models and Google cloud technology for future foundational models.",
          "content": "Apple and Google have embarked on a non-exclusive, multi-year partnership that will involve Apple using Gemini models and Google cloud technology for future foundational models.",
          "feed_position": 13
        }
      ],
      "popularity_score": 2005.64546
    },
    {
      "id": "cluster_38",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 23:42:09 +0000",
      "title": "Anthropic launches Cowork, a Claude Code-like for general computing",
      "neutral_headline": "Anthropic launches Cowork, a Claude Code-like for general computing",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/anthropic-launches-cowork-a-claude-code-like-for-general-computing/",
          "published_at": "Mon, 12 Jan 2026 23:42:09 +0000",
          "title": "Anthropic launches Cowork, a Claude Code-like for general computing",
          "standfirst": "Users can give Claude access to a folder and tell it what to do for them.",
          "content": "Anthropic's agentic tool Claude Code has been an enormous hit with some software developers and hobbyists, and now the company is bringing that modality to more general office work with a new feature called Cowork. Built on the same foundations as Claude Code and baked into the macOS Claude desktop app, Cowork allows users to give Claude access to a specific folder on their computer and then give plain language instructions for tasks. Anthropic gave examples like filling out an expense report from a folder full of receipt photos, writing reports based on a big stack of digital notes, or reorganizing a folder (or cleaning up your desktop) based on a prompt.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Claude-Cowork-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Claude-Cowork-1152x648.jpg",
      "popularity_score": 341.4546266666667
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 23:04:33 +0000",
      "title": "You can now reserve a hotel room on the Moon for $250,000",
      "neutral_headline": "You can now reserve a hotel room on the Moon for $250,000",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/you-can-now-reserve-a-hotel-room-on-the-moon-for-250000/",
          "published_at": "Mon, 12 Jan 2026 23:04:33 +0000",
          "title": "You can now reserve a hotel room on the Moon for $250,000",
          "standfirst": "\"We can't keep everyone living on that first ship that sailed to North America.\"",
          "content": "A company called GRU Space publicly announced its intent to construct a series of increasingly sophisticated habitats on the Moon, culminating in a hotel inspired by the Palace of the Fine Arts in San Francisco. On Monday, the company invited those interested in a berth to plunk down a deposit between $250,000 and $1 million, qualifying them for a spot on one of its early lunar surface missions in as little as six years from now. It sounds crazy, doesn't it? After all, GRU Space had, as of late December when I spoke to founder Skyler Chan, a single full-time employee aside from himself. And Chan, in fact, only recently graduated from the University of California, Berkeley.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lunar-hotel-1-1152x648-1768258910.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lunar-hotel-1-1152x648-1768258910.jpg",
      "popularity_score": 330.82796
    },
    {
      "id": "cluster_40",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 22:49:31 +0000",
      "title": "Paramount sues WBD over Netflix deal. WBD says Paramount’s price is still inadequate.",
      "neutral_headline": "Paramount sues WBD over Netflix deal. WBD says Paramount’s price is still inadequate.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/paramount-sues-wbd-over-netflix-deal-wbd-says-paramounts-price-is-still-inadequate/",
          "published_at": "Mon, 12 Jan 2026 22:49:31 +0000",
          "title": "Paramount sues WBD over Netflix deal. WBD says Paramount’s price is still inadequate.",
          "standfirst": "WBD calls Paramount's lawsuit \"meritless\" and its offer deficient.",
          "content": "Paramount Skydance escalated its hostile takeover bid of Warner Bros. Discovery (WBD) today by filing a lawsuit in Delaware Chancery Court against WBD, declaring its intention to fight Netflix’s acquisition. In December, WBD agreed to sell its streaming and movie businesses to Netflix for $82.7 billion. The deal would see WBD’s Global Networks division, comprised of WBD's legacy cable networks, spun out into a separate company called Discovery Global. But in December, Paramount submitted a hostile takeover bid and amended its bid for WBD. Subsequently, the company has aggressively tried to convince WBD’s shareholders that its $108.4 billion offer for all of WBD is superior to the Netflix deal. Today, Paramount CEO David Ellison wrote a letter to WBD shareholders informing them of Paramount’s lawsuit. The lawsuit requests the court to force WBD to disclose “how it valued the Global Networks stub equity, how it valued the overall Netflix transaction, how the purchase price reduction for debt works in the Netflix transaction, or even what the basis is for its ‘risk adjustment’” of Paramount’s $30 per share all-cash offer. Netflix’s offer equates to $27.72 per share, including $23.25 in cash and shares of Netflix common stock. Paramount hopes the information will encourage more WBD shareholders to tender their shares under Paramount's offer by the January 21 deadline.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2215193098-1152x648-1768255617.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2215193098-1152x648-1768255617.jpg",
      "popularity_score": 320.5774044444444
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 21:47:32 +0000",
      "title": "Google removes some AI health summaries after investigation finds “dangerous” flaws",
      "neutral_headline": "Google removes some AI health summaries after investigation finds “dangerous” flaws",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/google-removes-some-ai-health-summaries-after-investigation-finds-dangerous-flaws/",
          "published_at": "Mon, 12 Jan 2026 21:47:32 +0000",
          "title": "Google removes some AI health summaries after investigation finds “dangerous” flaws",
          "standfirst": "AI Overviews provided false liver test information experts called alarming.",
          "content": "On Sunday, Google removed some of its AI Overviews health summaries after a Guardian investigation found people were being put at risk by false and misleading information. The removals came after the newspaper found that Google's generative AI feature delivered inaccurate health information at the top of search results, potentially leading seriously ill patients to mistakenly conclude they are in good health. Google disabled specific queries, such as \"what is the normal range for liver blood tests,\" after experts contacted by The Guardian flagged the results as dangerous. The report also highlighted a critical error regarding pancreatic cancer: The AI suggested patients avoid high-fat foods, a recommendation that contradicts standard medical guidance to maintain weight and could jeopardize patient health. Despite these findings, Google only deactivated the summaries for the liver test queries, leaving other potentially harmful answers accessible. The investigation revealed that searching for liver test norms generated raw data tables (listing specific enzymes like ALT, AST, and alkaline phosphatase) that lacked essential context. The AI feature also failed to adjust these figures for patient demographics such as age, sex, and ethnicity. Experts warned that because the AI model's definition of \"normal\" often differed from actual medical standards, patients with serious liver conditions might mistakenly believe they are healthy and skip necessary follow-up care.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/GettyImages-1488311999-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/05/GettyImages-1488311999-1152x648.jpg",
      "popularity_score": 316.54434888888886
    },
    {
      "id": "cluster_42",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 22:27:50 +0000",
      "title": "Even Linus Torvalds is trying his hand at vibe coding (but just a little)",
      "neutral_headline": "Even Linus Torvalds is trying his hand at vibe coding (but just a little)",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/hobby-github-repo-shows-linus-torvalds-vibe-codes-sometimes/",
          "published_at": "Mon, 12 Jan 2026 22:27:50 +0000",
          "title": "Even Linus Torvalds is trying his hand at vibe coding (but just a little)",
          "standfirst": "\"But then I cut out the middle man—me.\"",
          "content": "Linux and Git creator Linus Torvalds' latest project contains code that was \"basically written by vibe coding,\" but you shouldn't read that to mean that Torvalds is embracing that approach for anything and everything. Torvalds sometimes works on a small hobby projects over holiday breaks. Last year, he made guitar pedals. This year, he did some work on AudioNoise, which he calls \"another silly guitar-pedal-related repo.\" It creates random digital audio effects. Torvalds revealed that he had used an AI coding tool in the README for the repo:Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2015/08/LinuxCon_Europe_Linus_Torvalds_05-1152x648-1768254932.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2015/08/LinuxCon_Europe_Linus_Torvalds_05-1152x648-1768254932.jpg",
      "popularity_score": 316.21601555555554
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 22:07:23 +0000",
      "title": "Verizon to stop automatic unlocking of phones as FCC ends 60-day unlock rule",
      "neutral_headline": "Verizon to stop automatic unlocking of phones as FCC ends 60-day unlock rule",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/fcc-lets-verizon-lock-phones-for-longer-making-it-harder-to-switch-carriers/",
          "published_at": "Mon, 12 Jan 2026 22:07:23 +0000",
          "title": "Verizon to stop automatic unlocking of phones as FCC ends 60-day unlock rule",
          "standfirst": "FCC waives rule that forced Verizon to unlock phones 60 days after activation.",
          "content": "The Federal Communications Commission is letting Verizon lock phones to its network for longer periods, eliminating a requirement to unlock handsets 60 days after they are activated on its network. The change will make it harder for people to switch from Verizon to other carriers. The FCC today granted Verizon's petition for a waiver of the 60-day unlocking requirement. While the waiver is in effect, Verizon only has to comply with the CTIA trade group's voluntary unlocking policy. The CTIA policy calls for unlocking prepaid mobile devices one year after activation, while devices on postpaid plans can be unlocked after a contract, device financing plan, or early termination fee is paid. Unlocking a phone allows it to be used on another carrier's network. While Verizon was previously required to unlock phones automatically after 60 days, the CTIA code says carriers only have to unlock phones \"upon request\" from consumers. The FCC said the Verizon waiver will remain in effect until the agency \"decides on an appropriate industry-wide approach for the unlocking of handsets.\"Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/verizon-jerks-locked-phone-1152x648-1765486982.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/verizon-jerks-locked-phone-1152x648-1765486982.jpg",
      "popularity_score": 299.87518222222224
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 21:27:35 +0000",
      "title": "Judge: Trump violated Fifth Amendment by ending energy grants in only blue states",
      "neutral_headline": "Judge: Trump violated Fifth Amendment by ending energy grants in only blue states",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/judge-trump-violated-fifth-amendment-by-ending-energy-grants-in-only-blue-states/",
          "published_at": "Mon, 12 Jan 2026 21:27:35 +0000",
          "title": "Judge: Trump violated Fifth Amendment by ending energy grants in only blue states",
          "standfirst": "Donald Trump’s social media post triggers rare Fifth Amendment ruling.",
          "content": "The Trump administration violated the Fifth Amendment when canceling billions of dollars in environmental grants for projects in \"blue states\" that didn't vote for him in the last election, a judge ruled Monday. Trump's blatant discrimination came on the same day as the government shut down last fall. In total, 315 grants were terminated in October, ending support for 223 projects worth approximately $7.5 billion, the Department of Energy confirmed. All the awardees, except for one, were based in states where Donald Trump lost the majority vote to Kamala Harris in 2024. Only seven awardees sued, defending projects that helped states with \"electric vehicle development, updating building energy codes, and addressing methane emissions.\" They accused Trump officials of clearly discriminating against Democratic voters by pointing to their social media posts boasting about punishing blue states.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2254848310-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2254848310-1024x648.jpg",
      "popularity_score": 279.2118488888889
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 20:00:54 +0000",
      "title": "Switching water sources improved hygiene of Pompeii’s public baths",
      "neutral_headline": "Switching water sources improved hygiene of Pompeii’s public baths",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/switching-water-sources-improved-hygiene-of-pompeiis-public-baths/",
          "published_at": "Mon, 12 Jan 2026 20:00:54 +0000",
          "title": "Switching water sources improved hygiene of Pompeii’s public baths",
          "standfirst": "Scientists analyzed carbonate deposits from baths, aqueduct to learn more about city's changing water supply.",
          "content": "The eruption of Mount Vesuvius in 79 CE released thermal energy roughly equivalent to 100,000 times the atomic bombs dropped on Hiroshima and Nagasaki at the end of World War II, spewing molten rock, pumice, and hot ash over Pompeii. Pompeii's public baths, aqueduct, and water towers were among the preserved structures frozen in time. A new paper published in the Proceedings of the National Academy of Sciences analyzed calcium carbonate deposits from those structures to learn more about the city's water supply and how it changed over time. Pompeii was founded in the sixth century BCE. Prior research revealed that, early on, the city relied on rainwater stored in cisterns and wells for its water supply. The public baths used weight-lifting machinery to lift water up well shafts that were as deep as 40 meters. As the city developed, so did the complexity of its water supply system, most notably with the construction of an aqueduct between 27 BCE and 14 CE. The authors of this latest paper were interested in the calcium carbonate deposits left by water in well shafts as well as the baths and aqueduct. The different layers have \"different chemical and isotope composition, calcite crystal size, and shape,\" which in turn could reveal information about seasonal changes in temperature, as well as changes over time in the chemical composition of the water. Analyzing those properties would enable them to \"reconstruct the history of such systems—particularly public baths—revealing aspects of their maintenance and the adaptations made during their period of use,\" the authors wrote.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bath1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bath1-1152x648.jpg",
      "popularity_score": 267.7671266666667
    },
    {
      "id": "cluster_61",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 19:36:17 +0000",
      "title": "Apps like Grok are explicitly banned under Google’s rules—why is it still in the Play Store?",
      "neutral_headline": "Apps like Grok are explicitly banned under Google’s rules—why is it...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/01/apps-like-grok-are-explicitly-banned-under-googles-rules-why-is-it-still-in-the-play-store/",
          "published_at": "Mon, 12 Jan 2026 19:36:17 +0000",
          "title": "Apps like Grok are explicitly banned under Google’s rules—why is it still in the Play Store?",
          "standfirst": "Google describes apps exactly like Grok and says they are banned from Google Play.",
          "content": "Elon Musk's xAI recently weakened content guard rails for image generation in the Grok AI bot. This led to a new spate of non-consensual sexual imagery on X, much of it aimed at silencing women on the platform. This, along with the creation of sexualized images of children in the more compliant Grok, has led regulators to begin investigating xAI. In the meantime, Google has rules in place for exactly this eventuality—it's just not enforcing them. It really could not be more clear from Google's publicly available policies that Grok should have been banned yesterday. And yet, it remains in the Play Store. Not only that—it enjoys a T for Teen rating, one notch below the M-rated X app. Apple also still offers the Grok app on its platform, but its rules actually leave more wiggle room. App content restrictions at Apple and Google have evolved in very different ways. From the start, Apple has been prone to removing apps on a whim, so developers have come to expect that Apple's guidelines may not mention every possible eventuality. As Google has shifted from a laissez-faire attitude to more hard-nosed control of the Play Store, it has progressively piled on clarifications in the content policy. As a result, Google's rules are spelled out in no uncertain terms, and Grok runs afoul of them.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2225386195-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2225386195-1024x648.jpg",
      "popularity_score": 259.35684888888886
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 19:56:01 +0000",
      "title": "Supreme Court takes case that could strip FCC of authority to issue fines",
      "neutral_headline": "Supreme Court takes case that could strip FCC of authority to issue fines",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/supreme-court-takes-case-that-could-strip-fcc-of-authority-to-issue-fines/",
          "published_at": "Mon, 12 Jan 2026 19:56:01 +0000",
          "title": "Supreme Court takes case that could strip FCC of authority to issue fines",
          "standfirst": "AT&#038;T and Verizon claim right to a jury trial was violated by FCC fines.",
          "content": "The Supreme Court will hear a case that could invalidate the Federal Communications Commission's authority to issue fines against companies regulated by the FCC. AT&T, Verizon, and T-Mobile challenged the FCC's ability to punish them after the commission fined the carriers for selling customer location data without their users’ consent. AT&T convinced the US Court of Appeals for the 5th Circuit to overturn its fine, while Verizon lost in the 2nd Circuit and T-Mobile lost in the District of Columbia Circuit. Verizon petitioned the Supreme Court to reverse its loss, while the FCC and Justice Department petitioned the court to overturn AT&T's victory in the 5th Circuit. The Supreme Court granted both petitions to hear the challenges and consolidated the cases in a list of orders released Friday. Oral arguments will be held.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-1152x648.jpg",
      "popularity_score": 257.6857377777778
    },
    {
      "id": "cluster_75",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 17:57:32 +0000",
      "title": "Apple chooses Google’s Gemini over OpenAI’s ChatGPT to power next-gen Siri",
      "neutral_headline": "Apple chooses Google’s Gemini over OpenAI’s ChatGPT to power next-gen Siri",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/apple/2026/01/apple-says-its-new-ai-powered-siri-will-use-googles-gemini-language-models/",
          "published_at": "Mon, 12 Jan 2026 17:57:32 +0000",
          "title": "Apple chooses Google’s Gemini over OpenAI’s ChatGPT to power next-gen Siri",
          "standfirst": "Apple goes with Google's tech despite using OpenAI's ChatGPT elsewhere in iOS.",
          "content": "The \"more intelligent\" version of Siri that Apple plans to release later this year will be backed by Google's Gemini language models, the company announced today. CNBC reports that the deal is part of a \"multi-year partnership\" between Apple and Google that will allow Apple to use Google's AI models in its own software. \"After careful evaluation, we determined that Google’s technology provides the most capable foundation for Apple Foundation Models and we’re excited about the innovative new experiences it will unlock for our users,” reads an Apple statement given to CNBC. Today's announcement confirms reporting by Bloomberg's Mark Gurman late last year that Apple and Google were nearing a deal. Apple didn't disclose terms, but Gurman said that Apple would be paying Google \"about $1 billion a year\" for access to its AI models \"following an extensive evaluation period.\"Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/apple_google_hero_3-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/apple_google_hero_3-1152x648.jpg",
      "popularity_score": 162.71101555555555
    },
    {
      "id": "cluster_87",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 15:21:38 +0000",
      "title": "NASA topples towers used to test Saturn rockets, space shuttle",
      "neutral_headline": "NASA topples towers used to test Saturn rockets, space shuttle",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasa-topples-towers-used-to-test-saturn-rockets-space-shuttle/",
          "published_at": "Mon, 12 Jan 2026 15:21:38 +0000",
          "title": "NASA topples towers used to test Saturn rockets, space shuttle",
          "standfirst": "The Propulsion and Structural Test Facility and Dynamic Test Facility are no more.",
          "content": "Two historic NASA test facilities used in the development of the Saturn V and space shuttle launch vehicles have been demolished after towering over the Marshall Space Flight Center in Alabama since the start of the Space Age. The Propulsion and Structural Test Facility, which was erected in 1957—the same year the first artificial satellite entered Earth orbit—and the Dynamic Test Facility, which has stood since 1964, were brought down by a coordinated series of implosions on Saturday, January 10. Located in Marshall's East Test Area on the US Army's Redstone Arsenal in Huntsville, the two structures were no longer in use and, according to NASA, had a backlog of $25 million in needed repairs. \"This work reflects smart stewardship of taxpayer resources,\" Jared Isaacman, NASA administrator, said in a statement. \"Clearing outdated infrastructure allows NASA to safely modernize, streamline operations and fully leverage the infrastructure investments signed into law by President Trump to keep Marshall positioned at the forefront of aerospace innovation.\"Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/news-010826c-lg-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/news-010826c-lg-1152x648.jpg",
      "popularity_score": 146.11268222222222
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 19:25:17 +0000",
      "title": "NASA launches new mission to get the most out of the James Webb Space Telescope",
      "neutral_headline": "NASA launches new mission to get the most out of the James Webb Space Telescope",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasas-newest-telescope-will-play-an-outsize-role-in-finding-earth-2-0/",
          "published_at": "Mon, 12 Jan 2026 19:25:17 +0000",
          "title": "NASA launches new mission to get the most out of the James Webb Space Telescope",
          "standfirst": "\"It was not recognized how serious a problem that is until... about 2017 or 2018.\"",
          "content": "Among other things, the James Webb Space Telescope is designed to get us closer to finding habitable worlds around faraway stars. From its perch a million miles from Earth, Webb's huge gold-coated mirror collects more light than any other telescope put into space. The Webb telescope, launched in 2021 at a cost of more than $10 billion, has the sensitivity to peer into distant planetary systems and detect the telltale chemical fingerprints of molecules critical to or indicative of potential life, like water vapor, carbon dioxide, and methane. Webb can do this while also observing the oldest observable galaxies in the Universe and studying planets, moons, and smaller objects within our own Solar System. Naturally, astronomers want to get the most out of their big-budget observatory. That's where NASA's Pandora mission comes in.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Pandora_integrated_blue_BCT-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Pandora_integrated_blue_BCT-1152x648.jpg",
      "popularity_score": 145.17351555555555
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 15:59:15 +0000",
      "title": "The Chevrolet Bolt is back... but for how long?",
      "neutral_headline": "The Chevrolet Bolt is back... but for how long",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/the-chevrolet-bolt-is-back-but-for-how-long/",
          "published_at": "Mon, 12 Jan 2026 15:59:15 +0000",
          "title": "The Chevrolet Bolt is back... but for how long?",
          "standfirst": "The new LFP battery pack has 262 miles of range and fast-charges at 150 kW.",
          "content": "The new Chevrolet Equinox EV is a solid entry into the compact crossover market, and with a (just) sub-$35,000 starting price, it also counts as affordable by the standards of 2026. But if you think that's too rich for your blood, or that the Equinox is still too large for your needs, take heart—the Chevrolet Bolt is back in dealerships now as well. The Bolt was GM's first modern electric vehicle, following on from the hand-built, pre-lithium ion EV1 and the compliance car that was the Spark EV. We're big fans of the Bolt here at Ars Technica. It offered well more than 200 miles of range in a mass-produced EV at a reasonable price well before Tesla's Model 3 started clogging up our roads, it got more efficient over time, and it managed to be fun to drive in the process. General Motors (which owns Chevrolet) probably feels less well-disposed toward the Bolt. It lost thousands of dollars on each car it sold, even before the entire fleet had to be recalled for a costly battery replacement. The issue was due to improperly folded tabs on some cells that could cause a battery fire, giving GM (and its battery partner LG) plenty of bad press in the process. That recall alone cost $1.8 billion.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Chevrolet-Bolt-2027-DriverRear-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Chevrolet-Bolt-2027-DriverRear-1152x648.jpg",
      "popularity_score": 136.73962666666665
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 16:32:21 +0000",
      "title": "UK probes X over Grok CSAM scandal; Elon Musk cries censorship",
      "neutral_headline": "UK probes X over Grok CSAM scandal; Elon Musk cries censorship",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/uk-investigating-x-after-grok-undressed-thousands-of-women-and-children/",
          "published_at": "Mon, 12 Jan 2026 16:32:21 +0000",
          "title": "UK probes X over Grok CSAM scandal; Elon Musk cries censorship",
          "standfirst": "Grok tests if UK can penalize platforms for sexualized deepfakes generated by AI.",
          "content": "Elon Musk's X is currently under investigation in the United Kingdom after failing to stop the platform's chatbot, Grok, from generating thousands of sexualized images of women and children. On Monday, UK media regulator Ofcom confirmed that X may have violated the UK's Online Safety Act, which requires platforms to block illegal content. The proliferation of \"undressed images of people\" by X users may amount to intimate image abuse, pornography, and child sexual abuse material (CSAM), the regulator said. And X may also have neglected its duty to stop kids from seeing porn. \"Reports of Grok being used to create and share illegal non-consensual intimate images and child sexual abuse material on X have been deeply concerning,\" an Ofcom spokesperson said. \"Platforms must protect people in the UK from content that’s illegal in the UK, and we won’t hesitate to investigate where we suspect companies are failing in their duties, especially where there’s a risk of harm to children.\"Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2246892016-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2246892016-1024x648.jpg",
      "popularity_score": 134.29129333333333
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 15:55:20 +0000",
      "title": "New research shows how shunning ultraprocessed foods helps with aging",
      "neutral_headline": "New research shows how shunning ultraprocessed foods helps with aging",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/avoiding-ultraprocessed-foods-supports-healthier-aging/",
          "published_at": "Mon, 12 Jan 2026 15:55:20 +0000",
          "title": "New research shows how shunning ultraprocessed foods helps with aging",
          "standfirst": "Studies have linked ultraprocessed foods to poor health outcomes.",
          "content": "Older adults can dramatically reduce the amount of ultraprocessed foods they eat while keeping a familiar, balanced diet—and this shift leads to improvements across several key markers related to how the body regulates appetite and metabolism. That’s the main finding of a new study my colleagues and I published in the journal Clinical Nutrition. Ultraprocessed foods are made using industrial techniques and ingredients that aren’t typically used in home cooking. They often contain additives such as emulsifiers, flavorings, colors, and preservatives. Common examples include packaged snacks, ready-to-eat meals, and some processed meats. Studies have linked diets high in ultraprocessed foods to poorer health outcomes. My team and I enrolled Americans ages 65 and older in our study, many of whom were overweight or had metabolic risk factors such as insulin resistance or high cholesterol. Participants followed two diets low in ultraprocessed foods for eight weeks each. One included lean red meat (pork); the other was vegetarian with milk and eggs. For two weeks in between, participants returned to their usual diets.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ultraprocessed-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ultraprocessed-1152x648.jpg",
      "popularity_score": 133.6743488888889
    },
    {
      "id": "cluster_97",
      "coverage": 1,
      "updated_at": "Sun, 11 Jan 2026 20:35:33 +0000",
      "title": "That time Will Smith helped discover new species of anaconda",
      "neutral_headline": "That time Will Smith helped discover new species of anaconda",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/that-time-will-smith-helped-discover-new-species-of-anaconda/",
          "published_at": "Sun, 11 Jan 2026 20:35:33 +0000",
          "title": "That time Will Smith helped discover new species of anaconda",
          "standfirst": "Footage of the 2024 discovery appears in NatGeo's new documentary series Pole to Pole with Will Smith.",
          "content": "In 2024, scientists announced the discovery of a new species of giant anaconda in South America. A National Geographic camera crew was on hand for the 2022 expedition that documented the new species—and so was actor Will Smith, since they were filming for NatGeo's new documentary series, Pole to Pole with Will Smith. Now we can all share in Smith's Amazon experience, courtesy of the three-minute clip above. Along with venom expert Bryan Fry, we follow Smith's journey by boat with a team of indigenous Waorani guides, scouring the river banks for anacondas. And they find one: a female green anaconda about 16 to 17 feet long, \"pure muscle.\" The Waorani secure the giant snake—anacondas aren't venomous but they do bite—so that Fry (with Smith's understandably reluctant help) can collect a scale sample for further analysis. Fry says that this will enable him to determine the accumulation of pollutants in the water. That and other collected samples also enabled scientists to conduct the genetic analysis that resulted in the declaration of a new species: the northern green anaconda (Eunectes akayama, which roughly translates to \"the great snake\"). It is genetically distinct from the southern green anaconda (Eunectes murinus); the two species likely diverged some 10 million years ago. The northern green anaconda's turf includes Venezuela, Colombia, Suriname, French Guyana, and the northern part of Brazil.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anaconda3-1152x648-1768069746.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/anaconda3-1152x648-1768069746.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 17:08:56 +0000",
      "title": "Is this the beginning of the end for GameStop?",
      "neutral_headline": "Is this the beginning of the end for GameStop",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/is-this-the-beginning-of-the-end-for-gamestop/",
          "published_at": "Mon, 12 Jan 2026 17:08:56 +0000",
          "title": "Is this the beginning of the end for GameStop?",
          "standfirst": "The sudden closure of hundreds of storefronts isn't exactly a great sign...",
          "content": "Six and a half years ago—after a failed corporate sale attempt, massive financial losses, and the departure/layoff of many key staff—I wrote about what seemed at the time like the \"imminent demise\" of GameStop. Now, after five years of meme stock mania that helped prop up the company's finances a bit, I'll admit the video game and Funko Pop retailer has lasted much longer as a relevant entity than I anticipated. GameStop's surprisingly extended run may be coming to an end, though, with Polygon reporting late last week that GameStop has abruptly shut down 400 stores across the US, with even more closures expected before the end of the month. That comes on top of 590 US stores that were shuttered in fiscal 2024 (which ended in January 2025) and stated plans to close hundreds of remaining international stores across Canada, Australia, and Europe in the coming months, per SEC filings. GameStop still had just over 3,200 stores worldwide as of February 1, 2025, so even hundreds of new and planned store closures don't literally mean the immediate end of the company as a going concern. But when you consider that there were still nearly 6,000 GameStop locations worldwide as of 2019—nearly 4,000 of which were in the US—the long-term trend is clear.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2019/08/GettyImages-1135950796-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/08/GettyImages-1135950796-1152x648.jpg",
      "popularity_score": 131.90101555555555
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Mon, 12 Jan 2026 11:30:06 +0000",
      "title": "The most fascinating monitors at CES 2026",
      "neutral_headline": "The most fascinating monitors at CES 2026",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/the-most-fascinating-monitors-at-ces-2026/",
          "published_at": "Mon, 12 Jan 2026 11:30:06 +0000",
          "title": "The most fascinating monitors at CES 2026",
          "standfirst": "Big sizes, big resolution, and big ideas.",
          "content": "CES 2026 took place in Las Vegas last week, and as usual, we're looking at the most interesting monitors from the show. Not every display is a monitor in the strictest sense, but they all provide a display for computers and have a unique twist that make them worth exploring. Dell’s massive UltraSharp Dell's biggest UltraSharp has a 21:9 aspect ratio. Credit: Dell It was a pretty safe bet that Dell would announce new UltraSharp monitors at CES. The displays are a solid recommendation for reliable USB-C monitors, including for Mac users and people needing something polished for professional or creative work. In recent years, UltraSharp monitors have also boasted more modern features, including integrated web cameras and IPS Black tech. This year, the strategy was clear: Bigger is better.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/TCXAIO.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/TCXAIO.jpg",
      "popularity_score": 130
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Sun, 11 Jan 2026 12:00:50 +0000",
      "title": "The oceans just keep getting hotter",
      "neutral_headline": "The oceans just keep getting hotter",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/the-oceans-just-keep-getting-hotter/",
          "published_at": "Sun, 11 Jan 2026 12:00:50 +0000",
          "title": "The oceans just keep getting hotter",
          "standfirst": "For the eighth year in a row, the world’s oceans absorbed a record-breaking amount of heat in 2025.",
          "content": "Since 2018, a group of researchers from around the world has crunched the numbers on how much heat the world’s oceans are absorbing each year. In 2025, their measurements broke records once again, making this the eighth year in a row that the world’s oceans have absorbed more heat than in the years before. The study, which was published Friday in the journal Advances in Atmospheric Science, found that the world’s oceans absorbed an additional 23 zettajoules’ worth of heat in 2025, the most in any year since modern measurements began in the 1960s. That’s significantly higher than the 16 additional zettajoules they absorbed in 2024. The research comes from a team of more than 50 scientists across the United States, Europe, and China. A joule is a common way to measure energy. A single joule is a relatively small unit of measurement—it’s about enough to power a tiny lightbulb for a second, or slightly heat a gram of water. But a zettajoule is one sextillion joules; numerically, the 23 zettajoules the oceans absorbed this year can be written out as 23,000,000,000,000,000,000,000.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/sun-over-ocean-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/sun-over-ocean-1152x648.jpg",
      "popularity_score": 130
    }
  ]
}