{
  "updated_at": "2026-02-11T23:25:15.868Z",
  "clusters": [
    {
      "id": "cluster_51",
      "coverage": 3,
      "updated_at": "Wed, 11 Feb 2026 13:25:01 -0500",
      "title": "Meta launches an AI feature that lets Threads users temporarily personalize their feed by specifying topics in a public post that begins with \"Dear Algo\" (Jonathan Vanian/CNBC)",
      "neutral_headline": "Threads’ new ‘Dear Algo’ feature lets you tell the algorithm what you want to see",
      "bullet_summary": [
        "Reported by TechMeme, The Verge, TechCrunch"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260211/p37#a260211p37",
          "published_at": "Wed, 11 Feb 2026 13:25:01 -0500",
          "title": "Meta launches an AI feature that lets Threads users temporarily personalize their feed by specifying topics in a public post that begins with \"Dear Algo\" (Jonathan Vanian/CNBC)",
          "standfirst": "Jonathan Vanian / CNBC: Meta launches an AI feature that lets Threads users temporarily personalize their feed by specifying topics in a public post that begins with &ldquo;Dear Algo&rdquo; &mdash; Meta on Wednesday debuted an AI feature called &ldquo;Dear Algo&rdquo; that lets Threads users personalize their content-recommendation algorithms.",
          "content": "Jonathan Vanian / CNBC: Meta launches an AI feature that lets Threads users temporarily personalize their feed by specifying topics in a public post that begins with &ldquo;Dear Algo&rdquo; &mdash; Meta on Wednesday debuted an AI feature called &ldquo;Dear Algo&rdquo; that lets Threads users personalize their content-recommendation algorithms.",
          "feed_position": 12,
          "image_url": "http://www.techmeme.com/260211/i37.jpg"
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/876610/meta-threads-dear-algo-algorithm",
          "published_at": "2026-02-11T13:00:00-05:00",
          "title": "Threads’ new ‘Dear Algo’ feature lets you tell the algorithm what you want to see",
          "standfirst": "Threads now lets users in the US adjust what is recommended in their feed by writing \"Dear Algo\" in a post and explaining what they're looking for. The feature is part of a bigger push across Meta's platforms to give users more control over the types of posts that are recommended to them. Dear Algo [&#8230;]",
          "content": "Threads now lets users in the US adjust what is recommended in their feed by writing \"Dear Algo\" in a post and explaining what they're looking for. The feature is part of a bigger push across Meta's platforms to give users more control over the types of posts that are recommended to them. Dear Algo was inspired by users making posts with the phrase to try to influence what they see before Meta made an official version. The feature has already been available in testing in Australia, Canada, New Zealand, and the United Kingdom, and now that test is launching in the US. \"We'll continue iterating based on community feedback before rolling it ou … Read the full story at The Verge.",
          "feed_position": 8
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/11/threads-new-dear-algo-ai-feature-lets-you-personalize-your-feed/",
          "published_at": "Wed, 11 Feb 2026 18:00:00 +0000",
          "title": "Threads&#8217; new &#8216;Dear Algo&#8217; AI feature lets you personalize your feed",
          "standfirst": "The platform's new feature lets users tell Threads what they temporarily want to see more or less of in their feed.",
          "content": "The platform's new feature lets users tell Threads what they temporarily want to see more or less of in their feed.",
          "feed_position": 14
        }
      ],
      "featured_image": "http://www.techmeme.com/260211/i37.jpg",
      "popularity_score": 3014.9958702777776
    },
    {
      "id": "cluster_43",
      "coverage": 2,
      "updated_at": "Wed, 11 Feb 2026 19:30:14 +0000",
      "title": "Amazon&#8217;s new eero Signal keeps you connected to the internet when outages occur",
      "neutral_headline": "Amazon&#8217;s new eero Signal keeps you connected to the internet when outages occur",
      "bullet_summary": [
        "Reported by TechCrunch, ZDNet"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/11/amazons-new-eero-signal-keeps-you-connected-to-the-internet-when-outages-occur/",
          "published_at": "Wed, 11 Feb 2026 19:30:14 +0000",
          "title": "Amazon&#8217;s new eero Signal keeps you connected to the internet when outages occur",
          "standfirst": "A new device from eero will keep you online even if your ISP goes down.",
          "content": "A new device from eero will keep you online even if your ISP goes down.",
          "feed_position": 9
        },
        {
          "source": "ZDNet",
          "url": "https://www.zdnet.com/article/eero-signal-4g-available-buy-now/",
          "published_at": "Wed, 11 Feb 2026 17:30:50 GMT",
          "title": "Eero's new backup device keeps you online when your ISP fails - here's how it works",
          "standfirst": "If you struggle with internet outages, this new Eero device automatically switches your home network to 4G.",
          "content": "If you struggle with internet outages, this new Eero device automatically switches your home network to 4G.",
          "feed_position": 9
        }
      ],
      "popularity_score": 2016.0828147222223
    },
    {
      "id": "cluster_65",
      "coverage": 2,
      "updated_at": "Wed, 11 Feb 2026 12:40:01 -0500",
      "title": "Inertia, co-founded by ex-Twilio CEO Jeff Lawson to build one of the world's most powerful lasers for a grid-scale fusion power plant, raised a $450M Series A (Tim De Chant/TechCrunch)",
      "neutral_headline": "Twilio co-founder’s fusion power startup raises $450M from Bessemer and Alphabet’s GV",
      "bullet_summary": [
        "Reported by TechMeme, TechCrunch"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260211/p35#a260211p35",
          "published_at": "Wed, 11 Feb 2026 12:40:01 -0500",
          "title": "Inertia, co-founded by ex-Twilio CEO Jeff Lawson to build one of the world's most powerful lasers for a grid-scale fusion power plant, raised a $450M Series A (Tim De Chant/TechCrunch)",
          "standfirst": "Tim De Chant / TechCrunch: Inertia, co-founded by ex-Twilio CEO Jeff Lawson to build one of the world's most powerful lasers for a grid-scale fusion power plant, raised a $450M Series A &mdash; Inertia Enterprises has raised $450 million to build one of the world's most powerful lasers, which it hopes will serve &hellip;",
          "content": "Tim De Chant / TechCrunch: Inertia, co-founded by ex-Twilio CEO Jeff Lawson to build one of the world's most powerful lasers for a grid-scale fusion power plant, raised a $450M Series A &mdash; Inertia Enterprises has raised $450 million to build one of the world's most powerful lasers, which it hopes will serve &hellip;",
          "feed_position": 14,
          "image_url": "http://www.techmeme.com/260211/i35.jpg"
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/11/twilio-co-founders-fusion-power-startup-raises-450m-from-bessemer-and-alphabets-gv/",
          "published_at": "Wed, 11 Feb 2026 16:29:43 +0000",
          "title": "Twilio co-founder’s fusion power startup raises $450M from Bessemer and Alphabet’s GV",
          "standfirst": "Inertia Enterprises will use the Series A investment to build one of the world's most powerful lasers, a key part of its power plant design.",
          "content": "Inertia Enterprises will use the Series A investment to build one of the world's most powerful lasers, a key part of its power plant design.",
          "feed_position": 18
        }
      ],
      "featured_image": "http://www.techmeme.com/260211/i35.jpg",
      "popularity_score": 2014.2458702777778
    },
    {
      "id": "cluster_8",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 22:11:40 +0000",
      "title": "Once-hobbled Lumma Stealer is back with lures that are hard to resist",
      "neutral_headline": "Once-hobbled Lumma Stealer is back with lures that are hard to resist",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/02/once-hobbled-lumma-stealer-is-back-with-lures-that-are-hard-to-resist/",
          "published_at": "Wed, 11 Feb 2026 22:11:40 +0000",
          "title": "Once-hobbled Lumma Stealer is back with lures that are hard to resist",
          "standfirst": "ClickFix bait, combined with advanced Castleloader malware, is installing Lumma \"at scale.\"",
          "content": "Last May, law enforcement authorities around the world scored a key win when they hobbled the infrastructure of Lumma, an infostealer that infected nearly 395,000 Windows computers over just a two-month span leading up to the international operation. Researchers said Wednesday that Lumma is once again “back at scale” in hard-to-detect attacks that pilfer credentials and sensitive files. Lumma, also known as Lumma Stealer, first appeared in Russian-speaking cybercrime forums in 2022. Its cloud-based malware-as-a-service model provided a sprawling infrastructure of domains for hosting lure sites offering free cracked software, games, and pirated movies, as well as command-and-control channels and everything else a threat actor needed to run their infostealing enterprise. Within a year, Lumma was selling for as much as $2,500 for premium versions. By the spring of 2024, the FBI counted more than 21,000 listings on crime forums. Last year, Microsoft said Lumma had become the “go-to tool” for multiple crime groups, including Scattered Spider, one of the most prolific groups. Takedowns are hard The FBI and an international coalition of its counterparts took action early last year. In May, they said they seized 2,300 domains, command-and-control infrastructure, and crime marketplaces that had enabled the infostealer to thrive. Recently, however, the malware has made a comeback, allowing it to infect a significant number of machines again.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/exploit-vulnerability-security.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/exploit-vulnerability-security.jpg",
      "popularity_score": 351.77337027777776
    },
    {
      "id": "cluster_11",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 21:51:33 +0000",
      "title": "Byte magazine artist Robert Tinney, who illustrated the birth of PCs, dies at 78",
      "neutral_headline": "Byte magazine artist Robert Tinney, who illustrated the birth of PCs, dies at 78",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/byte-magazine-artist-robert-tinney-who-illustrated-the-birth-of-pcs-dies-at-78/",
          "published_at": "Wed, 11 Feb 2026 21:51:33 +0000",
          "title": "Byte magazine artist Robert Tinney, who illustrated the birth of PCs, dies at 78",
          "standfirst": "He became one of the first to visualize personal computing by painting vivid cover art.",
          "content": "On February 1, Robert Tinney, the illustrator whose airbrushed cover paintings defined the look and feel of pioneering computer magazine Byte for over a decade, died at age 78 in Baker, Louisiana, according to a memorial posted on his official website. As the primary cover artist for Byte from 1975 to the late 1980s, Tinney became one of the first illustrators to give the abstract world of personal computing a coherent visual language, translating topics like artificial intelligence, networking, and programming into vivid, surrealist-influenced paintings that a generation of computer enthusiasts grew up with. Tinney went on to paint more than 80 covers for Byte, working almost entirely in airbrushed Designers Gouache, a medium he chose for its opaque, intense colors and smooth finish. He said the process of creating each cover typically took about a week of painting once a design was approved, following phone conversations with editors about each issue's theme. He cited René Magritte and M.C. Escher as two of his favorite artists, and fans often noticed their influence in his work.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/tinney_byte_hearder_2-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/tinney_byte_hearder_2-1152x648.jpg",
      "popularity_score": 341.4380925
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 21:04:18 +0000",
      "title": "Yes, Rocket Lab is blowing up engines. No, it&#039;s not a big deal, CEO says.",
      "neutral_headline": "Yes, Rocket Lab is blowing up engines. No, it&#039;s not a big deal, CEO says.",
      "bullet_summary": [
        "Reported by Ars Technica Main"
      ],
      "items": [
        {
          "source": "Ars Technica Main",
          "url": "https://arstechnica.com/space/2026/02/yes-rocket-lab-is-blowing-up-engines-no-its-not-a-big-deal-ceo-says/",
          "published_at": "Wed, 11 Feb 2026 21:04:18 +0000",
          "title": "Yes, Rocket Lab is blowing up engines. No, it&#039;s not a big deal, CEO says.",
          "standfirst": "\"We are in the part of the program where we are doing very nasty things to the engine.\"",
          "content": "A little more than two months ago, a Rocket Lab employee called the Stennis Space Center Fire Department from the nearby A3 test stand. There was a grass fire where Archimedes engines undergo testing. Could they please send personnel over? According to the fire station's November 30 dispatcher log, the employee said, \"The fire started during a test when an anomaly caused an electrical box to catch fire.\" Satellite imagery from before and after the anomaly appears to show that the roof had been blown off the left test cell, one of two at the test stand at the historic NASA facility in southern Mississippi. One person with knowledge of the anomaly said, \"The characterization of this as an electrical fire doesn't reflect what actually occurred. This was a catastrophic engine explosion that resulted in significant infrastructure damage.\"Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/archimedes-engines-1152x614.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/archimedes-engines-1152x614.jpg",
      "popularity_score": 330.6505925
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 20:44:19 +0000",
      "title": "OpenAI researcher quits over ChatGPT ads, warns of \"Facebook\" path",
      "neutral_headline": "OpenAI researcher quits over ChatGPT ads, warns of \"Facebook\" path",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/02/openai-researcher-quits-over-fears-that-chatgpt-ads-could-manipulate-users/",
          "published_at": "Wed, 11 Feb 2026 20:44:19 +0000",
          "title": "OpenAI researcher quits over ChatGPT ads, warns of \"Facebook\" path",
          "standfirst": "Zoë Hitzig resigned on the same day OpenAI began testing ads in its chatbot.",
          "content": "On Wednesday, former OpenAI researcher Zoë Hitzig published a guest essay in The New York Times announcing that she resigned from the company on Monday, the same day OpenAI began testing advertisements inside ChatGPT. Hitzig, an economist and published poet who holds a junior fellowship at the Harvard Society of Fellows, spent two years at OpenAI helping shape how its AI models were built and priced. She wrote that OpenAI's advertising strategy risks repeating the same mistakes that Facebook made a decade ago. \"I once believed I could help the people building A.I. get ahead of the problems it would create,\" Hitzig wrote. \"This week confirmed my slow realization that OpenAI seems to have stopped asking the questions I'd joined to help answer.\" Hitzig did not call advertising itself immoral. Instead, she argued that the nature of the data at stake makes ChatGPT ads especially risky. Users have shared medical fears, relationship problems, and religious beliefs with the chatbot, she wrote, often \"because people believed they were talking to something that had no ulterior agenda.\" She called this accumulated record of personal disclosures \"an archive of human candor that has no precedent.\"Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/open-ai-monkey-ad-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/open-ai-monkey-ad-1152x648.jpg",
      "popularity_score": 325.31753694444444
    },
    {
      "id": "cluster_25",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 20:55:02 +0000",
      "title": "Did seabird poop fuel rise of Chincha in Peru?",
      "neutral_headline": "Did seabird poop fuel rise of Chincha in Peru",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/did-seabird-poop-fuel-rise-of-chincha-in-peru/",
          "published_at": "Wed, 11 Feb 2026 20:55:02 +0000",
          "title": "Did seabird poop fuel rise of Chincha in Peru?",
          "standfirst": "Guano dramatically boosted the production of maize, and the surplus helped fuel the Chincha Kingdom’s economy.",
          "content": "The pre-Inca Chincha Kingdom (circa 1000-1400 CE), along Peru's southern coast, was one of the most wealthy and influential of its time before falling to the Inca and Spanish empires. Scientists have long puzzled over the foundation for that prosperity, and it seems one critical factor was bird poop, according to a new paper published in the journal PLoS ONE. “Seabird guano may seem trivial, yet our study suggests this potent resource could have significantly contributed to sociopolitical and economic change in the Peruvian Andes,” said co-author Jacob Bongers, a digital archaeologist at the University of Sydney. “Guano dramatically boosted the production of maize (corn), and this agricultural surplus crucially helped fuel the Chincha Kingdom’s economy, driving their trade, wealth, population growth and regional influence, and shaped their strategic alliance with the Inca Empire. In ancient Andean cultures, fertiliser was power.” Last November, Bongers co-authored a paper detailing evidence supporting the hypothesis that the mysterious \"Band of Holes\" on Mount Sierpe in the Andes might have been an ancient marketplace. Aerial photographs from the 1930s first revealed that long row of around 5,200 precisely aligned holes, seemingly organized into blocked sections, most likely constructed by the Chincha Kingdom. Scholars had suggested various hypotheses for what the site's purpose may have been: defense, storage, or accounting, perhaps, or maybe to collect water and capture fog for local gardens. But nobody had any strong evidence for those suggestions.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/chinchaTOP-1152x648-1770834529.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/chinchaTOP-1152x648-1770834529.jpg",
      "popularity_score": 317.4961480555556
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 20:28:35 +0000",
      "title": "\"Windows 11 26H1\" is a special version of Windows exclusively for new Arm PCs",
      "neutral_headline": "\"Windows 11 26H1\" is a special version of Windows exclusively for new Arm PCs",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/windows-11-26h1-is-a-special-version-of-windows-exclusively-for-new-arm-pcs/",
          "published_at": "Wed, 11 Feb 2026 20:28:35 +0000",
          "title": "\"Windows 11 26H1\" is a special version of Windows exclusively for new Arm PCs",
          "standfirst": "Arm PCs have enjoyed special treatment from Microsoft for the past two years.",
          "content": "Since its release in the fall of 2021, Microsoft's Windows 11 has received an \"annual feature update\" in the second half of every year. These feature updates sometimes include new Windows features and other changes that are too large to roll out in a typical monthly Windows Update, and users need to upgrade to new ones to keep getting security patches and other features. The currently supported versions are Windows 11 24H2 and 25H2, released in the fall of 2024 and 2025, respectively. This week, Microsoft disrupted that update cadence by announcing more information on Windows 11 26H1, which is best described not as an update to Windows 11 but as another version of the operating system entirely. That's because 26H1 is a \"scoped\" release intended exclusively for new PCs, starting with those based on Qualcomm's recently announced Snapdragon X2 Elite chips. Microsoft's support page explains why this release is strange: It won't be released broadly to other Windows 11 PCs, which should continue to use either 24H2 or 25H2. PCs running 24H2 or 25H2 will never be offered an update to version 26H1, though testers in the Windows Insider Program's early access Canary channel are able to install it to other PCs if they want. (Build numbers for Windows 11 26H1 start with 28000, compared to 26100 for 24H2 and 26200 for 25H2.)Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/win11-24h2-1152x648-1770839207.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/win11-24h2-1152x648-1770839207.jpg",
      "popularity_score": 308.0553147222222
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 20:05:44 +0000",
      "title": "US decides SpaceX is like an airline, exempting it from Labor Relations Act",
      "neutral_headline": "US decides SpaceX is like an airline, exempting it from Labor Relations Act",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/victory-for-elon-musk-us-labor-board-abandons-authority-over-spacex/",
          "published_at": "Wed, 11 Feb 2026 20:05:44 +0000",
          "title": "US decides SpaceX is like an airline, exempting it from Labor Relations Act",
          "standfirst": "US labels SpaceX a common carrier by air, will regulate firm under railway law.",
          "content": "The National Labor Relations Board abandoned a Biden-era complaint against SpaceX after a finding that the agency does not have jurisdiction over Elon Musk's space company. The US labor board said SpaceX should instead be regulated under the Railway Labor Act, which governs labor relations at railroad and airline companies. The Railway Labor Act is enforced by a separate agency, the National Mediation Board, and has different rules than the National Labor Relations Act enforced by the NLRB. For example, the Railway Labor Act has an extensive dispute-resolution process that makes it difficult for railroad and airline employees to strike. Employers regulated under the Railway Labor Act are exempt from the National Labor Relations Act. In January 2024, an NLRB regional director alleged in a complaint that SpaceX illegally fired eight employees who, in an open letter, criticized CEO Musk as a “frequent source of embarrassment.\" The complaint sought reinstatement of the employees, back pay, and letters of apology to the fired employees.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/musk-and-trump-1152x648-1770838070.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/musk-and-trump-1152x648-1770838070.jpg",
      "popularity_score": 302.67448138888886
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 19:49:13 +0000",
      "title": "Apple releases iOS 26.3 with updates that mainly benefit non-Apple devices",
      "neutral_headline": "Apple releases iOS 26.3 with updates that mainly benefit non-Apple devices",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/apple-releases-ios-26-3-with-updates-that-mainly-benefit-non-apple-devices/",
          "published_at": "Wed, 11 Feb 2026 19:49:13 +0000",
          "title": "Apple releases iOS 26.3 with updates that mainly benefit non-Apple devices",
          "standfirst": "It's getting a little easier to move from iOS to Android, if that's your thing.",
          "content": "Apple has just released the latest major updates for iOS 26, iPadOS 26, macOS 26 Tahoe, and all the other operating systems it released back in September of 2025. The 26.3 updates for these operating systems are fairly mild, focusing mostly on bug fixes and security patches, but Apple is adding a handful of iPhone features designed to make it easier to use third-party devices in Apple's ecosystem. The first is a \"transfer to Android\" feature that will facilitate switching away from Apple's phones into the Android ecosystem. Apple offers to transfer \"photos, messages, notes, apps, and more,\" as well as the user's phone number, but won't transfer things like Bluetooth pairing information or sensitive data from the Health app. Whether third-party apps can have their data transferred is likely tied to the AppMigrationKit developer framework that Apple added in iOS 26.1. Apps using this framework can import and export data to and from other devices and also access and download content the app has stored in the cloud. Apple notes that AppMigrationKit only functions for transfers from an Apple device to a non-Apple device; Apple already has several systems in place for preserving and transferring data and settings when upgrading from one iPhone to another.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/apple-os-beta-26-2025-1152x648-1750706565.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/apple-os-beta-26-2025-1152x648-1750706565.jpeg",
      "popularity_score": 302.3992036111111
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 20:15:54 +0000",
      "title": "Google recovers \"deleted\" Nest video in high-profile abduction case",
      "neutral_headline": "Google recovers \"deleted\" Nest video in high-profile abduction case",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/02/google-recovers-deleted-nest-video-in-high-profile-abduction-case/",
          "published_at": "Wed, 11 Feb 2026 20:15:54 +0000",
          "title": "Google recovers \"deleted\" Nest video in high-profile abduction case",
          "standfirst": "Users only get three hours of free Nest video storage, but Google can retrieve videos much later.",
          "content": "Like most cloud-enabled home security cameras, Google's Nest products don't provide long-term storage unless you pay a monthly fee. That video may not vanish into the digital aether right on time, though. Investigators involved with the high-profile abduction of Nancy Guthrie have released video from Guthrie's Nest doorbell camera—video that was believed to have been deleted because Guthrie wasn't paying for the service. Google's cameras connect to the recently upgraded Home Premium subscription service. For $10 per month, you get 30 days of stored events, and $20 gets you 60 days of events with 10 days of the full video. If you don't pay anything, Google only saves three hours of event history. After that, the videos are deleted, at least as far as the user is concerned. Newer Nest cameras have limited local storage that can cache clips for a few hours in case connectivity drops out, but there is no option for true local storage. Guthrie's camera was reportedly destroyed by the perpetrators. Suspect in abduction approaches doorbell camera. Expired videos are no longer available to the user, and Google won't restore them even if you later upgrade to a premium account. However, that doesn't mean the data is truly gone. Nancy Guthrie was abducted from her home in the early hours of February 1, and at first, investigators said there was no video of the crime because the doorbell camera was not on a paid account. Yet, video showing a masked individual fiddling with the camera was published on February 10.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Nest-Doorbell-2024-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Nest-Doorbell-2024-1-1152x648.jpg",
      "popularity_score": 301.84392583333334
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 19:35:41 +0000",
      "title": "China showcases new Moon ship and reusable rocket in one extraordinary test",
      "neutral_headline": "China showcases new Moon ship and reusable rocket in one extraordinary test",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/china-showcases-new-moon-ship-and-reusable-rocket-in-one-extraordinary-test/",
          "published_at": "Wed, 11 Feb 2026 19:35:41 +0000",
          "title": "China showcases new Moon ship and reusable rocket in one extraordinary test",
          "standfirst": "The test marks a significant step in China's push to land humans on the Moon by 2030.",
          "content": "China's space program, striving to land astronauts on the Moon by 2030, carried out a test flight of a new reusable booster and crew capsule late Tuesday (US time), and the results were spectacular. The demonstration \"marks a significant breakthrough in the development of [China's] manned lunar exploration program,\" the China Manned Space Agency (CMSA) said in a statement. China and the United States are racing to accomplish the next human landing on the Moon in a competition for national prestige and lunar resources. The Long March 10 rocket and Mengzhou spacecraft, both tested Tuesday, are core elements of China's lunar architecture. The launch of a subscale version of the Long March 10 rocket, still in development, provided engineers with an opportunity to verify the performance of an important part of the new Mengzhou capsule's safety system. The test began with liftoff of the Long March 10 booster from a new launch pad at Wenchang Space Launch Site on Hainan Island, China's southernmost province, at 10 pm EST Tuesday (03:00 UTC or 11 am Beijing time Wednesday).Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2261003763-1152x648-1770837268.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2261003763-1152x648-1770837268.jpg",
      "popularity_score": 264.17364805555553
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 13:16:25 +0000",
      "title": "The Feds closed air space around El Paso on Wednesday to address \"cartel\" drones",
      "neutral_headline": "The Feds closed air space around El Paso on Wednesday to address \"cartel\" drones",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/faa-shuts-down-el-paso-airspace-for-10-days-and-wont-say-why/",
          "published_at": "Wed, 11 Feb 2026 13:16:25 +0000",
          "title": "The Feds closed air space around El Paso on Wednesday to address \"cartel\" drones",
          "standfirst": "Violators were told they would be shot down.",
          "content": "The Federal Aviation Administration abruptly halted flights into and out of El Paso International Airport on Tuesday night at 11:30 pm local time (1:30 am EST Wednesday) and said the restrictions would remain in place for 10 days. In its notice, the FAA also restricted air space extended in a radius of 10 nautical miles from the airport. Violators were subject to being shot down, the agency said. However, less than 10 hours later and without any additional explanation, the FAA ended the restrictions. \"The temporary closure of airspace over El Paso has been lifted,\" the federal agency said on social media. \"There is no threat to commercial aviation. All flights will resume as normal.\"Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2253661753-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2253661753-1024x648.jpg",
      "popularity_score": 165.85253694444444
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 18:18:17 +0000",
      "title": "Smart home PSA: Apple's \"new architecture\" for Home app becomes mandatory today",
      "neutral_headline": "Smart home PSA: Apple's \"new architecture\" for Home app becomes mandatory today",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/smart-home-psa-apples-new-architecture-for-home-app-becomes-mandatory-today/",
          "published_at": "Wed, 11 Feb 2026 18:18:17 +0000",
          "title": "Smart home PSA: Apple's \"new architecture\" for Home app becomes mandatory today",
          "standfirst": "Updated Home app is required for Matter support and some types of accessories.",
          "content": "In 2022, Apple announced it was adopting a \"new Home architecture\" for its smart home ecosystem to improve its performance and reliability and make it possible to support different kinds of accessories. Although it was mostly an invisible update when it worked properly, some users who attempted to switch to the new architecture when it first rolled out in iOS 16.2 ran into slow or unresponsive devices and other problems, prompting Apple to pause the rollout and re-release it as part of iOS 16.4. If you put off transitioning to the new architecture because of those early teething problems or for some other reason, Apple is forcing the issue starting today: You'll need to update to the new Home architecture if you want to continue using the Home app, and older iOS and macOS versions that don't support the new architecture will no longer be able to control your smart home devices. The old version of the Home app and the old Home/HomeKit architecture are no longer supported. If you're like me, you hit an \"upgrade\" button in your Home app years ago and then mostly forgot about it—if you open the Home app on a modern iPhone, iPad, or Mac and don't see an update prompt, it means you're already using the updated architecture and don't need to worry about it.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/GettyImages-1246654852-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/GettyImages-1246654852-1152x648.jpg",
      "popularity_score": 159.88364805555557
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 15:10:19 +0000",
      "title": "What's next after the Trump administration revokes key finding on climate change?",
      "neutral_headline": "What's next after the Trump administration revokes key finding on climate change",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/whats-next-after-the-trump-administration-revokes-key-finding-on-climate-change/",
          "published_at": "Wed, 11 Feb 2026 15:10:19 +0000",
          "title": "What's next after the Trump administration revokes key finding on climate change?",
          "standfirst": "The EPA is revoking the finding for legal, not scientific, reasons.",
          "content": "Following three of the warmest years on record, as scientists reckon with climate tipping points and states and cities grapple with the escalating cost of extreme weather and more intense wildfires, the Trump administration this week is expected to formally eliminate the US government’s role in controlling greenhouse gas pollution. By revoking its 17-year-old scientific finding that greenhouse gases endanger public health and welfare, the Environmental Protection Agency will demolish the legal underpinning of its authority to act on climate change under the Clean Air Act. EPA Administrator Lee Zeldin will be alongside President Donald Trump for an event Wednesday focused on boosting US use of coal, as mercury and air toxics standards are repealed. That is expected to be a prelude to Zeldin finalizing the endangerment finding repeal, an assignment the president handed him in an executive order signed on the first day of his second term in office.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/coal-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/coal-1152x648.jpg",
      "popularity_score": 158.75087027777778
    },
    {
      "id": "cluster_95",
      "coverage": 1,
      "updated_at": "Tue, 10 Feb 2026 23:35:30 +0000",
      "title": "SpaceX's next-gen Super Heavy booster aces four days of \"cryoproof\" testing",
      "neutral_headline": "SpaceX's next-gen Super Heavy booster aces four days of \"cryoproof\" testing",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/spacexs-starbase-is-coming-alive-again-after-a-lull-in-starship-testing/",
          "published_at": "Tue, 10 Feb 2026 23:35:30 +0000",
          "title": "SpaceX's next-gen Super Heavy booster aces four days of \"cryoproof\" testing",
          "standfirst": "The next Starship flight is a key precursor for more ambitious missions.",
          "content": "The upgraded Super Heavy booster slated to launch SpaceX's next Starship flight has completed cryogenic proof testing, clearing a hurdle that resulted in the destruction of the company's previous booster. SpaceX announced the milestone in a social media post Tuesday: \"Cryoproof operations complete for the first time with a Super Heavy V3 booster. This multi-day campaign tested the booster's redesigned propellant systems and its structural strength.\" Ground teams at Starbase, Texas, rolled the 237-foot-tall (72.3-meter) stainless-steel booster out of its factory and transported it a few miles away to Massey's Test Site last week. The test crew first performed a pressure test on the rocket at ambient temperatures, then loaded super-cold liquid nitrogen into the rocket four times over six days, putting the booster through repeated thermal and pressurization cycles. The nitrogen is a stand-in for the cryogenic methane and liquid oxygen that will fill the booster's propellant tanks on launch day.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/b19proof1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/b19proof1-1152x648.jpg",
      "popularity_score": 146
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Tue, 10 Feb 2026 18:54:39 +0000",
      "title": "Yet another co-founder departs Elon Musk's xAI",
      "neutral_headline": "Yet another co-founder departs Elon Musk's xAI",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/02/grok-maker-xai-loses-another-co-founder/",
          "published_at": "Tue, 10 Feb 2026 18:54:39 +0000",
          "title": "Yet another co-founder departs Elon Musk's xAI",
          "standfirst": "Tony Wu leaves a company now entangled with social media, space-based IPOs.",
          "content": "xAI co-founder Tony Wu abruptly announced his resignation from the company late Monday night, the latest in a string of senior executives to leave the Grok-maker in recent months. In a post on social media, Wu expressed warm feelings for his time at xAI, but said it was \"time for my next chapter.\" The current era is one where \"a small team armed with AIs can move mountains and redefine what's possible,\" he wrote. The mention of what \"a small team\" can do could hint at a potential reason for Wu's departure. xAI reportedly had 1,200 employees as of March 2025, a number that included AI engineers and those focused more on the X social network. That number also included 900 employees that served solely as \"AI tutors,\" though roughly 500 of those were reportedly laid off in September.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/xai-grok-1152x648-1752596823.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/xai-grok-1152x648-1752596823.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 12:00:35 +0000",
      "title": "America, it's time to think beyond leather for luxury car seats",
      "neutral_headline": "America, it's time to think beyond leather for luxury car seats",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2026/02/america-its-time-to-think-beyond-leather-for-luxury-car-seats/",
          "published_at": "Wed, 11 Feb 2026 12:00:35 +0000",
          "title": "America, it's time to think beyond leather for luxury car seats",
          "standfirst": "Some brands are already ahead of the curve, while others leave the US in the cold.",
          "content": "A long time ago, in (I believe) an issue of Car Magazine from the mid-1990s, the designer Gordon Murray shared his thoughts about a possible four-door follow-up to the McLaren F1. Road cars weren't really his thing. Until then, his career had been focused on Formula 1 car design, and he brought that sport's obsession with weight savings with him. Were he to design a sedan, he'd trim the interior with textile, not leather. After all, wool made fine suits and coats, Murray reasoned, and it would save weight. A four-door McLaren never happened during his tenure, nor has one appeared since. Murray now runs his own boutique hypercar company, which also builds no sedans. But the idea that high-end cars could use something other than leather has stuck with me, especially after driving BMW's i7, which debuted in 2022 with a premium cashmere wool interior. More recently, new EVs have experimented with interesting textile alternatives to leather. Two good examples are the BMW iX3 and the Audi A6, though neither can be ordered with these textile options in the US.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cloth-seat-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cloth-seat-1152x648.jpg",
      "popularity_score": 141.58864805555555
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Wed, 11 Feb 2026 01:21:12 +0000",
      "title": "FDA refuses to review Moderna's mRNA flu vaccine",
      "neutral_headline": "FDA refuses to review Moderna's mRNA flu vaccine",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/fda-refuses-to-review-modernas-mrna-flu-vaccine/",
          "published_at": "Wed, 11 Feb 2026 01:21:12 +0000",
          "title": "FDA refuses to review Moderna's mRNA flu vaccine",
          "standfirst": "The move comes amid RFK Jr.'s relentless efforts to enact his anti-vaccine agenda.",
          "content": "The Food and Drug Administration has refused to review Moderna's application for an mRNA flu vaccine, the company revealed Tuesday. While the move came as a surprise to the high-profile vaccine maker, it is just the latest hostility toward vaccines—and mRNA vaccines in particular—from an agency overseen by the fervent anti-vaccine activist Robert F. Kennedy Jr. In his first year in office, Kennedy has already dramatically slashed childhood vaccine recommendations and canceled $500 million in research funding for mRNA vaccines against potential pandemic threats. In a news release late Tuesday, Moderna said it was blindsided by the FDA's refusal, which the FDA cited as being due to the design of the company's Phase 3 trial for its mRNA flu vaccine, dubbed mRNA-1010. Specifically, the FDA's rejection was over the comparator vaccine Moderna used.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1290558683.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1290558683.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Tue, 10 Feb 2026 19:29:34 +0000",
      "title": "Archive.today CAPTCHA page executes DDoS; Wikipedia considers banning site",
      "neutral_headline": "Archive.today CAPTCHA page executes DDoS; Wikipedia considers banning site",
      "bullet_summary": [
        "today founder's identity in 2023",
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/wikipedia-might-blacklist-archive-today-after-site-maintainer-ddosed-a-blog/",
          "published_at": "Tue, 10 Feb 2026 19:29:34 +0000",
          "title": "Archive.today CAPTCHA page executes DDoS; Wikipedia considers banning site",
          "standfirst": "DDoS hit blog that tried to uncover Archive.today founder's identity in 2023.",
          "content": "Wikipedia editors are discussing whether to blacklist Archive.today because the archive site was used to direct a distributed denial of service (DDoS) attack against a blogger who wrote a post in 2023 about the mysterious website's anonymous maintainer. In a request for comment page, Wikipedia's volunteer editors were presented with three options. Option A is to remove or hide all Archive.today links and add the site to the spam blacklist. Option B is to deprecate Archive.today, discouraging future link additions while keeping the existing archived links. Option C is to do nothing and maintain the status quo. Option A in particular would be a huge change, as more than 695,000 links to Archive.today are used across 400,000 or so Wikipedia pages. Archive.today, also known as Archive.is, is a website that saves snapshots of webpages and is commonly used to bypass news paywalls.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/wikipedia-1152x648-1754933533.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/wikipedia-1152x648-1754933533.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_102",
      "coverage": 1,
      "updated_at": "Tue, 10 Feb 2026 18:44:32 +0000",
      "title": "Dewormer ivermectin as cancer cure? RFK Jr.'s NIH funds \"absurd\" study.",
      "neutral_headline": "Dewormer ivermectin as cancer cure? RFK Jr.'s NIH funds \"absurd\" study.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/dewormer-ivermectin-as-cancer-cure-rfk-jr-s-nih-funds-absurd-study/",
          "published_at": "Tue, 10 Feb 2026 18:44:32 +0000",
          "title": "Dewormer ivermectin as cancer cure? RFK Jr.'s NIH funds \"absurd\" study.",
          "standfirst": "There's no reason to think ivermectin cures cancer, but RFK Jr's NIH is on it anyway.",
          "content": "The National Cancer Institute is using federal funds to study whether cancer can be cured by ivermectin, a cheap, off-patent anti-parasitic and deworming drug that fringe medical groups falsely claimed could treat COVID-19 during the pandemic and have since touted as a cure-all. Large, high-quality clinical trials have resoundingly concluded that ivermectin is not effective against COVID-19. And there is no old or new scientific evidence to support a hypothesis that ivermectin can cure cancer—or justify any such federal expenditure. But, under anti-vaccine Health Secretary Robert F. Kennedy Jr.—who is otherwise well-known for claiming to have a parasitic worm in his brain—numerous members of the medical fringe are now in powerful federal positions or otherwise hold sway with the administration. During a January 30 event, Anthony Letai, a cancer researcher the Trump administration installed as the director of the NCI in September, said the NCI was pursuing ivermectin.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1232983095-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1232983095-1152x648.jpeg",
      "popularity_score": 133
    },
    {
      "id": "cluster_104",
      "coverage": 1,
      "updated_at": "Tue, 10 Feb 2026 18:04:01 +0000",
      "title": "Windows' original Secure Boot certificates expire in June—here's what you need to do",
      "neutral_headline": "Windows' original Secure Boot certificates expire in June—here's what you need to do",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/02/microsoft-sounds-the-alarm-about-secure-boot-certificates-expiring-later-this-year/",
          "published_at": "Tue, 10 Feb 2026 18:04:01 +0000",
          "title": "Windows' original Secure Boot certificates expire in June—here's what you need to do",
          "standfirst": "PCs without the new certificates could eventually have trouble booting new OSes.",
          "content": "Windows 8 is remembered most for its oddball touchscreen-focused full-screen Start menu, but it also introduced a number of under-the-hood enhancements to Windows. One of those was UEFI Secure Boot, a mechanism for verifying PC bootloaders to ensure that unverified software can't be loaded at startup. Secure Boot was enabled but technically optional for Windows 8 and Windows 10, but it became a formal system requirement for installing Windows starting with Windows 11 in 2021. Secure Boot has relied on the same security certificates to verify bootloaders since 2011, during the development cycle for Windows 8. But those original certificates are set to expire in June and October of this year, something Microsoft is highlighting in a post today. This certificate expiration date isn't news—Microsoft and most major PC makers have been talking about it for months or years, and behind-the-scenes work to get the Windows ecosystem ready has been happening for some time. And renewing security certificates is a routine occurrence that most users only notice when something goes wrong.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/win11-pc-2023-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/win11-pc-2023-1152x648.jpeg",
      "popularity_score": 133
    }
  ]
}