{
  "updated_at": "2025-12-30T11:13:40.742Z",
  "clusters": [
    {
      "id": "cluster_12",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 21:30:29 +0000",
      "title": "US can’t deport hate speech researcher for protected speech, lawsuit says",
      "neutral_headline": "US can’t deport hate speech researcher for protected speech, lawsuit says",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/us-cant-deport-hate-speech-researcher-for-protected-speech-lawsuit-says/",
          "published_at": "Mon, 29 Dec 2025 21:30:29 +0000",
          "title": "US can’t deport hate speech researcher for protected speech, lawsuit says",
          "standfirst": "On Monday, US officials must explain what steps they took to enforce shocking visa bans.",
          "content": "Imran Ahmed's biggest thorn in his side used to be Elon Musk, who made the hate speech researcher one of his earliest legal foes during his Twitter takeover. Now, it's the Trump administration, which planned to deport Ahmed, a legal permanent resident, just before Christmas. It would then ban him from returning to the United States, where he lives with his wife and young child, both US citizens. After suing US officials to block any attempted arrest or deportation, Ahmed was quickly granted a temporary restraining order on Christmas Day. Ahmed had successfully argued that he risked irreparable harm without the order, alleging that Trump officials continue \"to abuse the immigration system to punish and punitively detain noncitizens for protected speech and silence viewpoints with which it disagrees\" and confirming that his speech had been chilled.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1235140398.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1235140398.jpg",
      "popularity_score": 339.2800716666667
    },
    {
      "id": "cluster_19",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 19:30:47 +0000",
      "title": "Leonardo’s wood charring method predates Japanese practice",
      "neutral_headline": "Leonardo’s wood charring method predates Japanese practice",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/did-one-line-in-a-leonardo-codex-anticipate-yakisugi/",
          "published_at": "Mon, 29 Dec 2025 19:30:47 +0000",
          "title": "Leonardo’s wood charring method predates Japanese practice",
          "standfirst": "Yakisugi, a Japanese technique of burning wood surfaces, creates a protective carbonized layer",
          "content": "Yakisugi is a Japanese architectural technique for charring the surface of wood. It has become quite popular in bioarchitecture because the carbonized layer protects the wood from water, fire, insects, and fungi, thereby prolonging the lifespan of the wood. Yakisugi techniques were first codified in written form in the 17th and 18th centuries. But it seems Italian Renaissance polymath Leonardo da Vinci wrote about the protective benefits of charring wood surfaces more than 100 years earlier, according to a paper published in Zenodo, an open repository for EU funded research. Check the notes As previously reported, Leonardo produced more than 13,000 pages in his notebooks (later gathered into codices), less than a third of which have survived. The notebooks contain all manner of inventions that foreshadow future technologies: flying machines, bicycles, cranes, missiles, machine guns, an “unsinkable” double-hulled ship, dredges for clearing harbors and canals, and floating footwear akin to snowshoes to enable a person to walk on water. Leonardo foresaw the possibility of constructing a telescope in his Codex Atlanticus (1490)—he wrote of “making glasses to see the moon enlarged” a century before the instrument’s invention. In 2003, Alessandro Vezzosi, director of Italy’s Museo Ideale, came across some recipes for mysterious mixtures while flipping through Leonardo’s notes. Vezzosi experimented with the recipes, resulting in a mixture that would harden into a material eerily akin to Bakelite, a synthetic plastic widely used in the early 1900s. So Leonardo may well have invented the first manmade plastic.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/leonardo1CROP-1152x648-1767021942.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/leonardo1CROP-1152x648-1767021942.jpg",
      "popularity_score": 327.2850716666667
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 16:30:45 +0000",
      "title": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
      "neutral_headline": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/china-drafts-worlds-strictest-rules-to-end-ai-encouraged-suicide-violence/",
          "published_at": "Mon, 29 Dec 2025 16:30:45 +0000",
          "title": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
          "standfirst": "China wants a human to intervene and notify guardians if suicide is ever mentioned.",
          "content": "China drafted landmark rules to stop AI chatbots from emotionally manipulating users, including what could become the strictest policy worldwide intended to prevent AI-supported suicides, self-harm, and violence. China's Cyberspace Administration proposed the rules on Saturday. If finalized, they would apply to any AI products or services publicly available in China that use text, images, audio, video, or \"other means\" to simulate engaging human conversation. Winston Ma, adjunct professor at NYU School of Law, told CNBC that the \"planned rules would mark the world’s first attempt to regulate AI with human or anthropomorphic characteristics\" at a time when companion bot usage is rising globally. Growing awareness of problems In 2025, researchers flagged major harms of AI companions, including promotion of self-harm, violence, and terrorism. Beyond that, chatbots shared harmful misinformation, made unwanted sexual advances, encouraged substance abuse, and verbally abused users. Some psychiatrists are increasingly ready to link psychosis to chatbot use, the Wall Street Journal reported this weekend, while the most popular chatbot in the world, ChatGPT, has triggered lawsuits over outputs linked to child suicide and murder-suicide.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2175706470-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2175706470-1152x648.jpg",
      "popularity_score": 324.2845161111111
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 19:00:42 +0000",
      "title": "Researchers make “neuromorphic” artificial skin for robots",
      "neutral_headline": "Researchers make “neuromorphic” artificial skin for robots",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/researchers-make-neuromorphic-artificial-skin-for-robots/",
          "published_at": "Mon, 29 Dec 2025 19:00:42 +0000",
          "title": "Researchers make “neuromorphic” artificial skin for robots",
          "standfirst": "Information from sensors is transmitted using neural-style activity spikes.",
          "content": "The nervous system does an astonishing job of tracking sensory information, and does so using signals that would drive many computer scientists insane: a noisy stream of activity spikes that may be transmitted to hundreds of additional neurons, where they are integrated with similar spike trains coming from still other neurons. Now, researchers have used spiking circuitry to build an artificial robotic skin, adopting some of the principles of how signals from our sensory neurons are transmitted and integrated. While the system relies on a few decidedly not-neural features, it has the advantage that we have chips that can run neural networks using spiking signals, which would allow this system to integrate smoothly with some energy-efficient hardware to run AI-based control software. Location via spikes The nervous system in our skin is remarkably complex. It has specialized sensors for different sensations: heat, cold, pressure, pain, and more. In most areas of the body, these feed into the spinal column, where some preliminary processing takes place, allowing reflex reactions to be triggered without even involving the brain. But signals do make their way along specialized neurons into the brain, allowing further processing and (potentially) conscious awareness.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1179602916-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1179602916-1152x648.jpg",
      "popularity_score": 316.78368277777776
    },
    {
      "id": "cluster_41",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 15:30:52 +0000",
      "title": "A quirky guide to myths and lore based in actual science",
      "neutral_headline": "A quirky guide to myths and lore based in actual science",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/a-quirky-guide-to-myths-and-lore-based-in-actual-science/",
          "published_at": "Mon, 29 Dec 2025 15:30:52 +0000",
          "title": "A quirky guide to myths and lore based in actual science",
          "standfirst": "Folklorist/historian Adrienne Mayor on her new book Mythopedia: A Brief Compendium of Natural History Lore",
          "content": "Earthquakes, volcanic eruption, eclipses, meteor showers, and many other natural phenomena have always been part of life on Earth. In ancient cultures that predated science, such events were often memorialized in myths and legends. There is a growing body of research that strives to connect those ancient stories with the real natural events that inspired them. Folklorist and historian Adrienne Mayor has put together a fascinating short compendium of such insights with Mythopedia: A Brief Compendium of Natural History Lore, from dry quicksand and rains of frogs to burning lakes, paleoburrows, and Scandinavian \"endless winters.\" Mayor's work has long straddled multiple disciplines, but one of her specialities is best described as geomythology, a term coined in 1968 by Indiana University geologist Dorothy Vitaliano, who was interested in classical legends about Atlantis and other civilizations that were lost due to natural disasters. Her interest resulted in Vitaliano's 1973 book Legends of the Earth: Their Geologic Origins. Mayor herself became interested in the field when she came across Greek and Roman descriptions of fossils, and that interest expanded over the years to incorporate other examples of \"folk science\" in cultures around the world. Her books include The Poison King: The Life and Legend of Mithradates, Rome's Deadliest Enemy (2009), as well as Greek Fire, Poison Arrows, & the Scorpion Bombs (2022), exploring the origins of biological and chemical warfare. Her 2018 book, Gods and Robots: Myths, Machines, and Ancient Dreams of Technology, explored ancient myths and folklore about creating automation, artificial life, and AI, connecting them to the robots and other ingenious mechanical devices actually designed and built during that era.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/myth1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/myth1-1152x648.jpg",
      "popularity_score": 293.28646055555555
    },
    {
      "id": "cluster_44",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 15:10:16 +0000",
      "title": "GPS is vulnerable to jamming—here’s how we might fix it",
      "neutral_headline": "GPS is vulnerable to jamming—here’s how we might fix it",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/gps-is-vulnerable-to-jamming-heres-how-we-might-fix-it/",
          "published_at": "Mon, 29 Dec 2025 15:10:16 +0000",
          "title": "GPS is vulnerable to jamming—here’s how we might fix it",
          "standfirst": "GPS jamming has gotten cheap and easy, but there are potential solutions.",
          "content": "In September 2025, a Widerøe Airlines flight was trying to land in Vardø, Norway, which sits in the country’s far eastern arm, some 40 miles from the Russian coast. The cloud deck was low, and so was visibility. In such gray situations, pilots use GPS technology to help them land on a runway and not the side of a mountain. But on this day, GPS systems weren’t working correctly, the airwaves jammed with signals that prevented airplanes from accessing navigation information. The Widerøe flight had taken off during one of Russia’s frequent wargames, in which the country’s military simulates conflict as a preparation exercise. This one involved an imaginary war with a country. It was nicknamed Zapad-2025—translating to “West-2025”—and was happening just across the fjord from Vardø. According to European officials, GPS interference was frequent in the runup to the exercise. Russian forces, they suspected, were using GPS-signal-smashing technology, a tactic used in non-pretend conflict, too. (Russia has denied some allegations of GPS interference in the past.) Without that guidance from space, and with the cloudy weather, the Widerøe plane had to abort its landing and continue down the coast away from Russia, to Båtsfjord, a fishing village.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1316617936-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1316617936-1152x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_54",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 13:00:01 +0000",
      "title": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
      "neutral_headline": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/remembering-the-best-and-worst-about-windows-10-on-the-year-it-technically-died/",
          "published_at": "Mon, 29 Dec 2025 13:00:01 +0000",
          "title": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
          "standfirst": "Remembering Windows 10's rollout can help diagnose what ails Windows 11.",
          "content": "If you've been following our coverage for the last few years, you'll already know that 2025 is the year that Windows 10 died. Technically. \"Died,\" because Microsoft's formal end-of-support date came and went on October 14, as the company had been saying for years. \"Technically,\" because it's trivial for home users to get another free year of security updates with a few minutes of effort, and schools and businesses can get an additional two years of updates on top of that, and because load-bearing system apps like Edge and Windows Defender will keep getting updates through at least 2028 regardless. But 2025 was undoubtedly a tipping point for the so-called \"last version of Windows.\" StatCounter data says Windows 11 has overtaken Windows 10 as the most-used version of Windows both in the US (February 2025) and worldwide (July 2025). Its market share slid from just over 44 percent to just under 31 percent in the Steam Hardware Survey. And now that Microsoft's support for the OS has formally ended, games, apps, and drivers are already beginning the gradual process of ending or scaling back official Windows 10 support.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/win10-wallpaper-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/win10-wallpaper-1152x648.jpg",
      "popularity_score": 273
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 12:45:50 +0000",
      "title": "I switched to eSIM in 2025, and I am full of regret",
      "neutral_headline": "I switched to eSIM in 2025, and I am full of regret",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/i-switched-to-esim-in-2025-and-i-am-full-of-regret/",
          "published_at": "Mon, 29 Dec 2025 12:45:50 +0000",
          "title": "I switched to eSIM in 2025, and I am full of regret",
          "standfirst": "Swapping SIM cards used to be easy, and then came eSIM.",
          "content": "SIM cards, the small slips of plastic that have held your mobile subscriber information since time immemorial, are on the verge of extinction. In an effort to save space for other components, device makers are finally dropping the SIM slot, and Google is the latest to move to embedded SIMs with the Pixel 10 series. After long avoiding eSIM, I had no choice but to take the plunge when the time came to review Google's new phones. And boy, do I regret it. The journey to eSIM SIM cards have existed in some form since the '90s. Back then, they were credit card-sized chunks of plastic that occupied a lot of space inside the clunky phones of the era. They slimmed down over time, going through the miniSIM, microSIM, and finally nanoSIM eras. A modern nanoSIM is about the size of your pinky nail, but space is at a premium inside smartphones. Enter, eSIM. The eSIM standard was introduced in 2016, slowly gaining support as a secondary option in smartphones. Rather than holding your phone number on a removable card, an eSIM is a programmable, non-removable component soldered to the circuit board. This allows you to store multiple SIMs and swap between them in software, and no one can swipe your SIM card from the phone. They also take up half as much space compared to a removable card, which is why OEMs have begun dropping the physical slot.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/nanoSIM-card-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/nanoSIM-card-1152x648.jpg",
      "popularity_score": 263
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 12:00:29 +0000",
      "title": "Big Tech basically took Trump’s unpredictable trade war lying down",
      "neutral_headline": "Big Tech basically took Trump’s unpredictable trade war lying down",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/big-tech-basically-took-trumps-unpredictable-trade-war-lying-down/",
          "published_at": "Mon, 29 Dec 2025 12:00:29 +0000",
          "title": "Big Tech basically took Trump’s unpredictable trade war lying down",
          "standfirst": "From Apple gifting a gold statue to the US taking a stake in Intel.",
          "content": "As the first year of Donald Trump's chaotic trade war winds down, the tech industry is stuck scratching its head, with no practical way to anticipate what twists and turns to expect in 2026. Tech companies may have already grown numb to Trump's unpredictable moves. Back in February, Trump warned Americans to expect \"a little pain\" after he issued executive orders imposing 10–25 percent tariffs on imports from America’s biggest trading partners, including Canada, China, and Mexico. Immediately, industry associations sounded the alarm, warning that the costs of consumer tech could increase significantly. By April, Trump had ordered tariffs on all US trade partners to correct claimed trade deficits, using odd math that critics suspected came from a chatbot. (Those tariffs bizarrely targeted uninhabited islands that exported nothing and were populated by penguins.) Costs of tariffs only got higher as the year wore on. But the tech industry has done very little to push back against them. Instead, some of the biggest companies made their own surprising moves after Trump's trade war put them in deeply uncomfortable positions.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/trump-tariffs-triton-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/trump-tariffs-triton-1152x648.jpg",
      "popularity_score": 253
    }
  ]
}