{
  "updated_at": "2025-12-31T11:13:53.811Z",
  "clusters": [
    {
      "id": "cluster_26",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 21:30:04 +0000",
      "title": "The science of how (and when) we decide to speak out—or self-censor",
      "neutral_headline": "The science of how (and when) we decide to speak out—or self-censor",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/the-science-of-how-and-when-we-decide-to-speak-out-or-self-censor/",
          "published_at": "Tue, 30 Dec 2025 21:30:04 +0000",
          "title": "The science of how (and when) we decide to speak out—or self-censor",
          "standfirst": "The study's main takeaway: \"Be bold. It is the thing that slows down authoritarian creep.\"",
          "content": "Freedom of speech is a foundational principle of healthy democracies and hence a primary target for aspiring authoritarians, who typically try to squash dissent. There is a point where the threat from authorities is sufficiently severe that a population will self-censor rather than risk punishment. Social media has complicated matters, blurring traditional boundaries between public and private speech, while new technologies such as facial recognition and moderation algorithms give authoritarians powerful new tools. Researchers explored the nuanced dynamics of how people balance their desire to speak out vs their fear of punishment in a paper published in the Proceedings of the National Academy of Sciences. The authors had previously worked together on a model of political polarization, a project that wrapped up right around the time the social media space was experiencing significant changes in the ways different platforms were handling moderation. Some adopted a decidedly hands-off approach with little to no moderation. Weibo, on the other hand, began releasing the IP addresses of people who posted objectionable commentary, essentially making them targets.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2014/05/censorship_2-1152x648-1767113011.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2014/05/censorship_2-1152x648-1767113011.jpg",
      "popularity_score": 339.2694969444444
    },
    {
      "id": "cluster_28",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 20:45:34 +0000",
      "title": "Lawsuit over Trump rejecting medical research grants is settled",
      "neutral_headline": "Lawsuit over Trump rejecting medical research grants is settled",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/feds-researchers-settle-suit-over-grants-blocked-by-now-illegal-order/",
          "published_at": "Tue, 30 Dec 2025 20:45:34 +0000",
          "title": "Lawsuit over Trump rejecting medical research grants is settled",
          "standfirst": "Settlement forces NIH to review grants previously rejected on ideological grounds.",
          "content": "On Monday, the ACLU announced that it and other organizations representing medical researchers had reached a settlement in their suit against the federal government over grant applications that had been rejected under a policy that has since been voided by the court. The agreement, which still has to be approved by the judge overseeing the case, would see the National Institutes of Health restart reviews of grants that had been blocked on ideological grounds. It doesn't guarantee those grants will ultimately be funded, but it does mean they will go through the standard peer review process. The grants had previously been rejected without review because their content was ideologically opposed by the Trump administration. That policy has since been declared arbitrary and capricious, and thus in violation of the Administrative Procedure Act, a decision that was upheld by the Supreme Court. How'd we get here? Immediately after taking office, the Trump Administration identified a number of categories of research, some of them extremely vague, that it would not be supporting: climate change, DEI, pandemic preparedness, gender ideology, and more. Shortly thereafter, federal agencies started cancelling grants that they deemed to contain elements of these disfavored topics, and blocking consideration of grant applications for the same reasons. As a result, grants were cancelled that funded everything from research into antiviral drugs to the incidence of prostate cancer in African Americans.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2224898877-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2224898877-1024x648.jpg",
      "popularity_score": 328.52783027777775
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 20:30:01 +0000",
      "title": "DOGE did not find $2T in fraud, but that doesn’t matter, Musk allies say",
      "neutral_headline": "DOGE did not find $2T in fraud, but that doesn’t matter, Musk allies say",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/doge-did-not-find-2t-in-fraud-but-that-doesnt-matter-musk-allies-say/",
          "published_at": "Tue, 30 Dec 2025 20:30:01 +0000",
          "title": "DOGE did not find $2T in fraud, but that doesn’t matter, Musk allies say",
          "standfirst": "Musk allies spin DOGE as having a \"higher purpose\" beyond federal budget cuts.",
          "content": "Determining how \"successful\" Elon Musk's Department of Government Efficiency (DOGE) truly was depends on who you ask, but it's increasingly hard to claim that DOGE made any sizable dent in federal spending, which was its primary goal. Just two weeks ago, Musk himself notably downplayed DOGE as only being \"a little bit successful\" on a podcast, marking one of the first times that Musk admitted DOGE didn't live up to its promise. Then, more recently, on Monday, Musk revived evidence-free claims he made while campaigning for Donald Trump, insisting that government fraud remained vast and unchecked, seemingly despite DOGE's efforts. On X, he estimated that \"my lower bound guess for how much fraud there is nationally is [about 20 percent] of the Federal budget, which would mean $1.5 trillion per year. Probably much higher.\" Musk loudly left DOGE in May after clashing with Trump, complaining that a Trump budget bill threatened to undermine DOGE's work. These days, Musk does not appear confident that DOGE was worth the trouble of wading into government. Although he said on the December podcast that he considered DOGE to be his \"best side quest\" ever, the billionaire confirmed that if given the chance to go back in time, he probably would not have helmed the agency as a special government employee.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2217857584-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2217857584-1024x648.jpg",
      "popularity_score": 318.2686636111111
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 19:00:00 +0000",
      "title": "Stranger Things series finale trailer is here",
      "neutral_headline": "Stranger Things series finale trailer is here",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/stranger-things-series-finale-trailer-is-here/",
          "published_at": "Tue, 30 Dec 2025 19:00:00 +0000",
          "title": "Stranger Things series finale trailer is here",
          "standfirst": "Netflix's finale will also have a two-day theatrical release to more than 600 locations.",
          "content": "Stranger Things fans are hyped for the premiere of the hotly anticipated series finale on New Year's Eve: they'll either be glued to their TVs or heading out to watch it in a bona fide theater. Netflix has dropped one last trailer for the finale—not that it really needs to do anything more to boost anticipation. (Some spoilers for Vols. 1 and 2 below but no major Vol. 2 reveals.) As previously reported, in Vol. 1, we found Hawkins under military occupation and Vecna targeting a new group of young children in his human form under the pseudonym “Mr. Whatsit” (a nod to A Wrinkle in Time). He kidnapped Holly Wheeler and took her to the Upside Down, where she found an ally in Max, still in a coma, but with her consciousness hiding in one of Vecna’s old memories. Dustin was struggling to process his grief over losing Eddie Munson in S4, causing a rift with Steve. The rest of the gang was devoted to stockpiling supplies and helping Eleven and Hopper track down Vecna in the Upside Down. They found Kali/Eight, Eleven’s psychic “sister” instead, being held captive in a military laboratory.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/finale3-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/finale3-1152x648.jpg",
      "popularity_score": 308.76838583333335
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 20:00:43 +0000",
      "title": "NJ’s answer to flooding: it has bought out and demolished 1,200 properties",
      "neutral_headline": "NJ’s answer to flooding: it has bought out and demolished 1,200 properties",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/as-floods-become-more-severe-a-new-jersey-program-provides-a-model/",
          "published_at": "Tue, 30 Dec 2025 20:00:43 +0000",
          "title": "NJ’s answer to flooding: it has bought out and demolished 1,200 properties",
          "standfirst": "The state deals with flooding and sea level rise by buying homes in flood prone areas.",
          "content": "MANVILLE, N.J.—Richard Onderko said he will never forget the terrifying Saturday morning back in 1971 when the water rose so swiftly at his childhood home here that he and his brother had to be rescued by boat as the torrential rain from the remnants of Hurricane Doria swept through the neighborhood. It wasn’t the first time—or the last—that the town endured horrific downpours. In fact, the working-class town of 11,000, about 25 miles southwest of Newark, has long been known for getting swamped by tropical storms, nor’easters or even just a wicked rain. It was so bad, Onderko recalled, that the constant threat of flooding had strained his parents’ marriage, with his mom wanting to sell and his dad intent on staying. Eventually, his parents moved to Florida, selling the two-story house on North Second Avenue in 1995. But the new homeowner didn’t do so well either when storms hit, and in 2015, the property was sold one final time: to a state-run program that buys and demolishes houses in flood zones and permanently restores the property to open space.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-113500412-1152x648-1767123440.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-113500412-1152x648-1767123440.jpg",
      "popularity_score": 307.78033027777775
    },
    {
      "id": "cluster_37",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 18:45:54 +0000",
      "title": "Condé Nast user database reportedly breached, Ars unaffected",
      "neutral_headline": "Condé Nast user database reportedly breached, Ars unaffected",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/conde-nast-user-database-reportedly-breached-ars-unaffected/",
          "published_at": "Tue, 30 Dec 2025 18:45:54 +0000",
          "title": "Condé Nast user database reportedly breached, Ars unaffected",
          "standfirst": "A serious data breach has occurred, but Ars users have nothing to worry about.",
          "content": "Earlier this month, a hacker named Lovely claimed to have breached a Condé Nast user database and released a list of more than 2.3 million user records from our sister publication WIRED. The released materials contain demographic information (name, email, address, phone, etc.) but no passwords. The hacker also says that they will release an additional 40 million records for other Condé Nast properties, including our other sister publications Vogue, The New Yorker, Vanity Fair, and more. Of critical note to our readers, Ars Technica was not affected as we run on our own bespoke tech stack. The hacker said that they had urged Condé Nast to patch vulnerabilities to no avail. “Condé Nast does not care about the security of their users data,” the hacker wrote. “It took us an entire month to convince them to fix the vulnerabilities on their websites. We will leak more of their users’ data (40+ million) over the next few weeks. Enjoy!”Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/conde-hack-20205-1152x648-1767119864.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/conde-hack-20205-1152x648-1767119864.jpg",
      "popularity_score": 286.53338583333334
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 15:00:56 +0000",
      "title": "Looking for friends, lobsters may stumble into an ecological trap",
      "neutral_headline": "Looking for friends, lobsters may stumble into an ecological trap",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/looking-for-friends-lobsters-may-stumble-into-an-ecological-trap/",
          "published_at": "Tue, 30 Dec 2025 15:00:56 +0000",
          "title": "Looking for friends, lobsters may stumble into an ecological trap",
          "standfirst": "Gathering for mutual defense puts young spiny lobsters at risk of predators.",
          "content": "Lobsters are generally notable for their large claws, which can serve as a deterrent to any predators. But there's a whole family of spiny lobsters that lack these claws. They tend to ward off predators by forming large groups that collectively can present a lot of pointy bits towards anything attempting to eat them. In fact, studies found that the lobsters can sense the presence of other species-members using molecules emitted into the water, and use that to find peers to congregate with. A new study, however, finds that this same signal may lure young lobsters to their doom, causing them to try to congregate with older lobsters that are too big to be eaten by nearby predators. The smaller lobsters thus fall victim to a phenomenon called an \"ecological trap,\" which has rarely been seen to occur without human intervention. Lobsters vs. groupers The study was performed in the waters off Florida, where the seafloor is dotted by what are called \"solution holes.\" These features are the product of lower sea levels such as those that occur during periods of expanded glaciers and ice caps. During these times, much of the area off Florida was above sea level, and water dissolved the limestone rocks unevenly. This created an irregular array of small shallow pits and crevices, many of which have been reshaped by sea life since the area was submerged again.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2251921243-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2251921243-1152x648.jpg",
      "popularity_score": 273
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 14:00:27 +0000",
      "title": "The top 5 most horrifying and fascinating medical cases of 2025",
      "neutral_headline": "The top 5 most horrifying and fascinating medical cases of 2025",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/the-top-5-most-horrifying-and-fascinating-medical-cases-of-2025/",
          "published_at": "Tue, 30 Dec 2025 14:00:27 +0000",
          "title": "The top 5 most horrifying and fascinating medical cases of 2025",
          "standfirst": "Florida man makes two appearances on the list.",
          "content": "There were a lot of horrifying things in the news this year—a lot. But some of it was horrifying in a good way. Extraordinary medical cases—even the grisly and disturbing ones—offer a reprieve from the onslaught of current events and the stresses of our daily lives. With those remarkable reports, we can marvel at the workings, foibles, and resilience of the human body. They can remind us of the shared indignities from our existence in these mortal meatsacks. We can clear our minds of worry by learning about something we never even knew we should worry about—or by counting our blessings for avoiding so far. And sometimes, the reports are just grotesquely fascinating. Every year, there's a new lineup of such curious clinical conditions. There are always some unfortunate souls to mark medical firsts or present ultra-rare cases. There is also an endless stream of humans making poor life choices—and arriving at an emergency department with the results. This year was no different.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/moles-many-medical-marvels-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/moles-many-medical-marvels-1152x648.jpg",
      "popularity_score": 263
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Tue, 30 Dec 2025 13:30:40 +0000",
      "title": "The 10 best vehicles Ars Technica drove in 2025",
      "neutral_headline": "The 10 best vehicles Ars Technica drove in 2025",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/the-10-best-vehicles-ars-technica-drove-in-2025/",
          "published_at": "Tue, 30 Dec 2025 13:30:40 +0000",
          "title": "The 10 best vehicles Ars Technica drove in 2025",
          "standfirst": "Of all the cars we've driven and reviewed this year, these are our picks.",
          "content": "2025 has been a tumultuous year for the car world. After years of EV optimism, revanchists are pushing back against things like clean energy and fuel economy. Automakers have responded, postponing or canceling new electric vehicles in favor of gasoline-burning ones. It hasn't been all bad, though. Despite the changing winds, EV infrastructure continues to be built out and, anecdotally at least, feels far more reliable. We got to witness a pretty epic Formula 1 season right to the wire, in addition to some great sports car and Formula E racing. And we drove a whole bunch of cars, some of which stood out from the pack. Here are the 10 best things we sat behind the wheel of in 2025. 10th: Lotus Emira V6 A Lotus Emira doesn't need to be painted this bright color to remind you that driving can be a pleasure. Credit: Peter Nelson Let's be frank: The supposed resurgence of Lotus hasn't exactly gone to plan. When Geely bought the British Automaker in 2017, many of us hoped that the Chinese company would do for Lotus what it did for Volvo, only in Hethel instead of Gothenburg. Even before tariffs and other protectionist measures undermined the wisdom of building new Lotuses in China, the fact that most of these new cars were big, heavy EVs had already made them a hard sell. But a more traditional Lotus exists and is still built in Norfolk, England: the Lotus Emira.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-cars-2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-best-cars-2025-1152x648.jpg",
      "popularity_score": 250
    },
    {
      "id": "cluster_80",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 21:30:29 +0000",
      "title": "US can’t deport hate speech researcher for protected speech, lawsuit says",
      "neutral_headline": "US can’t deport hate speech researcher for protected speech, lawsuit says",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/us-cant-deport-hate-speech-researcher-for-protected-speech-lawsuit-says/",
          "published_at": "Mon, 29 Dec 2025 21:30:29 +0000",
          "title": "US can’t deport hate speech researcher for protected speech, lawsuit says",
          "standfirst": "On Monday, US officials must explain what steps they took to enforce shocking visa bans.",
          "content": "Imran Ahmed's biggest thorn in his side used to be Elon Musk, who made the hate speech researcher one of his earliest legal foes during his Twitter takeover. Now, it's the Trump administration, which planned to deport Ahmed, a legal permanent resident, just before Christmas. It would then ban him from returning to the United States, where he lives with his wife and young child, both US citizens. After suing US officials to block any attempted arrest or deportation, Ahmed was quickly granted a temporary restraining order on Christmas Day. Ahmed had successfully argued that he risked irreparable harm without the order, alleging that Trump officials continue \"to abuse the immigration system to punish and punitively detain noncitizens for protected speech and silence viewpoints with which it disagrees\" and confirming that his speech had been chilled.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1235140398.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1235140398.jpg",
      "popularity_score": 243
    },
    {
      "id": "cluster_90",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 16:30:45 +0000",
      "title": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
      "neutral_headline": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/china-drafts-worlds-strictest-rules-to-end-ai-encouraged-suicide-violence/",
          "published_at": "Mon, 29 Dec 2025 16:30:45 +0000",
          "title": "China drafts world’s strictest rules to end AI-encouraged suicide, violence",
          "standfirst": "China wants a human to intervene and notify guardians if suicide is ever mentioned.",
          "content": "China drafted landmark rules to stop AI chatbots from emotionally manipulating users, including what could become the strictest policy worldwide intended to prevent AI-supported suicides, self-harm, and violence. China's Cyberspace Administration proposed the rules on Saturday. If finalized, they would apply to any AI products or services publicly available in China that use text, images, audio, video, or \"other means\" to simulate engaging human conversation. Winston Ma, adjunct professor at NYU School of Law, told CNBC that the \"planned rules would mark the world’s first attempt to regulate AI with human or anthropomorphic characteristics\" at a time when companion bot usage is rising globally. Growing awareness of problems In 2025, researchers flagged major harms of AI companions, including promotion of self-harm, violence, and terrorism. Beyond that, chatbots shared harmful misinformation, made unwanted sexual advances, encouraged substance abuse, and verbally abused users. Some psychiatrists are increasingly ready to link psychosis to chatbot use, the Wall Street Journal reported this weekend, while the most popular chatbot in the world, ChatGPT, has triggered lawsuits over outputs linked to child suicide and murder-suicide.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2175706470-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2175706470-1152x648.jpg",
      "popularity_score": 153
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 19:30:47 +0000",
      "title": "Leonardo’s wood charring method predates Japanese practice",
      "neutral_headline": "Leonardo’s wood charring method predates Japanese practice",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/did-one-line-in-a-leonardo-codex-anticipate-yakisugi/",
          "published_at": "Mon, 29 Dec 2025 19:30:47 +0000",
          "title": "Leonardo’s wood charring method predates Japanese practice",
          "standfirst": "Yakisugi, a Japanese technique of burning wood surfaces, creates a protective carbonized layer",
          "content": "Yakisugi is a Japanese architectural technique for charring the surface of wood. It has become quite popular in bioarchitecture because the carbonized layer protects the wood from water, fire, insects, and fungi, thereby prolonging the lifespan of the wood. Yakisugi techniques were first codified in written form in the 17th and 18th centuries. But it seems Italian Renaissance polymath Leonardo da Vinci wrote about the protective benefits of charring wood surfaces more than 100 years earlier, according to a paper published in Zenodo, an open repository for EU funded research. Check the notes As previously reported, Leonardo produced more than 13,000 pages in his notebooks (later gathered into codices), less than a third of which have survived. The notebooks contain all manner of inventions that foreshadow future technologies: flying machines, bicycles, cranes, missiles, machine guns, an “unsinkable” double-hulled ship, dredges for clearing harbors and canals, and floating footwear akin to snowshoes to enable a person to walk on water. Leonardo foresaw the possibility of constructing a telescope in his Codex Atlanticus (1490)—he wrote of “making glasses to see the moon enlarged” a century before the instrument’s invention. In 2003, Alessandro Vezzosi, director of Italy’s Museo Ideale, came across some recipes for mysterious mixtures while flipping through Leonardo’s notes. Vezzosi experimented with the recipes, resulting in a mixture that would harden into a material eerily akin to Bakelite, a synthetic plastic widely used in the early 1900s. So Leonardo may well have invented the first manmade plastic.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/leonardo1CROP-1152x648-1767021942.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/leonardo1CROP-1152x648-1767021942.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 19:00:42 +0000",
      "title": "Researchers make “neuromorphic” artificial skin for robots",
      "neutral_headline": "Researchers make “neuromorphic” artificial skin for robots",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/researchers-make-neuromorphic-artificial-skin-for-robots/",
          "published_at": "Mon, 29 Dec 2025 19:00:42 +0000",
          "title": "Researchers make “neuromorphic” artificial skin for robots",
          "standfirst": "Information from sensors is transmitted using neural-style activity spikes.",
          "content": "The nervous system does an astonishing job of tracking sensory information, and does so using signals that would drive many computer scientists insane: a noisy stream of activity spikes that may be transmitted to hundreds of additional neurons, where they are integrated with similar spike trains coming from still other neurons. Now, researchers have used spiking circuitry to build an artificial robotic skin, adopting some of the principles of how signals from our sensory neurons are transmitted and integrated. While the system relies on a few decidedly not-neural features, it has the advantage that we have chips that can run neural networks using spiking signals, which would allow this system to integrate smoothly with some energy-efficient hardware to run AI-based control software. Location via spikes The nervous system in our skin is remarkably complex. It has specialized sensors for different sensations: heat, cold, pressure, pain, and more. In most areas of the body, these feed into the spinal column, where some preliminary processing takes place, allowing reflex reactions to be triggered without even involving the brain. But signals do make their way along specialized neurons into the brain, allowing further processing and (potentially) conscious awareness.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1179602916-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1179602916-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 15:30:52 +0000",
      "title": "A quirky guide to myths and lore based in actual science",
      "neutral_headline": "A quirky guide to myths and lore based in actual science",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/a-quirky-guide-to-myths-and-lore-based-in-actual-science/",
          "published_at": "Mon, 29 Dec 2025 15:30:52 +0000",
          "title": "A quirky guide to myths and lore based in actual science",
          "standfirst": "Folklorist/historian Adrienne Mayor on her new book Mythopedia: A Brief Compendium of Natural History Lore",
          "content": "Earthquakes, volcanic eruption, eclipses, meteor showers, and many other natural phenomena have always been part of life on Earth. In ancient cultures that predated science, such events were often memorialized in myths and legends. There is a growing body of research that strives to connect those ancient stories with the real natural events that inspired them. Folklorist and historian Adrienne Mayor has put together a fascinating short compendium of such insights with Mythopedia: A Brief Compendium of Natural History Lore, from dry quicksand and rains of frogs to burning lakes, paleoburrows, and Scandinavian \"endless winters.\" Mayor's work has long straddled multiple disciplines, but one of her specialities is best described as geomythology, a term coined in 1968 by Indiana University geologist Dorothy Vitaliano, who was interested in classical legends about Atlantis and other civilizations that were lost due to natural disasters. Her interest resulted in Vitaliano's 1973 book Legends of the Earth: Their Geologic Origins. Mayor herself became interested in the field when she came across Greek and Roman descriptions of fossils, and that interest expanded over the years to incorporate other examples of \"folk science\" in cultures around the world. Her books include The Poison King: The Life and Legend of Mithradates, Rome's Deadliest Enemy (2009), as well as Greek Fire, Poison Arrows, & the Scorpion Bombs (2022), exploring the origins of biological and chemical warfare. Her 2018 book, Gods and Robots: Myths, Machines, and Ancient Dreams of Technology, explored ancient myths and folklore about creating automation, artificial life, and AI, connecting them to the robots and other ingenious mechanical devices actually designed and built during that era.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/myth1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/myth1-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_93",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 15:10:16 +0000",
      "title": "GPS is vulnerable to jamming—here’s how we might fix it",
      "neutral_headline": "GPS is vulnerable to jamming—here’s how we might fix it",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/gps-is-vulnerable-to-jamming-heres-how-we-might-fix-it/",
          "published_at": "Mon, 29 Dec 2025 15:10:16 +0000",
          "title": "GPS is vulnerable to jamming—here’s how we might fix it",
          "standfirst": "GPS jamming has gotten cheap and easy, but there are potential solutions.",
          "content": "In September 2025, a Widerøe Airlines flight was trying to land in Vardø, Norway, which sits in the country’s far eastern arm, some 40 miles from the Russian coast. The cloud deck was low, and so was visibility. In such gray situations, pilots use GPS technology to help them land on a runway and not the side of a mountain. But on this day, GPS systems weren’t working correctly, the airwaves jammed with signals that prevented airplanes from accessing navigation information. The Widerøe flight had taken off during one of Russia’s frequent wargames, in which the country’s military simulates conflict as a preparation exercise. This one involved an imaginary war with a country. It was nicknamed Zapad-2025—translating to “West-2025”—and was happening just across the fjord from Vardø. According to European officials, GPS interference was frequent in the runup to the exercise. Russian forces, they suspected, were using GPS-signal-smashing technology, a tactic used in non-pretend conflict, too. (Russia has denied some allegations of GPS interference in the past.) Without that guidance from space, and with the cloudy weather, the Widerøe plane had to abort its landing and continue down the coast away from Russia, to Båtsfjord, a fishing village.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1316617936-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1316617936-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_98",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 13:00:01 +0000",
      "title": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
      "neutral_headline": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/remembering-the-best-and-worst-about-windows-10-on-the-year-it-technically-died/",
          "published_at": "Mon, 29 Dec 2025 13:00:01 +0000",
          "title": "Remembering what Windows 10 did right—and how it made modern Windows more annoying",
          "standfirst": "Remembering Windows 10's rollout can help diagnose what ails Windows 11.",
          "content": "If you've been following our coverage for the last few years, you'll already know that 2025 is the year that Windows 10 died. Technically. \"Died,\" because Microsoft's formal end-of-support date came and went on October 14, as the company had been saying for years. \"Technically,\" because it's trivial for home users to get another free year of security updates with a few minutes of effort, and schools and businesses can get an additional two years of updates on top of that, and because load-bearing system apps like Edge and Windows Defender will keep getting updates through at least 2028 regardless. But 2025 was undoubtedly a tipping point for the so-called \"last version of Windows.\" StatCounter data says Windows 11 has overtaken Windows 10 as the most-used version of Windows both in the US (February 2025) and worldwide (July 2025). Its market share slid from just over 44 percent to just under 31 percent in the Steam Hardware Survey. And now that Microsoft's support for the OS has formally ended, games, apps, and drivers are already beginning the gradual process of ending or scaling back official Windows 10 support.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/win10-wallpaper-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/win10-wallpaper-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_100",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 12:45:50 +0000",
      "title": "I switched to eSIM in 2025, and I am full of regret",
      "neutral_headline": "I switched to eSIM in 2025, and I am full of regret",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/i-switched-to-esim-in-2025-and-i-am-full-of-regret/",
          "published_at": "Mon, 29 Dec 2025 12:45:50 +0000",
          "title": "I switched to eSIM in 2025, and I am full of regret",
          "standfirst": "Swapping SIM cards used to be easy, and then came eSIM.",
          "content": "SIM cards, the small slips of plastic that have held your mobile subscriber information since time immemorial, are on the verge of extinction. In an effort to save space for other components, device makers are finally dropping the SIM slot, and Google is the latest to move to embedded SIMs with the Pixel 10 series. After long avoiding eSIM, I had no choice but to take the plunge when the time came to review Google's new phones. And boy, do I regret it. The journey to eSIM SIM cards have existed in some form since the '90s. Back then, they were credit card-sized chunks of plastic that occupied a lot of space inside the clunky phones of the era. They slimmed down over time, going through the miniSIM, microSIM, and finally nanoSIM eras. A modern nanoSIM is about the size of your pinky nail, but space is at a premium inside smartphones. Enter, eSIM. The eSIM standard was introduced in 2016, slowly gaining support as a secondary option in smartphones. Rather than holding your phone number on a removable card, an eSIM is a programmable, non-removable component soldered to the circuit board. This allows you to store multiple SIMs and swap between them in software, and no one can swipe your SIM card from the phone. They also take up half as much space compared to a removable card, which is why OEMs have begun dropping the physical slot.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/nanoSIM-card-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/nanoSIM-card-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_102",
      "coverage": 1,
      "updated_at": "Mon, 29 Dec 2025 12:00:29 +0000",
      "title": "Big Tech basically took Trump’s unpredictable trade war lying down",
      "neutral_headline": "Big Tech basically took Trump’s unpredictable trade war lying down",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/big-tech-basically-took-trumps-unpredictable-trade-war-lying-down/",
          "published_at": "Mon, 29 Dec 2025 12:00:29 +0000",
          "title": "Big Tech basically took Trump’s unpredictable trade war lying down",
          "standfirst": "From Apple gifting a gold statue to the US taking a stake in Intel.",
          "content": "As the first year of Donald Trump's chaotic trade war winds down, the tech industry is stuck scratching its head, with no practical way to anticipate what twists and turns to expect in 2026. Tech companies may have already grown numb to Trump's unpredictable moves. Back in February, Trump warned Americans to expect \"a little pain\" after he issued executive orders imposing 10–25 percent tariffs on imports from America’s biggest trading partners, including Canada, China, and Mexico. Immediately, industry associations sounded the alarm, warning that the costs of consumer tech could increase significantly. By April, Trump had ordered tariffs on all US trade partners to correct claimed trade deficits, using odd math that critics suspected came from a chatbot. (Those tariffs bizarrely targeted uninhabited islands that exported nothing and were populated by penguins.) Costs of tariffs only got higher as the year wore on. But the tech industry has done very little to push back against them. Instead, some of the biggest companies made their own surprising moves after Trump's trade war put them in deeply uncomfortable positions.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/trump-tariffs-triton-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/11/trump-tariffs-triton-1152x648.jpg",
      "popularity_score": 133
    }
  ]
}