{
  "updated_at": "2026-01-18T07:15:00.895Z",
  "clusters": [
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 23:15:27 +0000",
      "title": "Rackspace customers grapple with “devastating” email hosting price hike",
      "neutral_headline": "Rackspace customers grapple with “devastating” email hosting price hike",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/rackspace-raises-email-hosting-prices-by-as-much-as-706-percent/",
          "published_at": "Fri, 16 Jan 2026 23:15:27 +0000",
          "title": "Rackspace customers grapple with “devastating” email hosting price hike",
          "standfirst": "Reseller says Rackspace plans to charge it 706 percent more.",
          "content": "Rackspace’s new pricing for its email hosting services is “devastating,” according to a partner that has been using Rackspace as its email provider since 1999. In recent weeks, Rackspace updated its email hosting pricing. Its standard plan is now $10 per mailbox per month. Businesses can also pay for the Rackspace Email Plus add-on for an extra $2/mailbox/month (for “file storage, mobile sync, Office-compatible apps, and messaging”), and the Archiving add-on for an extra $6/mailbox/month (for unlimited storage). As recently as November 2025, Rackspace charged $3/mailbox/month for its Standard plan, and an extra $1/mailbox/month for the Email Plus add-on, and an additional $3/mailbox/month for the Archival add-on, according to the Internet Archive’s Wayback Machine.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2206289956-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2206289956-1024x648.jpg",
      "popularity_score": 354
    },
    {
      "id": "cluster_20",
      "coverage": 1,
      "updated_at": "Sat, 17 Jan 2026 12:00:11 +0000",
      "title": "Meta’s layoffs leave Supernatural fitness users in mourning",
      "neutral_headline": "Meta’s layoffs leave Supernatural fitness users in mourning",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/metas-layoffs-leave-supernatural-fitness-users-in-mourning/",
          "published_at": "Sat, 17 Jan 2026 12:00:11 +0000",
          "title": "Meta’s layoffs leave Supernatural fitness users in mourning",
          "standfirst": "Supernatural has had its staff cut and won’t receive any more content updates.",
          "content": "Tencia Benavidez, a Supernatural user who lives in New Mexico, started her VR workouts during the Covid pandemic. She has been a regular user in the five years since, calling the ability to work out in VR ideal, given that she lives in a rural area where it’s hard to get to a gym or work out outside during a brutal winter. She stuck with Supernatural because of the community and the eagerness of Supernatural’s coaches. “They seem like really authentic individuals that were not talking down to you,” Benavidez says. “There's just something really special about those coaches.” Meta bought Supernatural in 2022, folding it into its then-heavily-invested-in metaverse efforts. The purchase was not a smooth process, as it triggered a lengthy legal battle in which the US Federal Trade Commission tried to block Meta from purchasing the service due to antitrust concerns about Meta “trying to buy its way to the top” of the VR market. Meta ultimately prevailed. At the time, some Supernatural users were cautiously optimistic, hoping that big bag of Zuckerbucks could keep its workout juggernaut afloat.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/06_Lifestyle-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/06_Lifestyle-1152x648.jpg",
      "popularity_score": 333.75280694444444
    },
    {
      "id": "cluster_34",
      "coverage": 1,
      "updated_at": "Sat, 17 Jan 2026 04:45:33 +0000",
      "title": "Managers on alert for “launch fever” as pressure builds for NASA’s Moon mission",
      "neutral_headline": "Managers on alert for “launch fever” as pressure builds for NASA’s Moon mission",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/managers-on-alert-for-launch-fever-as-pressure-builds-for-nasas-moon-mission/",
          "published_at": "Sat, 17 Jan 2026 04:45:33 +0000",
          "title": "Managers on alert for “launch fever” as pressure builds for NASA’s Moon mission",
          "standfirst": "\"I’ve got one job, and it’s the safe return of Reid, Victor, Christina, and Jeremy.\"",
          "content": "KENNEDY SPACE CENTER, Florida—The rocket NASA is preparing to send four astronauts on a trip around the Moon will emerge from its assembly building on Florida's Space Coast early Saturday for a slow crawl to its seaside launch pad. Riding atop one of NASA's diesel-powered crawler transporters, the Space Launch System rocket and its mobile launch platform will exit the Vehicle Assembly Building at Kennedy Space Center around 7:00 am EST (11:00 UTC). The massive tracked transporter, certified by Guinness as the world's heaviest self-propelled vehicle, is expected to cover the four miles between the assembly building and Launch Complex 39B in about eight to 10 hours. The rollout marks a major step for NASA's Artemis II mission, the first human voyage to the vicinity of the Moon since the last Apollo lunar landing in December 1972. Artemis II will not land. Instead, a crew of four astronauts will travel around the far side of the Moon at a distance of several thousand miles, setting the record for the farthest humans have ever ventured from Earth.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Artemis-II-Trajectory-Thumbnail-1-1152x648-1768622903.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Artemis-II-Trajectory-Thumbnail-1-1152x648-1768622903.jpg",
      "popularity_score": 329
    },
    {
      "id": "cluster_47",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 22:07:41 +0000",
      "title": "Archaeologists find a supersized medieval shipwreck in Denmark",
      "neutral_headline": "Archaeologists find a supersized medieval shipwreck in Denmark",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/archaeologists-find-a-supersized-medieval-shipwreck-in-denmark/",
          "published_at": "Fri, 16 Jan 2026 22:07:41 +0000",
          "title": "Archaeologists find a supersized medieval shipwreck in Denmark",
          "standfirst": "The sunken ship reveals that the medieval European economy was growing fast.",
          "content": "Archaeologists recently found the wreck of an enormous medieval cargo ship lying on the seafloor off the Danish coast, and it reveals new details of medieval trade and life at sea. Archaeologists discovered the shipwreck while surveying the seabed in preparation for a construction project for the city of Copenhagen, Denmark. It lay on its side, half-buried in the sand, 12 meters below the choppy surface of the Øresund, the straight that runs between Denmark and Sweden. By comparing the tree rings in the wreck’s wooden planks and timbers with rings from other, precisely dated tree samples, the archaeologists concluded that the ship had been built around 1410 CE. The Skaelget 2 shipwreck, with a diver for scale. Credit: Viking Ship Museum A medieval megaship Svaelget 2, as archaeologists dubbed the wreck (its original name is long since lost to history), was a type of merchant ship called a cog: a wide, flat-bottomed, high-sided ship with an open cargo hold and a square sail on a single mast. A bigger, heavier, more advanced version of the Viking knarrs of centuries past, the cog was the high-tech supertanker of its day. It was built to carry bulky commodities from ports in the Netherlands, north around the coast of Denmark, and then south through the Øresund to trading ports on the Baltic Sea—but this one didn’t quite make it.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Ubena_von_Bremen_Kiel2007_1_cropped-941x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Ubena_von_Bremen_Kiel2007_1_cropped-941x648.jpg",
      "popularity_score": 309
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 21:43:22 +0000",
      "title": "Judge orders Anna’s Archive to delete scraped data; no one thinks it will comply",
      "neutral_headline": "Judge orders Anna’s Archive to delete scraped data; no one thinks it will comply",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/judge-orders-annas-archive-to-delete-scraped-data-no-one-thinks-it-will-comply/",
          "published_at": "Fri, 16 Jan 2026 21:43:22 +0000",
          "title": "Judge orders Anna’s Archive to delete scraped data; no one thinks it will comply",
          "standfirst": "WorldCat operator hopes default judgment will convince web hosts to take action.",
          "content": "The operator of WorldCat won a default judgment against Anna's Archive, with a federal judge ruling yesterday that the shadow library must delete all copies of its WorldCat data and stop scraping, using, storing, or distributing the data. Anna's Archive is a shadow library and search engine for other shadow libraries that was launched in 2022. It archives books and other written materials and makes them available via torrents, and recently expanded its ambitions by scraping Spotify to make a 300TB copy of the most-streamed songs. Anna's Archive lost its .org domain a couple of weeks ago but remains online at other domains. Yesterday's ruling is in a case filed by OCLC, a nonprofit that operates the WorldCat library catalog on behalf of member libraries. OCLC alleged that Anna’s Archive “illegally hacked WorldCat.org” to steal 2.2TB of data.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/library-shelves-1152x648-1768598730.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/library-shelves-1152x648-1768598730.jpg",
      "popularity_score": 293
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 21:20:03 +0000",
      "title": "OpenAI to test ads in ChatGPT as it burns through billions",
      "neutral_headline": "OpenAI to test ads in ChatGPT as it burns through billions",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/openai-to-test-ads-in-chatgpt-as-it-burns-through-billions/",
          "published_at": "Fri, 16 Jan 2026 21:20:03 +0000",
          "title": "OpenAI to test ads in ChatGPT as it burns through billions",
          "standfirst": "Ads coming to free tier and new $8/month ChatGPT Go plan in US.",
          "content": "On Friday, OpenAI announced it will begin testing advertisements inside the ChatGPT app for some US users in a bid to expand its customer base and diversify revenue. The move represents a reversal for CEO Sam Altman, who in 2024 described advertising in ChatGPT as a \"last resort\" and expressed concerns that ads could erode user trust, although he did not completely rule out the possibility at the time. The banner ads will appear in the coming weeks for logged-in users of the free version of ChatGPT as well as the new $8 per month ChatGPT Go plan, which OpenAI also announced Friday is now available worldwide. OpenAI first launched ChatGPT Go in India in August 2025 and has since rolled it out to over 170 countries. Users paying for the more expensive Plus, Pro, Business, and Enterprise tiers will not see advertisements.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/02/openai_glowing_green-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/02/openai_glowing_green-1152x648.jpg",
      "popularity_score": 293
    },
    {
      "id": "cluster_50",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 21:32:13 +0000",
      "title": "This may be the grossest eye pic ever—but the cause is what’s truly horrifying",
      "neutral_headline": "This may be the grossest eye pic ever—but the cause is what’s truly horrifying",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2026/01/this-may-be-the-grossest-eye-pic-ever-but-the-cause-is-whats-truly-horrifying/",
          "published_at": "Fri, 16 Jan 2026 21:32:13 +0000",
          "title": "This may be the grossest eye pic ever—but the cause is what’s truly horrifying",
          "standfirst": "Hypervirulent germ nearly destroys man, invading brain and blowing out an eye.",
          "content": "A generally healthy 63-year-old man in the New England area went to the hospital with a fever, cough, and vision problems in his right eye. His doctors eventually determined that a dreaded hypervirulent bacteria—which is rising globally—was ravaging several of his organs, including his brain. According to the man, the problems started three weeks before his hospital visit, when he said he ate some bad meat and started vomiting and having diarrhea. Those symptoms faded after about two weeks, but then new problems began—he started coughing and having chills and a fever. His cough only worsened from there. At the hospital, doctors took X-rays and computed tomography (CT) scans of his chest and abdomen. The images revealed over 15 nodules and masses in his lungs. But that's not all they found. The imaging also revealed a mass in his liver that was 8.6 cm in diameter (about 3.4 inches). Lab work pointed toward an infection, so doctors admitted him to the hospital and provided oxygen to help with his breathing, as well as antibiotics. But his chills and cough continued.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-16-at-3.38.03-PM-910x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Screenshot-2026-01-16-at-3.38.03-PM-910x648.png",
      "popularity_score": 289
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 21:05:37 +0000",
      "title": "Mandiant releases rainbow table that cracks weak admin password in 12 hours",
      "neutral_headline": "Mandiant releases rainbow table that cracks weak admin password in 12 hours",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/mandiant-releases-rainbow-table-that-cracks-weak-admin-password-in-12-hours/",
          "published_at": "Fri, 16 Jan 2026 21:05:37 +0000",
          "title": "Mandiant releases rainbow table that cracks weak admin password in 12 hours",
          "standfirst": "Windows laggards still using the vulnerable hashing function: Your days are numbered.",
          "content": "Security firm Mandiant has released a database that allows any administrative password protected by Microsoft’s NTLM.v1 hash algorithm to be hacked in an attempt to nudge users who continue using the deprecated function despite known weaknesses. The database comes in the form of a rainbow table, which is a precomputed table of hash values linked to their corresponding plaintext. These generic tables, which work against multiple hashing schemes, allow hackers to take over accounts by quickly mapping a stolen hash to its password counterpart. NTLMv1 rainbow tables are particularly easy to construct because of NTLMv1’s limited keyspace, meaning the relatively small number of possible passwords the hashing function allows for. NTLMv1 rainbow tables have existed for two decades but typically require large amounts of resources to make any use of them. New ammo for security pros On Thursday, Mandiant said it had released an NTLMv1 rainbow table that will allow defenders and researchers (and, of course, malicious hackers, too) to recover passwords in under 12 hours using consumer hardware costing less than $600 USD. The table is hosted in Google Cloud. The database works against Net-NTLMv1 passwords, which are used in network authentication for accessing resources such as SMB network sharing.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/07/password-login-1000x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2022/07/password-login-1000x648.jpeg",
      "popularity_score": 278
    },
    {
      "id": "cluster_60",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 19:56:33 +0000",
      "title": "RAM shortage chaos expands to GPUs, high-capacity SSDs, and even hard drives",
      "neutral_headline": "RAM shortage chaos expands to GPUs, high-capacity SSDs, and even hard drives",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/ram-shortage-chaos-expands-to-gpus-high-capacity-ssds-and-even-hard-drives/",
          "published_at": "Fri, 16 Jan 2026 19:56:33 +0000",
          "title": "RAM shortage chaos expands to GPUs, high-capacity SSDs, and even hard drives",
          "standfirst": "GPU makers may prioritize more profitable models; large SSDs are harder to find.",
          "content": "Big Tech's AI-fueled memory shortage is set to be the PC industry's defining story for 2026 and beyond. Standalone, direct-to-consumer RAM kits were some of the first products to feel the bite, with prices spiking by 300 or 400 percent by the end of 2025; prices for SSDs had also increased noticeably, albeit more modestly. The rest of 2026 is going to be all about where, how, and to what extent those price spikes flow downstream into computers, phones, and other components that use RAM and NAND chips—areas where the existing supply of products and longer-term supply contracts negotiated by big companies have helped keep prices from surging too noticeably so far. This week, we're seeing signs that the RAM crunch is starting to affect the GPU market—Asus made some waves when it inadvertently announced that it was discontinuing its GeForce RTX 5070 Ti.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/IMG_2659-1-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/IMG_2659-1-1152x648.jpeg",
      "popularity_score": 259
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 19:12:04 +0000",
      "title": "Calif. counters FCC attack on DEI with conditions on Verizon/Frontier merger",
      "neutral_headline": "Calif. counters FCC attack on DEI with conditions on Verizon/Frontier merger",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/verizon-frontier-to-complete-10b-merger-after-approvals-from-fcc-and-states/",
          "published_at": "Fri, 16 Jan 2026 19:12:04 +0000",
          "title": "Calif. counters FCC attack on DEI with conditions on Verizon/Frontier merger",
          "standfirst": "Verizon touts \"expanded reach of almost 30 million fiber passings\" across US.",
          "content": "Verizon has received all approvals it needs for a $9.6 billion acquisition of Frontier Communications, an Internet service provider with about 3.3 million broadband customers in 25 states. Verizon said it expects to complete the merger on January 20. The last approval came from the California Public Utilities Commission (CPUC), which allowed the deal in a 5–0 vote yesterday. There were months of negotiations that resulted in requirements to deploy more fiber and wireless infrastructure, offer $20-per-month Internet service to people with low incomes for the next decade, and other commitments, including some designed to replace the DEI (diversity, equity, and inclusion) policies that Verizon had to end because of demands by the Trump administration. \"The approval follows extensive public participation, testimony from multiple parties, and negotiated settlement agreements with consumer advocates and labor organizations,\" the CPUC said yesterday.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/verizon-sign-logo-1152x648-1739298990.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/verizon-sign-logo-1152x648-1739298990.jpg",
      "popularity_score": 243
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 16:55:08 +0000",
      "title": "TSMC says AI demand is “endless” after record Q4 earnings",
      "neutral_headline": "TSMC says AI demand is “endless” after record Q4 earnings",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/tsmc-says-ai-demand-is-endless-after-record-q4-earnings/",
          "published_at": "Fri, 16 Jan 2026 16:55:08 +0000",
          "title": "TSMC says AI demand is “endless” after record Q4 earnings",
          "standfirst": "Amid fears of bubble, world's top chipmaker TSMC says customers just keep asking for more.",
          "content": "On Thursday, Taiwan Semiconductor Manufacturing Company (TSMC) reported record fourth-quarter earnings and said it expects AI chip demand to continue for years. During an earnings call, CEO C.C. Wei told investors that while he cannot predict the semiconductor industry's long-term trajectory, he remains bullish on AI. TSMC manufactures chips for companies including Apple, Nvidia, AMD, and Qualcomm, making it a linchpin of the global electronics supply chain. The company produces the vast majority of the world's most advanced semiconductors, and its factories in Taiwan have become a focal point of US-China tensions over technology and trade. When TSMC reports strong demand and ramps up spending, it signals that the companies designing AI chips expect years of continued growth. \"All in all, I believe in my point of view, the AI is real—not only real, it's starting to grow into our daily life. And we believe that is kind of—we call it AI megatrend, we certainly would believe that,\" Wei said during the call. \"So another question is 'can the semiconductor industry be good for three, four, five years in a row?' I'll tell you the truth, I don't know. But I look at the AI, it looks like it's going to be like an endless—I mean, that for many years to come.\"Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/tsmc_factory-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/tsmc_factory-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 14:16:26 +0000",
      "title": "Mother of one of Elon Musk’s offspring sues xAI over sexualized deepfakes",
      "neutral_headline": "Mother of one of Elon Musk’s offspring sues xAI over sexualized deepfakes",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/mother-of-one-of-elon-musks-offspring-sues-xai-over-sexualized-deepfakes/",
          "published_at": "Fri, 16 Jan 2026 14:16:26 +0000",
          "title": "Mother of one of Elon Musk’s offspring sues xAI over sexualized deepfakes",
          "standfirst": "Claims Grok chatbot created \"countless\" sexual images of her without her consent.",
          "content": "Ashley St Clair, the influencer and mother of one of Elon Musk’s children, has sued the billionaire’s AI company, accusing its Grok chatbot of creating fake sexual imagery of her without her consent. In the lawsuit, filed in New York state court, St Clair alleged that xAI’s Grok first created an AI-generated or altered image of her in a bikini earlier this month. St Clair claims she made a request to xAI that no further such images be made, but nevertheless “countless sexually abusive, intimate, and degrading deepfake content of St. Clair [were] produced and distributed publicly by Grok.”Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ashleystclair-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ashleystclair-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 15:00:31 +0000",
      "title": "Ferrari doing what it does best: The 12Cilindri review",
      "neutral_headline": "Ferrari doing what it does best: The 12Cilindri review",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/driven-the-ferrari-12cilindri-spider-is-open-top-grand-touring-bliss/",
          "published_at": "Fri, 16 Jan 2026 15:00:31 +0000",
          "title": "Ferrari doing what it does best: The 12Cilindri review",
          "standfirst": "Retro design and a naturally aspirated V12 deliver tremendous appeal, but it’ll cost ya.",
          "content": "It has been nearly 80 years since Ferrari unleashed its first V12-powered sports car upon the world with the 125 S. In 1947, its debut year, the 125 S secured Ferrari’s first race victory, along with five other wins in the 14 events it competed in that season. Although it was soon replaced by the 159 S, the success of the 125 S kick-started Ferrari’s storied history of producing some of the most desirable 12-cylinder performance cars known to man. And while the Italian automaker has come to embrace forced induction and electrification in recent years, its legacy of building stunning front-engine, rear-wheel drive machines with spectacular V12s stuffed into their engine bays continues with the 12Cilindri Spider. Ferrari hasn’t shied away from leveraging cutting-edge technology in the development of its latest models, but the company also understands the value of a good throwback. As the successor to the 812 Superfast, the 12Cilindri boasts clever performance technologies, like a sophisticated active aero system and a four-wheel steering system that can manage each corner independently to enhance response, but it’s ultimately an homage to the heady days of late '60s luxury grand touring. The exterior styling takes obvious inspiration from the 365 GTB Daytona, while its lack of all-wheel drive, turbocharging, and electric assistance bucks trends that have become nearly inescapable in modern performance cars.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/13-2025-Ferrari-12Cilindri-Spider-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/13-2025-Ferrari-12Cilindri-Spider-1152x648.jpg",
      "popularity_score": 144
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 15:40:00 +0000",
      "title": "Feds give Tesla another five weeks to respond to FSD probe",
      "neutral_headline": "Feds give Tesla another five weeks to respond to FSD probe",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/feds-give-tesla-another-five-weeks-to-respond-to-fsd-probe/",
          "published_at": "Fri, 16 Jan 2026 15:40:00 +0000",
          "title": "Feds give Tesla another five weeks to respond to FSD probe",
          "standfirst": "Regulators want to know why Tesla's system ignores red lights and runs into traffic.",
          "content": "Late last year, the National Highway Traffic Safety Administration opened yet another investigation into Tesla and its partially automated driver assist systems. This time it was about FSD (again), which has been the subject of more than 60 complaints to the regulator after Teslas operating under FSD either ignored red traffic lights or crossed into oncoming traffic. As part of the preliminary investigation, NHTSA's Office of Defects Investigation has asked Tesla for more information on the problem. This week, it told the automaker it could have a five-week extension on its homework. To be fair to Tesla, NHTSA has asked for a comprehensive amount of information: a list of every Tesla produced and sold or leased in the United States, including whether or not that car had FSD and which version; cumulative data on how many US Teslas have FSD and how often it's used; and a list of all the customer complaints, field reports, incident reports, lawsuits, and other data related to FSD ignoring traffic laws. For each incident involving a crash, Tesla must give NHTSA a summary of the incident, including \"causal and contributing factors.\" Further questions require information on FSD use by crashed cars; any alert shown to the drivers; what work, simulation, or otherwise Tesla has conducted to ameliorate the problem; any modifications or changes to FSD hardware or software; an explanation of Tesla's theory of operation for traffic lights and stop signs; and Tesla's assessment of the problem.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1149999036-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1149999036-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Fri, 16 Jan 2026 12:00:50 +0000",
      "title": "Rocket Report: Ariane 64 to debut soon; India has a Falcon 9 clone too?",
      "neutral_headline": "Rocket Report: Ariane 64 to debut soon; India has a Falcon 9 clone too",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/rocket-report-ariane-64-to-debut-soon-india-has-a-falcon-9-clone-too/",
          "published_at": "Fri, 16 Jan 2026 12:00:50 +0000",
          "title": "Rocket Report: Ariane 64 to debut soon; India has a Falcon 9 clone too?",
          "standfirst": "\"We are fundamentally shifting our approach to securing our munitions supply chain.\"",
          "content": "Welcome to Edition 8.25 of the Rocket Report! All eyes are on Florida this weekend as NASA rolls out the Space Launch System rocket and Orion spacecraft to its launch site in Florida for the Artemis II mission. NASA has not announced a launch date yet, and this will depend in part on how well a \"wet dress rehearsal\" goes with fueling the rocket. However, it is likely the rocket has a no-earlier-than launch date of February 8. Our own Stephen Clark will be in Florida for the rollout on Saturday, so be sure and check back here for coverage. As always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar. MaiaSpace scores a major launch deal. The ArianeGroup subsidiary, created in 2022, has inked a major new launch contract with satellite operator Eutelsat, Le Monde reports. A significant portion of the 440 new satellites ordered by Eutelsat from Airbus to renew or expand its OneWeb constellation will be launched into orbit by the new Maia rocket. MaiaSpace previously signed two contracts: one with Exotrail for the launch of an orbital transfer, and the other for two satellites for the Toutatis mission, a defense system developed by U-Space.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spacex-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spacex-1152x648.jpg",
      "popularity_score": 133
    }
  ]
}