{
  "updated_at": "2026-02-16T11:35:18.861Z",
  "clusters": [
    {
      "id": "cluster_3",
      "coverage": 2,
      "updated_at": "2026-02-16T06:29:24-05:00",
      "title": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
      "neutral_headline": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
      "bullet_summary": [
        "Reported by The Verge, Guardian Tech"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/ai-artificial-intelligence/879644/bytedance-seedance-safeguards-ai-video-copyright-infringement",
          "published_at": "2026-02-16T06:29:24-05:00",
          "title": "After spooking Hollywood, ByteDance will tweak safeguards on new AI model",
          "standfirst": "TikTok creator ByteDance says that it is working to improve safeguards on its new AI video generator after Disney, Paramount, and Hollywood trade groups accused the tool of violating copyright protections. Concerns were raised after hyperrealistic videos generated by the Seedance 2.0 model went viral last week, with the likeness of actors, such as Tom [&#8230;]",
          "content": "Hollywood groups have spoken out against Seedance 2.0 since generated videos like fight scenes between Tom Cruise and Brad Pitt went viral. | Image by Dave Benett / WireImage via Getty TikTok creator ByteDance says that it is working to improve safeguards on its new AI video generator after Disney, Paramount, and Hollywood trade groups accused the tool of violating copyright protections. Concerns were raised after hyperrealistic videos generated by the Seedance 2.0 model went viral last week, with the likeness of actors, such as Tom Cruise and Brad Pitt, and characters from Dragon Ball Z, Family Guy, and Pok&eacute;mon. \"ByteDance respects intellectual property rights and we have heard the concerns regarding Seedance 2.0,\" a ByteDance spokesperson said in a statement shared by CNBC. \"We are taking steps to strengthen current saf … Read the full story at The Verge.",
          "feed_position": 0
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2026/feb/16/tiktok-bytedance-ai-video-tool-disney-seedance-tom-cruise-brad-pitt",
          "published_at": "Mon, 16 Feb 2026 08:25:10 GMT",
          "title": "TikTok creator ByteDance vows to curb AI video tool after Disney threat",
          "standfirst": "Videos created by new Seedance 2.0 generator go viral, including one of Tom Cruise and Brad Pitt fightingBusiness live – latest updatesByteDance, the Chinese technology company behind TikTok, has said it will restrain its AI video-making tool, after threats of legal action from Disney and a backlash from other media businesses, according to reports.The AI video generator Seedance 2.0, released last week, has spooked Hollywood as users create realistic clips of movie stars and superheroes with just a short text prompt. Continue reading...",
          "content": "Videos created by new Seedance 2.0 generator go viral, including one of Tom Cruise and Brad Pitt fightingBusiness live – latest updatesByteDance, the Chinese technology company behind TikTok, has said it will restrain its AI video-making tool, after threats of legal action from Disney and a backlash from other media businesses, according to reports.The AI video generator Seedance 2.0, released last week, has spooked Hollywood as users create realistic clips of movie stars and superheroes with just a short text prompt. Continue reading...",
          "feed_position": 3
        }
      ],
      "popularity_score": 2019.9014275
    },
    {
      "id": "cluster_14",
      "coverage": 2,
      "updated_at": "Mon, 16 Feb 2026 10:00:38 +0000",
      "title": "The best gaming handhelds for 2026",
      "neutral_headline": "The best gaming handhelds for 2026",
      "bullet_summary": [
        "That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7",
        "That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings",
        "We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo",
        "​Intel’s co-founder Gordon Moore (Moore&#x27;s Law) is famously quoted for saying in 1965 that the transistor count on a microchip would double every year"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html",
          "published_at": "Mon, 16 Feb 2026 10:00:38 +0000",
          "title": "The best gaming handhelds for 2026",
          "standfirst": "Handheld gaming systems aren’t niche anymore. Today’s devices range from compact devices built around retro emulation to full-fledged portable PCs capable of running modern AAA games. That variety is exciting, but it also makes shopping harder. The “best” gaming handheld now depends less on a single, standout device and more on how, where and what you want to play.Some handhelds are designed for quick sessions and classic libraries, prioritizing simplicity, long battery life and pocketable designs. Others blur the line between console and PC, offering large screens, powerful chips and access to massive game libraries, often at the cost of size, price or endurance. There are even more experimental options that focus on unusual controls or intentionally limited experiences.We’ve spent months testing and tracking the fast-moving handheld space to figure out which devices are actually worth your money right now. Whether you’re looking for a versatile all-rounder, a premium portable gaming PC or a dedicated machine for retro games, these are the gaming handhelds that stand out in an increasingly crowded field.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Best handheld gaming devices for 2026 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "content": "Handheld gaming systems aren’t niche anymore. Today’s devices range from compact devices built around retro emulation to full-fledged portable PCs capable of running modern AAA games. That variety is exciting, but it also makes shopping harder. The “best” gaming handheld now depends less on a single, standout device and more on how, where and what you want to play.Some handhelds are designed for quick sessions and classic libraries, prioritizing simplicity, long battery life and pocketable designs. Others blur the line between console and PC, offering large screens, powerful chips and access to massive game libraries, often at the cost of size, price or endurance. There are even more experimental options that focus on unusual controls or intentionally limited experiences.We’ve spent months testing and tracking the fast-moving handheld space to figure out which devices are actually worth your money right now. Whether you’re looking for a versatile all-rounder, a premium portable gaming PC or a dedicated machine for retro games, these are the gaming handhelds that stand out in an increasingly crowded field.Editor’s note (11/7/25): A barrage of new mobile emulation handhelds have been announced since our last update, including two follow-ups to our current “best for most” pick (the Retroid Pocket 6 and the more marginally updated Retroid Pocket G2) and a new version of our “best overall” pick (the AYN Odin 3). Other competitors like Ayaneo’s KONKR Pocket Fit are also on the way, and there’s been a wave of new dual-screen models like the AYN Thor, Ayaneo Pocket DS and Anbernic RG DS. We think our current recommendations will still satisfy most shoppers, but since we’re still working to test most of these newer devices, we wanted to give a heads-up for anyone who wants the absolute latest. In the meantime, we’ve added testing notes on a few other emulation-focused handhelds as well as a couple new portable PCs like the ASUS ROG Xbox Ally X. Best handheld gaming devices for 2026 What about the Nintendo Switch 2? Sam Rutherford for Engadget Read our full Nintendo Switch 2 review The new Nintendo Switch 2 is already more popular than any of the handhelds above, but we haven’t made it a formal pick in this guide since it exists in its own world. As one of the newest devices from the big three console manufacturers, most people aren’t choosing between it and the handheld PCs or emulation devices above. The main reason to buy a Switch 2 is to play new Nintendo games, and no other device can (legally) offer that. Likewise, the Switch 2 doesn’t even try to offer the flexibility of a Steam Deck, ROG Ally X or even the Retroid Pocket 5. That said, the hardware itself is a significant upgrade over its predecessor, with dramatically improved performance, a sharper, faster and bigger 7.9-inch display, magnetic Joy-Con controllers and more storage. It’s a wholly more polished take on the Switch 1’s ideas. Does that make it a must-buy right now? Unless you’re worried about a tariff-induced price hike — which may not be the most outlandish fear — not really. Donkey Kong Bananza is a joy, Mario Kart World is fun enough and playing Cyberpunk 2077 on a Nintendo console is kind of surreal, but the list of true must-plays that are exclusive to the Switch 2 is still limited. That’s OK — it’s only been a few months. But don’t feel like you must rush out and splash the cash today unless you have a serious case of Donkey Kong-induced FOMO. Other gaming handhelds we've tested The Lenovo Legion Go 2. Sam Rutherford for Engadget Note: This is a selection of noteworthy gaming handhelds we’ve tested, not a comprehensive list of everything we've ever tried. Lenovo Legion Go 2 The Lenovo Legion Go 2 is a capable alternative to the ROG Xbox Ally X with a mondo-sized 8.8-inch display. That screen is the main reason to consider it, as it’s a vivid OLED panel that supports VRR and has a 144Hz native refresh rate. Like the Switch, it also comes with detachable controllers — one of which includes a useful touchpad for navigating Windows — plus a built-in kickstand for tabletop play. That said, it’s an absolute tank at just over two pounds, and we found it to perform a little worse than the Xbox Ally X at equal settings. It’s also even more expensive, starting at $1,100 and rising to $1,350 for a config with the same Ryzen Z2 Extreme chip. It’s a lovely device if you’ve got cash to burn — and to be fair, none of these Windows handhelds are for anyone looking for “value” — but the Xbox Ally X is a better buy for most. The MSI Claw 8 AI+. Sam Rutherford for Engadget MSI Claw 8 AI+ The original MSI Claw was a flop, but the newer Claw 8 AI+ is much more appealing if you’re willing to pay for a larger and slightly more powerful alternative to the ASUS ROG Ally X. With its Intel Core Ultra 7-258V chip and 32GB of RAM, it typically pumped out 10 to 15 percent higher frame rates than last-gen models like the ROG Ally X and Lenovo Legion Go in our testing. (Another model is available with the Ryzen Z2 Extreme chip.) Battery life is relatively strong, while its 8-inch 120Hz IPS display is plenty bright and supports VRR. There are smooth Hall effect thumbsticks and triggers, two Thunderbolt 4 ports and a built-in fingerprint sensor beyond that. The Claw’s main issue is its price: At $1,100 after recent price hikes, it’s hard to justify over the ROG Xbox Ally X, which is already too expensive for most people. ASUS' handheld is lighter and easier to grip on top of that — though the Claw is thinner — and its overhauled Xbox UI, while far from perfect, is still easier to get around than MSI’s Center M hub. There's a smaller 7-inch version of this handheld for $900 as well, but we haven’t tested that one. The ModRetro Chromatic. Jeff Dunn for Engadget ModRetro Chromatic The ModRetro Chromatic is a competitor to the Analogue Pocket that can similarly play actual Game Boy cartridges via FPGA. With its premium metal frame, loud speaker, tight d-pad and beautifully bright 2.56-inch display, it’s an impressive modernization of Nintendo’s classic handheld. ModRetro also publishes a number of games specifically for the device, including a pretty great version of Tetris that comes bundled in the box. However, for many, its faithfulness to the original Game Boy probably goes too far: It requires three AA batteries for power, and unlike the Analogue Pocket it doesn’t support custom save states. It’s also designed for Game Boy and Game Boy Color games only; it can’t play any Game Boy Advance cartridges or games from other retro handhelds like Analogue’s device, nor does doesn’t support ROMs. For only $20 less than the Pocket, that makes it a tough sell, even if the hardware is arguably higher-quality. There’s also the lethal, autonomous elephant in the room: ModRetro is founded by Palmer Luckey, the idiosyncratic entrepreneur behind the Oculus Rift who has gone on to form Anduril Industries, a defense contractor that makes drones, surveillance systems and other AI-powered military tech. He has also espoused political views that many people — and this is the tamest way I can put this — may not be comfortable backing. We are not here to police where you can spend your money, and the Chromatic does much of what it wants to do well. Still, all of these handhelds are just so inessential, and no other option that we know of is as closely tied to an arms dealer. The Lenovo Legion Go S. Sam Rutherford for Engadget Lenovo Legion Go S (Windows, Z2 Go chip) The Windows 11 version of the Lenovo Legion Go S has the same relatively comfortable design and commendable 8-inch 120Hz display as the SteamOS model we highlight above. With the Z2 Go model we tested, though, its performance lags too far behind the ROG Ally X, Claw 8 AI+ and original Legion Go for something priced at $730. Windows is still clunky, too. The Ayaneo Flip DS. Photo by Jeff Dunn / Engadget Ayaneo Flip DS The Ayaneo Flip DS is a cool concept: a powerful Windows machine with a clamshell design and dual displays, sort of like a supercharged Nintendo DS. It feels sturdy, it performs roughly on par with the other Ryzen 7 7840U (or 8840U) handhelds in this guide, and its 7-inch top display is sharp, fast and bright. The second screen makes it a natural fit for emulating Wii U or 3DS games, but you could also, say, look up a guide or play a YouTube video without having to close whatever you’re playing. Unfortunately, this is more of a neat idea than a fully thought-out product. The folding design means that the joysticks have to be short and recessed, while the face buttons and d-pad are uncomfortably flat. The whole thing is overly thick and heavy, plus it runs very hot. Battery life tops out around two hours, and actually managing two displays on a Windows handheld is about as clunky as you'd expect. With prices now starting above $1,100, the Flip DS is hard to recommend unless you’re (oddly) desperate for a handheld Wii U emulator. We're always happy to see more weird hardware, though. The Ayaneo Kun. Photo by James Trew / Engadget Ayaneo Kun The Ayaneo Kun is one of the more decadent Windows handhelds we’ve tested. With a sharp 8.4-inch display, a Ryzen 7 8840U chip, up to 64GB of RAM, up to 4TB of storage, a sizable 75Whr battery and a 54W max TDP, it’s both a capable gaming device and a feasible replacement for a desktop PC. But it now starts at a pricey $999, it’s huge and it suffers from the usual Windows-related issues. It also lacks VRR, and that Ryzen chip is no longer the latest and greatest. The Kun is still a fine device in a vacuum, but the ROG Xbox Ally X is a better buy. This is technically an older model for Ayaneo, too, as the company seems to launch a new handheld every other hour these days. The Retroid Pocket Classic. Jeff Dunn for Engadget Retroid Pocket Classic The Retroid Pocket Classic is another Game Boy-style vertical handheld in the vein of the Analogue Pocket, but like the other Retroid models we’ve highlighted, it’s an Android device designed to emulate games via ROM files, not genuine cartridges. (Naturally, it can also play native Android games.) It’s still far clunkier to set up and use as a result, and its overall design feels more toy-like than either the Pocket or ModRetro Chromatic. But its Snapdragon G1 Gen 2 chip is easily powerful enough to play any classic handheld system (along with most other retro games that don’t require joystick controls), while its 3.9-inch OLED display is superbly bright, sharp and colorful. The battery can last more than 10 hours when emulating lower-power systems, and Retroid sells a version with six face buttons instead of the standard four if you want to play older Sega Genesis and Saturn games in particular. The Analogue Pocket is still more premium and rewarding to use, but if you want a similar form factor and can live with the typical quirks that come with a device like this, the Classic is a good value at $129. Of the many Game Boy-style handhelds out there that solely rely on software emulation, it’s the one we’d recommend first. The Retroid Pocket Mini (bottom) and Retroid Pocket 5. Jeff Dunn for Engadget Retroid Pocket Mini The Retroid Pocket Mini is essentially a smaller version of the Retroid Pocket 5. It runs on the same Snapdragon 865 chip and feels just as sturdy, but it has a smaller 3.92-inch display with a 4:3 aspect ratio. This makes it a more natural fit for older retro consoles, as you won’t get the black boxes you’d see on a 16:9 display like the one on the Pocket 5. If you mainly want to emulate systems like the SNES, Sega Genesis or Game Boy Color and don’t mind paying extra for a rich OLED display, it’s a good little device. But the tiny screen is limiting if you ever want to play newer games, and we wish there wasn't so much empty space around the display. This device had also generated some controversy within the retro gaming community for having persistent issues with inaccurate shaders (and for the slapdash way Retroid handled the matter). The company replaced the original model with a \"V2\" iteration that addresses those concerns, however. Retroid Pocket 4 Pro and Retroid Pocket 4 The 4.7-inch Retroid Pocket 4 Pro is the predecessor to the Pocket 5. Its performance isn’t significantly far off the newer model, so it remains a nice value if you’re determined to spend less than $200 on an emulation device. It misses out on the larger OLED display and more ergonomically-friendly design of its follow-up, however. The base Pocket 4 may also be worth a look if you want to stay under $150, but its weaker chip makes it less adept at emulating games from the PS2, GameCube and up. The Miyoo Mini Plus (left) and TrimUI Brick. Jeff Dunn for Engadget Miyoo Mini Plus The Miyoo Mini Plus is a highly affordable handheld with a well-built, Game Boy-style form factor that fits nicely with older games. Its 3.5-inch display pops for something in the $60 to $80 range, its battery lasts as long as it needs to and it can emulate consoles up to the original PlayStation without much issue. Its Linux-based software is extensively customizable, though it requires some tinkering to get it working optimally. Like many cheapo handhelds, it also lacks fast charging. Since it’s from a smaller Chinese firm and isn’t available at major retailers, it can also be difficult to actually buy. It's a nice choice if you want something more compact than the Retroid Pocket Classic, but that model's roomier design, more vibrant OLED panel and longer battery life makes it worth the extra cash for most people. TrimUI Brick The TrimUI Brick is another low-cost vertical handheld that’s surprisingly well-built for an $80-ish device, thanks to its brushed metal backplate and impressive 3.2-inch IPS display. It has a weaker chip than the Retroid Pocket Classic, but it can still emulate older handheld games just fine, and its tiny frame makes it much easier to actually fit in a pocket. That said, while it has a sharper and more vivid screen than the Miyoo Mini Plus (its closest rival), the face buttons, d-pad and especially back buttons are all stiffer, and its stock UI feels similarly bootleg. (Some of the icons for different systems in the game library: “GomeBuy,” “Fanicon,” and “PloyStotion.”) You can fix the latter with custom firmware, but Retroid’s interface is easier to grok by default, and its setup process is less annoying. Most people interested in this class of device will be happier paying up for the Pocket Classic instead. The Anbernic RG35XX Plus. Photo by Jeff Dunn / Engadget Anbernic RG35XX Plus The Anbernic RG35XX Plus is another wallet-friendly vertical handheld. For about the same price as the Miyoo Mini Plus, it offers a faster chipset, more RAM and a bigger battery alongside a similarly impressive design. Its stock OS is overly sloppy and cheap-looking, however, and while its stronger chip is appreciated, it's still far behind the Retroid Pocket Classic. The Anbernic RG35XXSP. Jeff Dunn for Engadget Anbernic RG35XXSP The Anbernic RG35XXSP is a variant of the RG35XX Plus based on the same internals, only it apes the clamshell form factor of the old Game Boy Advance SP. That’s a great design to rip off if you must pick one, and the hardware doesn’t feel nearly as cheap as its (pre-tariff) price tag of $60 or so would suggest. But the software issues noted above still apply (both here and with the many other devices in the same RGXX family). We’ve also seen several user reports of quality control issues with the RG35XXSP’s battery, which is automatically disqualifying. Anbernic RG405M The Anbernic RG405M is another 4:3 handheld with a 4-inch display and a pleasing metal frame. It's an OK alternative to the Retroid Pocket Mini if you want a little more screen space for less cash, but it’s slower, and it lacks the Mini’s OLED display. We find the Retroid’s grooved back to be comfier to hold over time as well. And again, Anbernic has paused handheld shipments to America as of this writing. The PlayStation Portal. Photo by Devindra Hardawar/Engadget PlayStation Portal The PlayStation Portal is an odd accessory that’s designed to stream games from a PlayStation 5. It lacks built-in apps, so it doesn’t support traditional emulation. Because it’s entirely dependent on the quality of your home Wi-Fi, we can’t guarantee how well it’ll actually perform. It doesn’t work with Bluetooth earbuds either. The 8-inch display is fine and the DualSense-style controls are great, so PlayStation diehards who want a second screen for local PS5 streaming may see the appeal. Sony recently added the ability to stream a selection of games via the cloud, which is a step in the right direction, but you need an expensive PlayStation Plus Premium subscription to take advantage. In general, there’s little here that you can’t do with a smartphone and mobile game controller, so most people are better off saving their $200. Logitech G Cloud The Logitech G Cloud would’ve been a great Android pick when it launched if it cost about $150 less. Its 7-inch 1080p display is bright, vibrant and generally more pleasing to look at than the panel on the AYN Odin 2, its battery lasts a good 10 to 12 hours per charge and its design is comfy to hold for hours at a time. Alas, the G Cloud still tends to retail for $300, which is just too much when the Retroid Pocket 5 offers more power at a lower price. What to know about the gaming handheld market Jeff Dunn / Engadget You can break down the gaming handheld market into three broad tiers. At the top, you have x86-based portable gaming PCs like the Steam Deck or ASUS ROG Xbox Ally X. These are the most powerful handhelds you can buy, as they seek to replicate the experience of a moderately specced gaming desktop. The Steam Deck runs on Linux, but most others use Windows. If you want to play modern, recently released PC games on the go (and need something stronger than a Switch), this is the type of device you’d get. They can also emulate the widest range of retro consoles. They’re typically the largest and most cumbersome devices to hold, however, and their battery life can be short. Naturally, they’re also the most expensive, costing anywhere from $400 to more than $1,000. Further down on the price spectrum are \"mobile handhelds\" like the Logitech G Cloud or Retroid Pocket. These devices often run Android or Linux and can range from under $50 to $400-ish (before tariffs). They aren’t equipped to play modern console or PC titles, but they’re usually more compact than a portable PC, and you can still use them for mobile games and cloud streaming. While most are marketed toward those ends, many gamers actually buy them to emulate classic games through software like RetroArch. Getting emulators to work can be complicated, and accessing the BIOS and ROM files required to play games this way is legally murky. One lawsuit from Nintendo led to the shutdown of the most prominent Switch and 3DS emulators, for instance. (Engadget does not condone piracy.) Backing up files of games you already own for personal use only is considered more defensible, though, so for that a mobile handheld can be a more user- and wallet-friendly way to play the classics — provided you don’t want to just use your phone. We’ll call the last tier “handhelds that do their own thing.” This is a catch-all for things like the Switch 2 or Playdate: portable devices that run heavily customized software and aim to provide a unique gaming experience. They aren’t necessarily ideal for emulation or playing the latest multiplatform titles; instead, they often have distinct game libraries. They might not have the widest appeal as a result (Switch excluded), but they’re often easier for less tech-literate folks to just pick up and use. Recent updates November 2025: The ASUS ROG Xbox Ally X replaces the older ROG Ally X as our new favorite Windows gaming handheld. We’ve also added testing notes on the Lenovo Legion Go 2, ModRetro Chromatic and a couple of emulation-based handhelds in the Retroid Pocket Classic and TrimUI Brick. We’re working to test several other recent releases for our next update, including updated versions of the Retroid Pocket 5 and AYN Odin 2. August 2025: We’ve added the SteamOS version of the Lenovo Legion Go S as a new recommendation and updated our top Windows pick to reflect the upcoming release of ASUS’ and Microsoft’s ROG Xbox Ally devices, which will feature an overhauled Windows UI. We’ve also added a note on the recently released Nintendo Switch 2. We’ll include testing notes on the Retroid Pocket Classic, TrimUI Brick and ModRetro Chromatic in the near future. (Note: Yours truly went on paternity leave after our last update — apologies for the delay!) May 2025: We’ve tested the Retroid Pocket Flip 2 and recommended it as an alternative to the Retroid Pocket 5. We’re also watching out for the first third-party devices that run SteamOS, starting with the new Lenovo Legion Go S, and the next ASUS ROG Ally device, which seems to be arriving soon based on recent leaks. March 2025: We’ve edited this guide for clarity and added testing notes for the MSI Claw 8 AI+ and Lenovo Legion Go S (Windows version). Our main picks are unchanged. Looking ahead, we’re keeping an eye on upcoming Windows handhelds from Acer and Ayaneo, a pair of new emulation devices from Retroid, the first third-party devices to ship with SteamOS and more machines that run on AMD’s Ryzen Z2 chips, among others. January 2025: We have a new top pick among emulation-focused handhelds: the Retroid Pocket 5. Beyond that, we’ve added notes on a few other devices we’ve tested, including the Retroid Pocket Mini and Anbernic RG35XXSP; lightly edited other blurbs to reflect changes in the market; and removed a couple write-ups for products that’ve been discontinued. We're also keeping an eye on new handhelds that’ve recently been announced or are strongly rumored to arrive in the near future, including devices from MSI and Lenovo. August 2024: We’ve replaced the ASUS ROG Ally, our prior pick for the best Windows gaming handheld, with the new and improved ROG Ally X. We’ve also checked to make sure all availability and pricing details noted throughout the guide are accurate. June 2024: We’ve updated this guide to ensure all of our recommendations are up to date, adding a note on ASUS’ upcoming ROG Ally X in the process. We’ve also included details on two new handhelds we’ve tested since our previous update: the MSI Claw and Ayaneo Flip DS. Staying on top of this market is a tall task, but we’re currently looking at recent noteworthy releases like the PSP-esque AYN Odin 2 Mini and the GBA-style Anbernic RG35XXSP as well.This article originally appeared on Engadget at https://www.engadget.com/gaming/best-handheld-gaming-system-140018863.html?src=rss",
          "feed_position": 1,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-06/f88e8cd0-4638-11f0-bffd-78988bb5f8ab"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html",
          "published_at": "Mon, 16 Feb 2026 08:00:35 +0000",
          "title": "The best cheap phones for 2026",
          "standfirst": "A few years ago, it may have been fashionable to spend $1,000 on the latest flagship smartphone, but for most people, that’s neither practical nor necessary. You don't even have to spend $500 today to get a decent handset, whether it’s a refurbished iPhone or an affordable Android phone, as there are plenty of decent options as low as $160.However, navigating the budget phone market can be tricky; options that look good on paper may not be in practice, and some devices will end up costing you more when you consider many come with restrictive storage. While we spend most of our time reviewing mid- to high-end handsets at Engadget, we've tested a number of the latest budget-friendly phones on the market to see cut it as the best cheap phones you can get right now. Best cheap phones What to look for in a cheap phone For this guide, our top picks cost between $100 and $300. Anything less and you might as well go buy a dumb phone instead. Since they’re meant to be more affordable than flagship phones and even midrange handsets, budget smartphones involve compromises; the cheaper a device, the lower your expectations around specs, performance and experience should be. For that reason, the best advice I can give is to spend as much as you can afford. In this price range, even $50 or $100 more can get you a dramatically better product. Second, you should know what you want most from a phone. When buying a budget smartphone, you may need to sacrifice a decent main camera for long battery life, or trade a high-resolution display for a faster CPU. That’s just what comes with the territory, but knowing your priorities will make it easier to find the right phone. It’s also worth noting some features can be hard to find on cheaper handsets. For instance, you won’t need to search far for a device with all-day battery life — but if you want a phone with excellent camera quality, you’re better off shelling out for one of the recommendations in our midrange smartphone guide, which all come in at $600 or less. Wireless charging and waterproofing also aren’t easy to find in this price range and forget about the fastest chipset. On the bright side, most of our recommendations come with headphone jacks, so you won’t need to buy wireless headphones. iOS is also off the table, since, following the discontinuation of the iPhone SE, the $599 iPhone 16e is now the most affordable offering from Apple. That leaves Android as the only option in the under-$300 price range. Thankfully today, there’s little to complain about Google’s operating system – and you may even prefer it to iOS. Lastly, keep in mind most Android manufacturers typically offer far less robust software features and support for their budget devices. In some cases, your new phone may only receive one major software update and a year or two of security patches beyond that. That applies to the OnePlus and Motorola recommendations on our list. If you’d like to keep your phone for as long as possible, Samsung has the best software policy of any Android manufacturer in the budget space, offering at least four years of security updates on all of its devices. Recently, it even began offering six years of support on the $200 A16 5G, which we recommend below. That said, if software support (or device longevity overall) is your main focus, consider spending a bit more on the $500 Google Pixel 9a, or even the previous-gen Pixel 8a, which has planned software updates through mid-2031.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html?src=rss",
          "content": "A few years ago, it may have been fashionable to spend $1,000 on the latest flagship smartphone, but for most people, that’s neither practical nor necessary. You don't even have to spend $500 today to get a decent handset, whether it’s a refurbished iPhone or an affordable Android phone, as there are plenty of decent options as low as $160.However, navigating the budget phone market can be tricky; options that look good on paper may not be in practice, and some devices will end up costing you more when you consider many come with restrictive storage. While we spend most of our time reviewing mid- to high-end handsets at Engadget, we've tested a number of the latest budget-friendly phones on the market to see cut it as the best cheap phones you can get right now. Best cheap phones What to look for in a cheap phone For this guide, our top picks cost between $100 and $300. Anything less and you might as well go buy a dumb phone instead. Since they’re meant to be more affordable than flagship phones and even midrange handsets, budget smartphones involve compromises; the cheaper a device, the lower your expectations around specs, performance and experience should be. For that reason, the best advice I can give is to spend as much as you can afford. In this price range, even $50 or $100 more can get you a dramatically better product. Second, you should know what you want most from a phone. When buying a budget smartphone, you may need to sacrifice a decent main camera for long battery life, or trade a high-resolution display for a faster CPU. That’s just what comes with the territory, but knowing your priorities will make it easier to find the right phone. It’s also worth noting some features can be hard to find on cheaper handsets. For instance, you won’t need to search far for a device with all-day battery life — but if you want a phone with excellent camera quality, you’re better off shelling out for one of the recommendations in our midrange smartphone guide, which all come in at $600 or less. Wireless charging and waterproofing also aren’t easy to find in this price range and forget about the fastest chipset. On the bright side, most of our recommendations come with headphone jacks, so you won’t need to buy wireless headphones. iOS is also off the table, since, following the discontinuation of the iPhone SE, the $599 iPhone 16e is now the most affordable offering from Apple. That leaves Android as the only option in the under-$300 price range. Thankfully today, there’s little to complain about Google’s operating system – and you may even prefer it to iOS. Lastly, keep in mind most Android manufacturers typically offer far less robust software features and support for their budget devices. In some cases, your new phone may only receive one major software update and a year or two of security patches beyond that. That applies to the OnePlus and Motorola recommendations on our list. If you’d like to keep your phone for as long as possible, Samsung has the best software policy of any Android manufacturer in the budget space, offering at least four years of security updates on all of its devices. Recently, it even began offering six years of support on the $200 A16 5G, which we recommend below. That said, if software support (or device longevity overall) is your main focus, consider spending a bit more on the $500 Google Pixel 9a, or even the previous-gen Pixel 8a, which has planned software updates through mid-2031.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html?src=rss",
          "feed_position": 3
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/infrastructure/nvidia-groq-and-the-limestone-race-to-real-time-ai-why-enterprises-win-or",
          "published_at": "Sun, 15 Feb 2026 19:00:00 GMT",
          "title": "Nvidia, Groq and the limestone race to real-time AI: Why enterprises win or lose here",
          "standfirst": "​From miles away across the desert, the Great Pyramid looks like a perfect, smooth geometry — a sleek triangle pointing to the stars. Stand at the base, however, and the illusion of smoothness vanishes. You see massive, jagged blocks of limestone. It is not a slope; it is a staircase.​Remember this the next time you hear futurists talking about exponential growth.​Intel’s co-founder Gordon Moore (Moore&#x27;s Law) is famously quoted for saying in 1965 that the transistor count on a microchip would double every year. Another Intel executive, David House, later revised this statement to “compute power doubling every 18 months.\" For a while, Intel’s CPUs were the poster child of this law. That is, until the growth in CPU performance flattened out like a block of limestone.​If you zoom out, though, the next limestone block was already there — the growth in compute merely shifted from CPUs to the world of GPUs. Jensen Huang, Nvidia’s CEO, played a long game and came out a strong winner, building his own stepping stones initially with gaming, then computer visioniand recently, generative AI.​The illusion of smooth growth​Technology growth is full of sprints and plateaus, and gen AI is not immune. The current wave is driven by transformer architecture. To quote Anthropic’s President and co-founder Dario Amodei: “The exponential continues until it doesn’t. And every year we’ve been like, ‘Well, this can’t possibly be the case that things will continue on the exponential’ — and then every year it has.”​But just as the CPU plateaued and GPUs took the lead, we are seeing signs that LLM growth is shifting paradigms again. For example, late in 2024, DeepSeek surprised the world by training a world-class model on an impossibly small budget, in part by using the MoE technique.​Do you remember where you recently saw this technique mentioned? Nvidia’s Rubin press release: The technology includes “...the latest generations of Nvidia NVLink interconnect technology... to accelerate agentic AI, advanced reasoning and massive-scale MoE model inference at up to 10x lower cost per token.”​Jensen knows that achieving that coveted exponential growth in compute doesn’t come from pure brute force anymore. Sometimes you need to shift the architecture entirely to place the next stepping stone.​The latency crisis: Where Groq fits in​This long introduction brings us to Groq.​The biggest gains in AI reasoning capabilities in 2025 were driven by “inference time compute” — or, in lay terms, “letting the model think for a longer period of time.” But time is money. Consumers and businesses do not like waiting.​Groq comes into play here with its lightning-speed inference. If you bring together the architectural efficiency of models like DeepSeek and the sheer throughput of Groq, you get frontier intelligence at your fingertips. By executing inference faster, you can “out-reason” competitive models, offering a “smarter” system to customers without the penalty of lag.​From universal chip to inference optimization​For the last decade, the GPU has been the universal hammer for every AI nail. You use H100s to train the model; you use H100s (or trimmed-down versions) to run the model. But as models shift toward \"System 2\" thinking — where the AI reasons, self-corrects and iterates before answering — the computational workload changes.​Training requires massive parallel brute force. Inference, especially for reasoning models, requires faster sequential processing. It must generate tokens instantly to facilitate complex chains of thought without the user waiting minutes for an answer. ​Groq’s LPU (Language Processing Unit) architecture removes the memory bandwidth bottleneck that plagues GPUs during small-batch inference, delivering lightning-fast inference.​The engine for the next wave of growth​For the C-Suite, this potential convergence solves the \"thinking time\" latency crisis. Consider the expectations from AI agents: We want them to autonomously book flights, code entire apps and research legal precedent. To do this reliably, a model might need to generate 10,000 internal \"thought tokens\" to verify its own work before it outputs a single word to the user.​On a standard GPU: 10,000 thought tokens might take 20 to 40 seconds. The user gets bored and leaves.​On Groq: That same chain of thought happens in less than 2 seconds.​If Nvidia integrates Groq’s technology, they solve the \"waiting for the robot to think\" problem. They preserve the magic of AI. Just as they moved from rendering pixels (gaming) to rendering intelligence (gen AI), they would now move to rendering reasoning in real-time.​Furthermore, this creates a formidable software moat. Groq’s biggest hurdle has always been the software stack; Nvidia’s biggest asset is CUDA. If Nvidia wraps its ecosystem around Groq’s hardware, they effectively dig a moat so wide that competitors cannot cross it. They would offer the universal platform: The best environment to train and the most efficient environment to run (Groq/LPU).Consider what happens when you couple that raw inference power with a next-generation open source model (like the rumored DeepSeek 4): You get an offering that would rival today’s frontier models in cost, performance and speed. That opens up opportunities for Nvidia, from directly entering the inference business with its own cloud offering, to continuing to power a growing number of exponentially growing customers.​The next step on the pyramid​Returning to our opening metaphor: The \"exponential\" growth of AI is not a smooth line of raw FLOPs; it is a staircase of bottlenecks being smashed.​Block 1: We couldn&#x27;t calculate fast enough. Solution: The GPU.​Block 2: We couldn&#x27;t train deep enough. Solution: Transformer architecture.​Block 3: We can&#x27;t \"think\" fast enough. Solution: Groq’s LPU.​Jensen Huang has never been afraid to cannibalize his own product lines to own the future. By validating Groq, Nvidia wouldn&#x27;t just be buying a faster chip; they would be bringing next-generation intelligence to the masses.Andrew Filev, founder and CEO of Zencoder",
          "content": "​From miles away across the desert, the Great Pyramid looks like a perfect, smooth geometry — a sleek triangle pointing to the stars. Stand at the base, however, and the illusion of smoothness vanishes. You see massive, jagged blocks of limestone. It is not a slope; it is a staircase.​Remember this the next time you hear futurists talking about exponential growth.​Intel’s co-founder Gordon Moore (Moore&#x27;s Law) is famously quoted for saying in 1965 that the transistor count on a microchip would double every year. Another Intel executive, David House, later revised this statement to “compute power doubling every 18 months.\" For a while, Intel’s CPUs were the poster child of this law. That is, until the growth in CPU performance flattened out like a block of limestone.​If you zoom out, though, the next limestone block was already there — the growth in compute merely shifted from CPUs to the world of GPUs. Jensen Huang, Nvidia’s CEO, played a long game and came out a strong winner, building his own stepping stones initially with gaming, then computer visioniand recently, generative AI.​The illusion of smooth growth​Technology growth is full of sprints and plateaus, and gen AI is not immune. The current wave is driven by transformer architecture. To quote Anthropic’s President and co-founder Dario Amodei: “The exponential continues until it doesn’t. And every year we’ve been like, ‘Well, this can’t possibly be the case that things will continue on the exponential’ — and then every year it has.”​But just as the CPU plateaued and GPUs took the lead, we are seeing signs that LLM growth is shifting paradigms again. For example, late in 2024, DeepSeek surprised the world by training a world-class model on an impossibly small budget, in part by using the MoE technique.​Do you remember where you recently saw this technique mentioned? Nvidia’s Rubin press release: The technology includes “...the latest generations of Nvidia NVLink interconnect technology... to accelerate agentic AI, advanced reasoning and massive-scale MoE model inference at up to 10x lower cost per token.”​Jensen knows that achieving that coveted exponential growth in compute doesn’t come from pure brute force anymore. Sometimes you need to shift the architecture entirely to place the next stepping stone.​The latency crisis: Where Groq fits in​This long introduction brings us to Groq.​The biggest gains in AI reasoning capabilities in 2025 were driven by “inference time compute” — or, in lay terms, “letting the model think for a longer period of time.” But time is money. Consumers and businesses do not like waiting.​Groq comes into play here with its lightning-speed inference. If you bring together the architectural efficiency of models like DeepSeek and the sheer throughput of Groq, you get frontier intelligence at your fingertips. By executing inference faster, you can “out-reason” competitive models, offering a “smarter” system to customers without the penalty of lag.​From universal chip to inference optimization​For the last decade, the GPU has been the universal hammer for every AI nail. You use H100s to train the model; you use H100s (or trimmed-down versions) to run the model. But as models shift toward \"System 2\" thinking — where the AI reasons, self-corrects and iterates before answering — the computational workload changes.​Training requires massive parallel brute force. Inference, especially for reasoning models, requires faster sequential processing. It must generate tokens instantly to facilitate complex chains of thought without the user waiting minutes for an answer. ​Groq’s LPU (Language Processing Unit) architecture removes the memory bandwidth bottleneck that plagues GPUs during small-batch inference, delivering lightning-fast inference.​The engine for the next wave of growth​For the C-Suite, this potential convergence solves the \"thinking time\" latency crisis. Consider the expectations from AI agents: We want them to autonomously book flights, code entire apps and research legal precedent. To do this reliably, a model might need to generate 10,000 internal \"thought tokens\" to verify its own work before it outputs a single word to the user.​On a standard GPU: 10,000 thought tokens might take 20 to 40 seconds. The user gets bored and leaves.​On Groq: That same chain of thought happens in less than 2 seconds.​If Nvidia integrates Groq’s technology, they solve the \"waiting for the robot to think\" problem. They preserve the magic of AI. Just as they moved from rendering pixels (gaming) to rendering intelligence (gen AI), they would now move to rendering reasoning in real-time.​Furthermore, this creates a formidable software moat. Groq’s biggest hurdle has always been the software stack; Nvidia’s biggest asset is CUDA. If Nvidia wraps its ecosystem around Groq’s hardware, they effectively dig a moat so wide that competitors cannot cross it. They would offer the universal platform: The best environment to train and the most efficient environment to run (Groq/LPU).Consider what happens when you couple that raw inference power with a next-generation open source model (like the rumored DeepSeek 4): You get an offering that would rival today’s frontier models in cost, performance and speed. That opens up opportunities for Nvidia, from directly entering the inference business with its own cloud offering, to continuing to power a growing number of exponentially growing customers.​The next step on the pyramid​Returning to our opening metaphor: The \"exponential\" growth of AI is not a smooth line of raw FLOPs; it is a staircase of bottlenecks being smashed.​Block 1: We couldn&#x27;t calculate fast enough. Solution: The GPU.​Block 2: We couldn&#x27;t train deep enough. Solution: Transformer architecture.​Block 3: We can&#x27;t \"think\" fast enough. Solution: Groq’s LPU.​Jensen Huang has never been afraid to cannibalize his own product lines to own the future. By validating Groq, Nvidia wouldn&#x27;t just be buying a faster chip; they would be bringing next-generation intelligence to the masses.Andrew Filev, founder and CEO of Zencoder",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/08ilFZNVYo9OJqR9Z17ci/9196ada486dd8eb15769c1f096076b10/Limestone.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html",
          "published_at": "Sun, 15 Feb 2026 15:06:28 +0000",
          "title": "Apple's iPhone Air MagSafe battery is cheaper than ever right now",
          "standfirst": "We found the iPhone Air to have a pretty decent battery life for such a thin-and-light phone, somewhere in the region of 27 hours if you’re continuously streaming video. But it's still a phone, arguably your most used device on a daily basis, so you may need to top it up during the day if you're using it constantly. That’s where Apple’s iPhone Air MagSafe battery pack comes in, and it’s currently on sale for $79. This accessory only works with the iPhone Air, but much like the phone it attaches to, it’s extremely slim at 7.5mmm, so crucially doesn’t add so much bulk when attached that it defeats the point of having a thin phone in the first place. The MagSafe Battery isn’t enormous at 3,149mAh (enough to add an extra 65 percent of charge to the Air), but it can wirelessly charge the AirPods Pro 3 as well, making it an even more useful travel companion. You can also charge your iPhone while charging the battery pack. At its regular price of $99, the MagSafe battery pack is an admittedly pricey add-on to what is already an expensive phone, but for $20 off it’s well worth considering what Engadget’s Sam Rutherford called an \"essential accessory\" for some users in his iPhone Air review. Many Apple loyalists will always insist on having first-party accessories for their iPhone, but there are plenty of third-party MagSafe chargers out there too, a lot of them considerably cheaper than Apple’s lineup. Be sure to check out our guide for those. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html?src=rss",
          "content": "We found the iPhone Air to have a pretty decent battery life for such a thin-and-light phone, somewhere in the region of 27 hours if you’re continuously streaming video. But it's still a phone, arguably your most used device on a daily basis, so you may need to top it up during the day if you're using it constantly. That’s where Apple’s iPhone Air MagSafe battery pack comes in, and it’s currently on sale for $79. This accessory only works with the iPhone Air, but much like the phone it attaches to, it’s extremely slim at 7.5mmm, so crucially doesn’t add so much bulk when attached that it defeats the point of having a thin phone in the first place. The MagSafe Battery isn’t enormous at 3,149mAh (enough to add an extra 65 percent of charge to the Air), but it can wirelessly charge the AirPods Pro 3 as well, making it an even more useful travel companion. You can also charge your iPhone while charging the battery pack. At its regular price of $99, the MagSafe battery pack is an admittedly pricey add-on to what is already an expensive phone, but for $20 off it’s well worth considering what Engadget’s Sam Rutherford called an \"essential accessory\" for some users in his iPhone Air review. Many Apple loyalists will always insist on having first-party accessories for their iPhone, but there are plenty of third-party MagSafe chargers out there too, a lot of them considerably cheaper than Apple’s lineup. Be sure to check out our guide for those. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apples-iphone-air-magsafe-battery-is-cheaper-than-ever-right-now-144516217.html?src=rss",
          "feed_position": 9
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html",
          "published_at": "Sun, 15 Feb 2026 14:35:38 +0000",
          "title": "Get a four-pack of first-gen AirTags on sale for only $64",
          "standfirst": "Good deals on Apple products aren’t as frequent as we’d like them to be, but if there’s one of the company’s products that does seem to enjoy pretty regular price cuts, it’s the AirTag. Right now you can pick up a four-pack of Apple’s diminutive first-generation Bluetooth trackers for $64, which translates to 35 percent off and a near record low price. Bear in mind that this deal brings the price per AirTag down to about $16 if you were to buy them individually, and when not on sale they usually cost $29. If you use Apple devices and consider yourself to be a serial thing-misplacer, AirTags are extremely useful. Adding one to your account takes a single tap, and with Apple’s Find My network so well established, locating missing items has never been easier. Using your iPhone you can trigger a sound from the AirTag’s built-in speaker, or alternatively Precision Finding can be used to pinpoint its location via Find My. You just follow the instructions on your iPhone, paying attention to the vibrations that signal you’re getting closer. A reminder again that the above deals apply to the first-generation AirTag only. Apple introduced a refreshed tracker with greater range and a louder speaker last month, which retails at the same price as its predecessor. For deals on the new AirTag, you may have to wait a bit. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html?src=rss",
          "content": "Good deals on Apple products aren’t as frequent as we’d like them to be, but if there’s one of the company’s products that does seem to enjoy pretty regular price cuts, it’s the AirTag. Right now you can pick up a four-pack of Apple’s diminutive first-generation Bluetooth trackers for $64, which translates to 35 percent off and a near record low price. Bear in mind that this deal brings the price per AirTag down to about $16 if you were to buy them individually, and when not on sale they usually cost $29. If you use Apple devices and consider yourself to be a serial thing-misplacer, AirTags are extremely useful. Adding one to your account takes a single tap, and with Apple’s Find My network so well established, locating missing items has never been easier. Using your iPhone you can trigger a sound from the AirTag’s built-in speaker, or alternatively Precision Finding can be used to pinpoint its location via Find My. You just follow the instructions on your iPhone, paying attention to the vibrations that signal you’re getting closer. A reminder again that the above deals apply to the first-generation AirTag only. Apple introduced a refreshed tracker with greater range and a louder speaker last month, which retails at the same price as its predecessor. For deals on the new AirTag, you may have to wait a bit. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-a-four-pack-of-first-gen-airtags-on-sale-for-only-64-163619270.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/presidents-day-sales-2026-the-best-tech-deals-to-shop-this-weekend-from-apple-sony-anker-and-others-163000988.html",
          "published_at": "Sun, 15 Feb 2026 14:05:00 +0000",
          "title": "Presidents' Day sales 2026: The best tech deals to shop this weekend from Apple, Sony, Anker and others",
          "standfirst": "You can find a lot of good deals for Presidents’ Day, but to say it’s a tech-deal boon would be an overstatement. The best Presidents’ Day deals are usually on mattresses, appliances and furniture, but you can find some decent tech sales thrown in as well. This year, Presidents’ Day comes right after Valentine’s Day and Super Bowl 2026, which means there are even more chances to save as sales and discounts overlap. If you’re looking for a new streaming device, a fresh iPad or an upgraded vacuum so you can enter the spring-cleaning season properly, we have you covered. These are the best President Day sales on tech we could find this year. Presidents’ Day deals under $50 Disney+ and Hulu bundle (one month) for $10 ($3 off): You can get one month of Disney+ and Hulu access for only $10 right now. That represents a small savings over the standard $13-per-month price for the bundle, but a 58-percent discount when you compare it to the price of paying for both services separately. It’s a good way to test out the bundle without paying too much before you decide if you want to subscribe for the long haul. Anker Nano 45W USB-C charger for $30 ($10 off): Anker’s latest 45W charger has a small smart display on it that can show you real-time charging stats. It’s compact design is great for travel, as are its foldable prongs. Waterpik cordless rechargeable water flosser for $40 (20 percent off): A water flosser like this one can make it easier (and less painful in some cases) to floss your teeth on the regular. This model from Waterpik includes two interchangeable tips and has two pressure settings. Its battery life should last up to four weeks with regular use as well. Amazon Fire TV Stick 4K Max for $40 ($20 off): Amazon’s most premium streaming dongle supports 4K HDR content, Dolby Vision and Wi-Fi 6E. You may even be able to get it for $10 less than the sale price listed, for a final price of $30, when using the code MAX4KFTV at checkout. Blink Mini 2K+ — 2 cameras for $45 (50 percent off): Blink’s latest plug-in security cameras support 2K video and improved audio quality. Like previous versions, these cameras have two-way talk, motion alerts and support for Alexa voice commands. Anker Nano 5K ultra-slim magnetic power bank for $46 (16 percent off): This Qi2 power bank measures less than a half inch thick and snaps onto the backs of the latest iPhones for wireless charging. Its 5K capacity will be enough to top up your phone when it’s close to empty, preventing you from searching for a charger or outlet. Presidents’ Day deals on Apple devices Apple iPhone Air MagSafe battery pack for $79 (20 percent off): This magnetic power bank will add up to 65 percent additional battery charge to the iPhone Air, but note that it only works with Apple’s new, ultra-slim smartphone. We’ve tested plenty of others that also work with other iPhone and smartphone models. Apple Magic Mouse for $68 (14 percent off): Apple’s sleek wireless mouse has a multi-touch surface that supports gesture control, and its battery should last about a month in between charges. And yes, it has a USB-C port. Apple Watch Series 11 for $299 ($100 off): The latest flagship Apple Watch has excellent performance, a boosted battery life and a lightweight design that you can comfortably wear all day long — and even into the night to track sleep. iPad mini (A17 Pro ) for $399 ($100 off): The updated iPad mini runs on the A17 Pro chip for improved performance, plus it has an 8.3-inch Liquid Retina display, a 12MP ultra wide camera with Center Stage, USB-C charging and compatibility with the Apple Pencil Pro. Beats Studio Pro for $170 (51 percent off): Beats updated these cans to have improved sound quality, and you can really hear the difference from models that came before it. These headphones also have solid Transparency mode, good voice performance and USB-C audio. Beats Solo 4 headphones for $130 (35 percent off): These on-ear headphones support spatial audio and dynamic head tracking, and they have up to 50 hours of battery life. The “fast fuel” feature allows them to get up to five hours of playback time with just a quick 10-minute power-up. Beats Studio Buds+ for $100 (41 percent off): These tiny buds have both active noise cancellation and transparency mode, and they’ll work just as well with either Apple or Android devices. More Presidents’ Day deals on tech Ring Battery Doorbell for $60 (40 percent off) Logitech MX Master 3S for $80 (20 percent off) Levoit Core 300-P air purifier for $85 (15 percent off) Sony WH-CH720N wireless headphones for $94 (48 percent off) MasterClass Premium (one year) for $120 (50 percent off) Shark Steam & Scrub steam mop for $125 (22 percent off) Google Pixel Buds Pro 2 earbuds for $179 (22 percent off) Sonos Beam Gen 2 soundbar for $369 ($130 off) Hisense 75-inch QD7 Mini-LED 4K smart TV for $548 (16 percent off) DJI Mini 3 Fly More Combo drone bundle for $575 (20 percent off) Breville Barista Touch espresso machine for $800 ($200 off) Motorola Razer Ultra (2025) for $800 (38 percent off) Google Pixel 10 Pro for $849 (23 percent off) This article originally appeared on Engadget at https://www.engadget.com/deals/presidents-day-sales-2026-the-best-tech-deals-to-shop-this-weekend-from-apple-sony-anker-and-others-163000988.html?src=rss",
          "content": "You can find a lot of good deals for Presidents’ Day, but to say it’s a tech-deal boon would be an overstatement. The best Presidents’ Day deals are usually on mattresses, appliances and furniture, but you can find some decent tech sales thrown in as well. This year, Presidents’ Day comes right after Valentine’s Day and Super Bowl 2026, which means there are even more chances to save as sales and discounts overlap. If you’re looking for a new streaming device, a fresh iPad or an upgraded vacuum so you can enter the spring-cleaning season properly, we have you covered. These are the best President Day sales on tech we could find this year. Presidents’ Day deals under $50 Disney+ and Hulu bundle (one month) for $10 ($3 off): You can get one month of Disney+ and Hulu access for only $10 right now. That represents a small savings over the standard $13-per-month price for the bundle, but a 58-percent discount when you compare it to the price of paying for both services separately. It’s a good way to test out the bundle without paying too much before you decide if you want to subscribe for the long haul. Anker Nano 45W USB-C charger for $30 ($10 off): Anker’s latest 45W charger has a small smart display on it that can show you real-time charging stats. It’s compact design is great for travel, as are its foldable prongs. Waterpik cordless rechargeable water flosser for $40 (20 percent off): A water flosser like this one can make it easier (and less painful in some cases) to floss your teeth on the regular. This model from Waterpik includes two interchangeable tips and has two pressure settings. Its battery life should last up to four weeks with regular use as well. Amazon Fire TV Stick 4K Max for $40 ($20 off): Amazon’s most premium streaming dongle supports 4K HDR content, Dolby Vision and Wi-Fi 6E. You may even be able to get it for $10 less than the sale price listed, for a final price of $30, when using the code MAX4KFTV at checkout. Blink Mini 2K+ — 2 cameras for $45 (50 percent off): Blink’s latest plug-in security cameras support 2K video and improved audio quality. Like previous versions, these cameras have two-way talk, motion alerts and support for Alexa voice commands. Anker Nano 5K ultra-slim magnetic power bank for $46 (16 percent off): This Qi2 power bank measures less than a half inch thick and snaps onto the backs of the latest iPhones for wireless charging. Its 5K capacity will be enough to top up your phone when it’s close to empty, preventing you from searching for a charger or outlet. Presidents’ Day deals on Apple devices Apple iPhone Air MagSafe battery pack for $79 (20 percent off): This magnetic power bank will add up to 65 percent additional battery charge to the iPhone Air, but note that it only works with Apple’s new, ultra-slim smartphone. We’ve tested plenty of others that also work with other iPhone and smartphone models. Apple Magic Mouse for $68 (14 percent off): Apple’s sleek wireless mouse has a multi-touch surface that supports gesture control, and its battery should last about a month in between charges. And yes, it has a USB-C port. Apple Watch Series 11 for $299 ($100 off): The latest flagship Apple Watch has excellent performance, a boosted battery life and a lightweight design that you can comfortably wear all day long — and even into the night to track sleep. iPad mini (A17 Pro ) for $399 ($100 off): The updated iPad mini runs on the A17 Pro chip for improved performance, plus it has an 8.3-inch Liquid Retina display, a 12MP ultra wide camera with Center Stage, USB-C charging and compatibility with the Apple Pencil Pro. Beats Studio Pro for $170 (51 percent off): Beats updated these cans to have improved sound quality, and you can really hear the difference from models that came before it. These headphones also have solid Transparency mode, good voice performance and USB-C audio. Beats Solo 4 headphones for $130 (35 percent off): These on-ear headphones support spatial audio and dynamic head tracking, and they have up to 50 hours of battery life. The “fast fuel” feature allows them to get up to five hours of playback time with just a quick 10-minute power-up. Beats Studio Buds+ for $100 (41 percent off): These tiny buds have both active noise cancellation and transparency mode, and they’ll work just as well with either Apple or Android devices. More Presidents’ Day deals on tech Ring Battery Doorbell for $60 (40 percent off) Logitech MX Master 3S for $80 (20 percent off) Levoit Core 300-P air purifier for $85 (15 percent off) Sony WH-CH720N wireless headphones for $94 (48 percent off) MasterClass Premium (one year) for $120 (50 percent off) Shark Steam & Scrub steam mop for $125 (22 percent off) Google Pixel Buds Pro 2 earbuds for $179 (22 percent off) Sonos Beam Gen 2 soundbar for $369 ($130 off) Hisense 75-inch QD7 Mini-LED 4K smart TV for $548 (16 percent off) DJI Mini 3 Fly More Combo drone bundle for $575 (20 percent off) Breville Barista Touch espresso machine for $800 ($200 off) Motorola Razer Ultra (2025) for $800 (38 percent off) Google Pixel 10 Pro for $849 (23 percent off) This article originally appeared on Engadget at https://www.engadget.com/deals/presidents-day-sales-2026-the-best-tech-deals-to-shop-this-weekend-from-apple-sony-anker-and-others-163000988.html?src=rss",
          "feed_position": 11
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html",
          "published_at": "Sun, 15 Feb 2026 13:41:26 +0000",
          "title": "Get the 512GB Samsung P9 microSD Express card for 33 percent off right now",
          "standfirst": "MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, os if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now — you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen. The P9 boasts transfer speeds of up to 800MB/s, making moving games to the card that much faster. As for load times, in our testing we found that any microSD Express, the standard the Switch 2 requires, will offer roughly the same performance. This format is pretty new, so there aren't a ton of cards on the market. As such, the P9 makes our list of best microSD cards for the Nintendo Switch 2. The P9 microSD Express is also compatible with the Steam Deck or any other gaming console that accepts the format, as well as cameras and more. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html?src=rss",
          "content": "MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, os if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now — you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen. The P9 boasts transfer speeds of up to 800MB/s, making moving games to the card that much faster. As for load times, in our testing we found that any microSD Express, the standard the Switch 2 requires, will offer roughly the same performance. This format is pretty new, so there aren't a ton of cards on the market. As such, the P9 makes our list of best microSD cards for the Nintendo Switch 2. The P9 microSD Express is also compatible with the Steam Deck or any other gaming console that accepts the format, as well as cameras and more. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html?src=rss",
          "feed_position": 12
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html",
          "published_at": "Sun, 15 Feb 2026 13:05:36 +0000",
          "title": "Anker's 45W Nano charger with smart display is $10 off",
          "standfirst": "Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now. That's $10 off the regular price. The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features \"fun animations to keep things cheerful.\" Anker says it can recognize what's being charged and automatically adjust certain metrics to ensure a longer battery lifespan. To that end, it works with just about everything. The company advertises that this charger is a good fit for the iPhone, Apple Watch, AirPods and Samsung devices, among others. The new Nano Charger is on the smaller side, with dual folding prongs that rotate to fit most outlets. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html?src=rss",
          "content": "Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now. That's $10 off the regular price. The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features \"fun animations to keep things cheerful.\" Anker says it can recognize what's being charged and automatically adjust certain metrics to ensure a longer battery lifespan. To that end, it works with just about everything. The company advertises that this charger is a good fit for the iPhone, Apple Watch, AirPods and Samsung devices, among others. The new Nano Charger is on the smaller side, with dual folding prongs that rotate to fit most outlets. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html?src=rss",
          "feed_position": 13
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/apple-presidents-day-sales-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-this-weekend-151616206.html",
          "published_at": "Sun, 15 Feb 2026 12:45:35 +0000",
          "title": "Apple Presidents' Day sales: Get the Apple Watch Series 11 for $299, plus more deals to shop this weekend",
          "standfirst": "Whether you're one of the few people still keeping up with New Year's resolutions or just want an upgraded smartwatch, now is a good time to get an Apple Watch. Currently, the Apple Watch Series 11 is on sale for $299 for Presidents' Day, down from $399. The 25 percent discount brings the 2025 model back down to its record-low price. A number of other Apple devices are on sale for the holiday as well. We named the Apple Watch Series 11 as our choice for best smartwatch overall. It scored a 90 in our review thanks to its 24 hours-plus of battery life and a thin, light design that's easy to wear. It also offers new health metrics, including Apple's hypertension alerts system and Sleep Score. The Apple Watch Series 11 deal is available on the 42mm case with a small/medium band. It also only includes GPS and four colorways: the Jet Black and Space Gray aluminum cases with a Black sport band, the Rose Gold aluminum case with a Light Blush sport band and the Silver aluminum case with a Purple Fog sport band. Among the other Presidents' Day Apple deals are mostly accessories: there are solid deals on AirPods, AirTags (the first-gen trackers, not the new, second-gen ones), the iPhone Air battery pack and even Apple's new crossbody straps that attach to the company's iPhone cases so you can essentially \"wear\" your iPhone like a bag. As with most Apple first-party accessories, you can find plenty of more affordable, third-party versions of them as alternatives. But if you're keen on outfitting your phone with Apple's own gear, it's best to wait for discounts like these. We've collected the best Presidents' Day sales on Apple gear below so you don't have to go searching for them. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apple-presidents-day-sales-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-this-weekend-151616206.html?src=rss",
          "content": "Whether you're one of the few people still keeping up with New Year's resolutions or just want an upgraded smartwatch, now is a good time to get an Apple Watch. Currently, the Apple Watch Series 11 is on sale for $299 for Presidents' Day, down from $399. The 25 percent discount brings the 2025 model back down to its record-low price. A number of other Apple devices are on sale for the holiday as well. We named the Apple Watch Series 11 as our choice for best smartwatch overall. It scored a 90 in our review thanks to its 24 hours-plus of battery life and a thin, light design that's easy to wear. It also offers new health metrics, including Apple's hypertension alerts system and Sleep Score. The Apple Watch Series 11 deal is available on the 42mm case with a small/medium band. It also only includes GPS and four colorways: the Jet Black and Space Gray aluminum cases with a Black sport band, the Rose Gold aluminum case with a Light Blush sport band and the Silver aluminum case with a Purple Fog sport band. Among the other Presidents' Day Apple deals are mostly accessories: there are solid deals on AirPods, AirTags (the first-gen trackers, not the new, second-gen ones), the iPhone Air battery pack and even Apple's new crossbody straps that attach to the company's iPhone cases so you can essentially \"wear\" your iPhone like a bag. As with most Apple first-party accessories, you can find plenty of more affordable, third-party versions of them as alternatives. But if you're keen on outfitting your phone with Apple's own gear, it's best to wait for discounts like these. We've collected the best Presidents' Day sales on Apple gear below so you don't have to go searching for them. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/apple-presidents-day-sales-get-the-apple-watch-series-11-for-299-plus-more-deals-to-shop-this-weekend-151616206.html?src=rss",
          "feed_position": 14
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/masterclass-deal-its-the-last-day-to-get-50-percent-off-subscriptions-130500234.html",
          "published_at": "Sat, 14 Feb 2026 17:05:00 +0000",
          "title": "MasterClass deal: It's the last day to get 50 percent off subscriptions",
          "standfirst": "MasterClass has dropped the price of its annual memberships by 50 percent, making it a more affordable way to explore its full library of courses across cooking, business, photography, writing and more. With the discount applied, you’ll spend $10 per month when billed annually for the Premium tier, with lower-cost Standard and Plus options available depending on how many devices you want to use at once and whether you need offline viewing. There are more than 200 classes on MasterClass now, and many are led by big names at the top of their fields. Depending on your interests, you might pick up cooking tips from Gordon Ramsay, learn storytelling from Margaret Atwood, explore business strategy with Richard Branson or get insights into performance and mindset from athletes and entertainers. The catalog spans everything from film and TV to wellness, music, science, leadership and photography, so it’s easy to dip in and find something that holds your attention. Over the years, MasterClass has expanded into a broad learning platform that feels like part streaming service and part educational library. The catalog spans categories like food, film, music, wellness, sports and entrepreneurship, with lessons designed to be short and easy to follow. Since every plan includes access to the full course library, the choice mostly comes down to convenience. The Standard tier supports one device and doesn’t include offline mode, the Plus plan allows streaming on two devices with downloads, and the Premium tier increases that to six devices with offline access as well. Classes are structured to be approachable whether you want to learn a new skill or just explore a topic out of curiosity. Lessons are broken into bite-sized segments, so it’s easy to watch one or two at a time on a commute or in the evening. Members also get access to a global community, occasional newsletters and the ability to switch between video and audio listening on supported classes. If you’ve been considering trying MasterClass, this deal makes it a more affordable way to see if it works for you. A subscription can also double as a thoughtful gift, which is one reason it has appeared in Engadget’s roundup of the best subscription gifts to send to loved ones. With the current 50 percent discount applied across all tiers, it’s a relatively low-cost way to get access to a large library of professionally produced courses that you can watch at your own pace throughout the year.This article originally appeared on Engadget at https://www.engadget.com/deals/masterclass-deal-its-the-last-day-to-get-50-percent-off-subscriptions-130500234.html?src=rss",
          "content": "MasterClass has dropped the price of its annual memberships by 50 percent, making it a more affordable way to explore its full library of courses across cooking, business, photography, writing and more. With the discount applied, you’ll spend $10 per month when billed annually for the Premium tier, with lower-cost Standard and Plus options available depending on how many devices you want to use at once and whether you need offline viewing. There are more than 200 classes on MasterClass now, and many are led by big names at the top of their fields. Depending on your interests, you might pick up cooking tips from Gordon Ramsay, learn storytelling from Margaret Atwood, explore business strategy with Richard Branson or get insights into performance and mindset from athletes and entertainers. The catalog spans everything from film and TV to wellness, music, science, leadership and photography, so it’s easy to dip in and find something that holds your attention. Over the years, MasterClass has expanded into a broad learning platform that feels like part streaming service and part educational library. The catalog spans categories like food, film, music, wellness, sports and entrepreneurship, with lessons designed to be short and easy to follow. Since every plan includes access to the full course library, the choice mostly comes down to convenience. The Standard tier supports one device and doesn’t include offline mode, the Plus plan allows streaming on two devices with downloads, and the Premium tier increases that to six devices with offline access as well. Classes are structured to be approachable whether you want to learn a new skill or just explore a topic out of curiosity. Lessons are broken into bite-sized segments, so it’s easy to watch one or two at a time on a commute or in the evening. Members also get access to a global community, occasional newsletters and the ability to switch between video and audio listening on supported classes. If you’ve been considering trying MasterClass, this deal makes it a more affordable way to see if it works for you. A subscription can also double as a thoughtful gift, which is one reason it has appeared in Engadget’s roundup of the best subscription gifts to send to loved ones. With the current 50 percent discount applied across all tiers, it’s a relatively low-cost way to get access to a large library of professionally produced courses that you can watch at your own pace throughout the year.This article originally appeared on Engadget at https://www.engadget.com/deals/masterclass-deal-its-the-last-day-to-get-50-percent-off-subscriptions-130500234.html?src=rss",
          "feed_position": 20
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/disney-and-hulu-deal-get-the-bundle-for-10-for-one-month-192814789.html",
          "published_at": "Sat, 14 Feb 2026 16:30:35 +0000",
          "title": "Disney+ and Hulu deal: Get the bundle for $10 for one month",
          "standfirst": "The peak time for deals on streaming services — the holiday shopping season — has come and gone, but Disney is back with a fresh offer for the new year. New and eligible returning subscribers can get one month of the ad-supported Disney+ Hulu bundle for just $10. That's $3 off the usual monthly rate for the bundle, and more than 58 percent off if you consider the prices for each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month). We'd be remiss if we didn't mention that this isn't quite as good as the Black Friday deal we saw last year, which offered the same bundle for $5 per month for one year. However, if you missed that offer or just want to try out Disney+ and Hulu for a brief period of time, this is a good way to do so. Disney+ and Hulu make one of the most balanced streaming pairs available, blending family-friendly favorites with acclaimed originals and network TV staples. Disney+ brings a vast library of animated classics, blockbuster franchises and exclusive content from Marvel, Pixar, Star Wars and National Geographic. It’s the place to stream nearly every Star Wars film and series, plus the full Marvel Cinematic Universe lineup and Disney’s most recent theatrical releases. Hulu balances things out with a more adult-oriented lineup of current TV shows, next-day network episodes and a growing roster of award-winning originals. The platform hosts series like The Bear, The Handmaid’s Tale and Only Murders in the Building, alongside comedies, thrillers and documentaries that regularly feature in awards conversations. It’s also the home for next-day streaming of ABC and FX shows, making it especially useful if you’ve already cut the cable cord but still want to keep up with primetime TV. The Duo Basic bundle ties these two services together under a single subscription, offering a simple way to expand your library without juggling multiple accounts. This tier includes ads on both platforms, but the trade-off is significant savings compared with paying for each service separately. For many households, that’s an acceptable compromise when it means access to such a wide range of content. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/disney-and-hulu-deal-get-the-bundle-for-10-for-one-month-192814789.html?src=rss",
          "content": "The peak time for deals on streaming services — the holiday shopping season — has come and gone, but Disney is back with a fresh offer for the new year. New and eligible returning subscribers can get one month of the ad-supported Disney+ Hulu bundle for just $10. That's $3 off the usual monthly rate for the bundle, and more than 58 percent off if you consider the prices for each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month). We'd be remiss if we didn't mention that this isn't quite as good as the Black Friday deal we saw last year, which offered the same bundle for $5 per month for one year. However, if you missed that offer or just want to try out Disney+ and Hulu for a brief period of time, this is a good way to do so. Disney+ and Hulu make one of the most balanced streaming pairs available, blending family-friendly favorites with acclaimed originals and network TV staples. Disney+ brings a vast library of animated classics, blockbuster franchises and exclusive content from Marvel, Pixar, Star Wars and National Geographic. It’s the place to stream nearly every Star Wars film and series, plus the full Marvel Cinematic Universe lineup and Disney’s most recent theatrical releases. Hulu balances things out with a more adult-oriented lineup of current TV shows, next-day network episodes and a growing roster of award-winning originals. The platform hosts series like The Bear, The Handmaid’s Tale and Only Murders in the Building, alongside comedies, thrillers and documentaries that regularly feature in awards conversations. It’s also the home for next-day streaming of ABC and FX shows, making it especially useful if you’ve already cut the cable cord but still want to keep up with primetime TV. The Duo Basic bundle ties these two services together under a single subscription, offering a simple way to expand your library without juggling multiple accounts. This tier includes ads on both platforms, but the trade-off is significant savings compared with paying for each service separately. For many households, that’s an acceptable compromise when it means access to such a wide range of content. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/disney-and-hulu-deal-get-the-bundle-for-10-for-one-month-192814789.html?src=rss",
          "feed_position": 21
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/this-elevation-lab-airtag-10-year-extended-battery-case-is-on-sale-for-only-16-right-now-151215739.html",
          "published_at": "Sat, 14 Feb 2026 15:06:26 +0000",
          "title": "This Elevation Lab AirTag 10-year extended battery case is on sale for only $16 right now",
          "standfirst": "If you're an iPhone user who likes to keep tabs on where your stuff is, you can't go far wrong with an AirTag. The second-gen model that Apple just released outpaces the original in every way (aside from the galling lack of a keyring hole, that is). While it's easy enough to replace the battery in both versions of the AirTag, you might not want to have to worry about the device's battery life for a very long time. Enter Elevation Lab's extended battery case for the AirTag, which is currently on sale at Amazon for $16. The case usually sells for $23, so that's a 30 percent discount. It's not the first time we've seen this deal, but it's a pretty decent one all the same. This is arguably one of the more useful AirTag accessories around for certain use cases. It won't exactly be helpful for an AirTag that you put in a wallet or attach to your keys, as it's too bulky for such a purpose — and it doesn't have a hole for a keyring anyway. Still, if you're looking for an AirTag case that you can place in a suitcase or backpack and not have to touch for years, this could be the ticket. Elevation Lab says that, when you place a couple of AA batteries in the case, it can extend the tracker's battery life to as much as 10 years (the brand recommends using Energizer Ultimate Lithium batteries for best results). The AirTag is slated to run for over a year on its standard CR2032 button cell. The case gives the AirTag more protection as well. It's sealed with four screws and it has a IP69 waterproof rating. What's more, it doesn't ostensibly look like an AirTag case, so someone who steals an item with one inside is perhaps less likely to realize that the object they pilfered is being tracked. There are some other downsides, though. Since the AirTag is locked inside a case, the sound it emits will be muffled. Elevation Lab says the device's volume will be about two-thirds the level of a case-free AirTag. However, the second-gen AirTag is louder than its predecessor, which should mitigate that issue somewhat. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/this-elevation-lab-airtag-10-year-extended-battery-case-is-on-sale-for-only-16-right-now-151215739.html?src=rss",
          "content": "If you're an iPhone user who likes to keep tabs on where your stuff is, you can't go far wrong with an AirTag. The second-gen model that Apple just released outpaces the original in every way (aside from the galling lack of a keyring hole, that is). While it's easy enough to replace the battery in both versions of the AirTag, you might not want to have to worry about the device's battery life for a very long time. Enter Elevation Lab's extended battery case for the AirTag, which is currently on sale at Amazon for $16. The case usually sells for $23, so that's a 30 percent discount. It's not the first time we've seen this deal, but it's a pretty decent one all the same. This is arguably one of the more useful AirTag accessories around for certain use cases. It won't exactly be helpful for an AirTag that you put in a wallet or attach to your keys, as it's too bulky for such a purpose — and it doesn't have a hole for a keyring anyway. Still, if you're looking for an AirTag case that you can place in a suitcase or backpack and not have to touch for years, this could be the ticket. Elevation Lab says that, when you place a couple of AA batteries in the case, it can extend the tracker's battery life to as much as 10 years (the brand recommends using Energizer Ultimate Lithium batteries for best results). The AirTag is slated to run for over a year on its standard CR2032 button cell. The case gives the AirTag more protection as well. It's sealed with four screws and it has a IP69 waterproof rating. What's more, it doesn't ostensibly look like an AirTag case, so someone who steals an item with one inside is perhaps less likely to realize that the object they pilfered is being tracked. There are some other downsides, though. Since the AirTag is locked inside a case, the sound it emits will be muffled. Elevation Lab says the device's volume will be about two-thirds the level of a case-free AirTag. However, the second-gen AirTag is louder than its predecessor, which should mitigate that issue somewhat. Follow @EngadgetDeals on X for the latest tech deals and buying advice.This article originally appeared on Engadget at https://www.engadget.com/deals/this-elevation-lab-airtag-10-year-extended-battery-case-is-on-sale-for-only-16-right-now-151215739.html?src=rss",
          "feed_position": 23
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/how-to-customize-your-iphone-home-screen-with-ios-26-130000798.html",
          "published_at": "Sat, 14 Feb 2026 13:00:00 +0000",
          "title": "How to customize your iPhone home screen with iOS 26",
          "standfirst": "Apple has steadily expanded home screen customization on the iPhone over the past few years, and iOS 26 continues that trend with more visual control over app icons. Building on the changes introduced in iOS 18, the latest update lets you resize icons, remove app labels, apply system-wide color tints and make icons translucent using Apple’s new Liquid Glass design language.Most of these options live in one place: the Customize menu, which appears after entering edit mode on the home screen. While iOS still doesn’t allow total freeform icon placement or third-party icon packs without shortcuts, the tools Apple provides are now flexible enough to dramatically change how an iPhone looks and feels. This guide walks through how to customize app icons and layouts using the options available in iOS 26, with a focus on icon size, color, appearance and arrangement.How to customize your iPhone home screenAll home screen customization starts the same way.Go to the Home Screen.Touch and hold an empty area of the Home Screen background until the apps begin to jiggle.Tap Edit in the top left corner, then select Customize from the menu.A customization panel appears along the bottom of the screen. Changes made here apply across all home screen pages at once, rather than on a per-page basis.From the Customize menu, you can:Adjust icon sizeChange appearance (e.g., Dark)Make icons translucent with a clear lookAdd a color tint to icons and widgetsHow to make app icons larger and remove labelsOne of the simplest changes in iOS 26 is also one of the most visually impactful. From the Customize menu, tap the icon showing two app squares of different sizes. This switches the home screen to Large App Icons mode.When large icons are enabled, app labels disappear entirely and the icons themselves expand to fill more of the grid. This creates a cleaner look and makes apps easier to tap, particularly on iPhone models with larger screens. The tradeoff is that fewer icons fit on each screen and spacing between rows becomes more pronounced.To revert to standard icons with labels, repeat the steps and tap the same button again.How to change the appearance of app iconsiOS 26 offers four icon appearance styles: Default, Dark, Clear and Tinted. These options are available from the top row of the Customize panel. From the Customize panel, you can tap the sun icon across all options in the top left-hand corner to toggle wallpaper dimming. This generally makes app icons and labels easier to read. The Default option keeps icons looking as the developers intended, with no system-wide color or transparency applied.Selecting Dark applies a darker background to supported app icons and widgets. Apple’s own apps fully support this mode, and some third-party apps do as well, though many retain their original colors. When Dark is enabled, iOS can also dim the wallpaper slightly, which may help reduce power usage on OLED displays.The Clear option enables translucency across all apps on the Home Screen. This removes all color but retains app labels. The layered, frosted-glass effect changes depending on the background image. Clear icons can be paired with Light, Dark or Auto styles using the options along the bottom of the Customize panel.Tinted mode allows all supported app icons and widgets to take on a single color scheme. After selecting Tinted, color and saturation sliders appear at the bottom of the screen. Adjusting these changes the hue applied across icons, creating a uniform look that can range from subtle pastels to high-contrast monochrome themes.If you want a specific color from your iPhone’s wallpaper, select the eyedropper tool, then tap and hold while dragging the cursor across the screen until you land on your chosen color. Like the Clear option, you’ll be able to select from Light, Dark or Auto when adjusting the Tinted settings.The Auto option allows icons to switch between light and dark appearances based on system-wide light or dark mode.How to arrange apps around the home screenApp placement works the same way it did before iOS 26, but the visual changes introduced by larger icons and spacing make layout choices more noticeable.Apps can be rearranged by accessing an empty space on the Home Screen, then tapping and holding until the apps start jiggling. From here you can drag icons to new positions. The grid remains fixed, meaning icons cannot overlap or be placed freely, but there is more flexibility in how empty space is used.Icons can be clustered toward the bottom of the screen, aligned to one side or arranged to frame a wallpaper. With large icons enabled, the gap between the dock and the first row of apps becomes more pronounced, but it cannot be filled with additional icons.Changes apply across all home screen pages, so reorganizing one page does not affect icon size or appearance on another.What iOS 26 still doesn’t allowDespite expanded customization, some long-standing limitations remain. iOS 26 does not support per-app icon color selection, custom icon packs without shortcuts or freeform icon placement outside the grid. Icon appearance settings apply globally, not per page or per app.Widgets, lock screen customization and focus mode filters add additional layers of personalization, but those tools sit outside the scope of the home screen Edit menu.iOS 26 gives iPhone users more control over the look of their home screen than ever before, even if Apple’s approach remains structured. By combining icon resizing, appearance modes and careful app arrangement, it’s possible to create a layout that feels cleaner, more personal and easier to use without relying on workarounds.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-customize-your-iphone-home-screen-with-ios-26-130000798.html?src=rss",
          "content": "Apple has steadily expanded home screen customization on the iPhone over the past few years, and iOS 26 continues that trend with more visual control over app icons. Building on the changes introduced in iOS 18, the latest update lets you resize icons, remove app labels, apply system-wide color tints and make icons translucent using Apple’s new Liquid Glass design language.Most of these options live in one place: the Customize menu, which appears after entering edit mode on the home screen. While iOS still doesn’t allow total freeform icon placement or third-party icon packs without shortcuts, the tools Apple provides are now flexible enough to dramatically change how an iPhone looks and feels. This guide walks through how to customize app icons and layouts using the options available in iOS 26, with a focus on icon size, color, appearance and arrangement.How to customize your iPhone home screenAll home screen customization starts the same way.Go to the Home Screen.Touch and hold an empty area of the Home Screen background until the apps begin to jiggle.Tap Edit in the top left corner, then select Customize from the menu.A customization panel appears along the bottom of the screen. Changes made here apply across all home screen pages at once, rather than on a per-page basis.From the Customize menu, you can:Adjust icon sizeChange appearance (e.g., Dark)Make icons translucent with a clear lookAdd a color tint to icons and widgetsHow to make app icons larger and remove labelsOne of the simplest changes in iOS 26 is also one of the most visually impactful. From the Customize menu, tap the icon showing two app squares of different sizes. This switches the home screen to Large App Icons mode.When large icons are enabled, app labels disappear entirely and the icons themselves expand to fill more of the grid. This creates a cleaner look and makes apps easier to tap, particularly on iPhone models with larger screens. The tradeoff is that fewer icons fit on each screen and spacing between rows becomes more pronounced.To revert to standard icons with labels, repeat the steps and tap the same button again.How to change the appearance of app iconsiOS 26 offers four icon appearance styles: Default, Dark, Clear and Tinted. These options are available from the top row of the Customize panel. From the Customize panel, you can tap the sun icon across all options in the top left-hand corner to toggle wallpaper dimming. This generally makes app icons and labels easier to read. The Default option keeps icons looking as the developers intended, with no system-wide color or transparency applied.Selecting Dark applies a darker background to supported app icons and widgets. Apple’s own apps fully support this mode, and some third-party apps do as well, though many retain their original colors. When Dark is enabled, iOS can also dim the wallpaper slightly, which may help reduce power usage on OLED displays.The Clear option enables translucency across all apps on the Home Screen. This removes all color but retains app labels. The layered, frosted-glass effect changes depending on the background image. Clear icons can be paired with Light, Dark or Auto styles using the options along the bottom of the Customize panel.Tinted mode allows all supported app icons and widgets to take on a single color scheme. After selecting Tinted, color and saturation sliders appear at the bottom of the screen. Adjusting these changes the hue applied across icons, creating a uniform look that can range from subtle pastels to high-contrast monochrome themes.If you want a specific color from your iPhone’s wallpaper, select the eyedropper tool, then tap and hold while dragging the cursor across the screen until you land on your chosen color. Like the Clear option, you’ll be able to select from Light, Dark or Auto when adjusting the Tinted settings.The Auto option allows icons to switch between light and dark appearances based on system-wide light or dark mode.How to arrange apps around the home screenApp placement works the same way it did before iOS 26, but the visual changes introduced by larger icons and spacing make layout choices more noticeable.Apps can be rearranged by accessing an empty space on the Home Screen, then tapping and holding until the apps start jiggling. From here you can drag icons to new positions. The grid remains fixed, meaning icons cannot overlap or be placed freely, but there is more flexibility in how empty space is used.Icons can be clustered toward the bottom of the screen, aligned to one side or arranged to frame a wallpaper. With large icons enabled, the gap between the dock and the first row of apps becomes more pronounced, but it cannot be filled with additional icons.Changes apply across all home screen pages, so reorganizing one page does not affect icon size or appearance on another.What iOS 26 still doesn’t allowDespite expanded customization, some long-standing limitations remain. iOS 26 does not support per-app icon color selection, custom icon packs without shortcuts or freeform icon placement outside the grid. Icon appearance settings apply globally, not per page or per app.Widgets, lock screen customization and focus mode filters add additional layers of personalization, but those tools sit outside the scope of the home screen Edit menu.iOS 26 gives iPhone users more control over the look of their home screen than ever before, even if Apple’s approach remains structured. By combining icon resizing, appearance modes and careful app arrangement, it’s possible to create a layout that feels cleaner, more personal and easier to use without relying on workarounds.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-customize-your-iphone-home-screen-with-ios-26-130000798.html?src=rss",
          "feed_position": 25,
          "image_url": "https://s.yimg.com/os/creatr-uploaded-images/2025-11/346229a0-bda4-11f0-b7bf-ab5c978ee05e"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/playstation/relooted-reanimal-and-other-new-indie-games-worth-checking-out-120000234.html",
          "published_at": "Sat, 14 Feb 2026 12:00:00 +0000",
          "title": "Relooted, Reanimal and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. A whole bunch of compelling games arrived this week, and Sony dropped some news about more that are on the way to PS5 and other platforms during its State of Play stream on Thursday. For one thing, I didn’t have a prequel for Neva, one of my favorite games of the last few years on my bingo card. I’m very much looking forward to checking out that DLC next week. It’s really neat that Motion Twin and Evil Empire — the studios behind Dead Cells and its expansions, respectively — are getting to make a proper Castlevania game. While it might not be developing many games in-house anymore, giving external studios the chance to run with its franchises is a very smart move on Konami’s part. Not least because we’re getting a Silent Hill game set in Scotland as well.I’ve had Big Walk on my radar since the game was first shown off at The Game Awards a couple of years back. This is a co-op multiplayer game from Untitled Goose Game studio House House and publisher Panic in which you'll go on adventures with your friends and help each other through puzzles and other challenges using voice, text chat and gestures. You can just hang out with your buds and watch the sunset or put their binoculars into the ocean too.Expect Big Walk to arrive later this year on PS5 (including as a Monthly Game for all PS Plus members), Steam and Epic Games Store. There will be support for cross-platform play between PS5 and PC.Also, Remedy Entertainment is technically an indie studio. As such, I can mention here that I cannot wait for Control Resonant, which is probably going to break my brain with all the perspective shifting Remedy showed off in the gameplay trailer. New releasesAs with any successful heist, planning and execution are equally paramount in Relooted. Setting things up properly before hightailing it out of a museum with artifacts reminds me a bit of Teardown albeit without all the voxel destruction. But Relooted is a lot more than that. It’s an anti-colonialist story in which parkour enthusiast Nomali and her crew take back African artifacts (all of which exist in real life) from Western museums. I did encounter some performance issues while playing on PC, but that didn't take too much away from the enjoyable, in-the-moment action and having to adjust escape routes on the fly when things go awry. Nor did the framerate drops detract one bit from the important story that South African studio Nyamakop is telling here.Relooted is out now on Steam, Epic Games Store and Xbox Series X/S. It typically costs $15, but there's a 10 percent discount on Steam until February 24. It's available on Game Pass Ultimate and PC Game Pass.Little Nightmares and Little Nightmares 2 developer Tarsier Studios is back with another slice of atmospheric horror. In Reanimal, two siblings set out to save their missing friends and escape from an island they once called home. However, they'll have to face a litany of dangers, including a lot of creepy creatures. I haven't played Reanimal yet, but the various trailers have have always grabbed my attention. It's out now on Steam, PS5, Xbox Series X/S and Nintendo Switch 2 for $40.Reanimal has single-player, couch co-op and online co-op modes. A friend pass that allows you to invite a pal to play with you online at no extra cost should be available soon.Mewgenics had been in the works for a very long time before it arrived this week. It was initially announced in 2012 when co-developer Edmund McMillen was still part of Super Meat Boy studio Team Meat. After years of Mewgenics being in development hell amid McMillen focusing on projects such as The Binding of Isaac: Rebirth, he's finally seen the game through with the help of longtime collaborator Tyler Glaiel.This is a turn-based strategy roguelike in which players breed cats and then take kitties with wild mutations and blends of powers into combat. There's a lot to explore and discover here. McMillen and Glaiel claim the main campaign runs for over 200 hours. Having more than 10 character classes (each with 75 unique abilities), more than 900 items and hundreds of bosses and enemies could well ensure that things stay fresh enough to justify that run time.Reviews have largely been positive for this one, though the humor didn't click for some critics. Mewgenics is out now on Steam. It usually costs $30, but you can save $3 if you buy it by February 24.Rogue Point is a co-op shooter for up to four players that’s worth paying attention to, in large part because it’s from the team behind Black Mesa, the fan remake of Half-Life. It's now available in early access on Steam, typically for $20, though there's a 15 percent discount until February 26.This appears to be in the vein of tactical shooters like Ubisoft's Tom Clancy games. There are objective-based missions and a Counter-Strike-style economy for unlocking and upgrading gear. While there are only four maps as things stand, Crowbar Collective has implemented a system that randomizes the layouts to keep things fresh. Upcoming Steam Next Fest is almost upon us. Many developers and publishers are preparing to release demos for their games, but some are arriving ahead of the event, such as one for Starship Troopers: Ultimate Bug War! The demo is a blast and it feels like the kind of retro Starship Troopers shooter I wish we'd had in the late '90s. I really enjoy Helldivers 2, which takes a lot of inspiration from Starship Troopers. In turn, this game draws from Helldivers 2, with features like tossing a flare to tell a support craft to send gear down to the planet's surface. I just wish the mech was a bit more fun and effective to use.If you would like to know more about this game from Warhammer 40,000: Boltgun developer Auroch Digital and publisher Dotemu, you can check out the demo on Steam. Starship Troopers: Ultimate Bug War! is coming to Steam, GOG, PS5, Xbox Series X/S and Nintendo Switch 2 on March 16.A demo for a line-based puzzle title called Rope popped up on Steam this week ahead of the full game's arrival in April for about $3.50. The aim is to connect ropes of the same color to clear them. More rules will be introduced over time to make the game more challenging.While Rope looks charming enough, I mainly wanted to include it in this week’s roundup because I thought developer Ikuo's comments in the press release were quite lovely. \"My games are neither flashy nor extravagant. Instead, I focus on preserving the essence of play. Like hide‑and‑seek or tag — simple rules that draw you in until you forget the time,\" Ikuo said. \"Rope brings that timeless spirit of play into a modern puzzle game. It is intuitive, endlessly replayable and quietly absorbing. I aimed to create a small, understated experience that stays with players long after they put it down. I hope this game leaves even a small impression on someone’s heart.\"The Mermaid Mask is a project that SFB Games put on the backburner after another one of their games became a hit (that would be Crow Country, which was one of our favorite games of 2024). This point-and-click puzzle game is the latest installment in the long-running Detective Grimoire series. A teaser trailer doesn't give away too much, but I do enjoy what we see of the hand-drawn 2D animation here. Here's hoping this is a worthy follow-up to Tangle Tower, an Apple Arcade game we enjoyed very much. We'll find out for sure when The Mermaid Mask lands on PC and consoles this summer. In the meantime, you can check out an updated demo that just hit Steam ahead of Next Fest. The premise of The Stairwell is practically identical to that of The Exit 8. You walk through a small, contained scene multiple times. If everything looks okay, keep walking forward. If something is out of the ordinary, you turn around. Just try not to miss many anomalies. Rather than walk through corridors as in The Exit 8 (the film adaptation of which looks pretty promising), The Stairwell sees you going up or down a seemingly infinite tower as you try to reach the goal. This anomaly game, which is from Hidden Palace, has been on Steam since last year. It’s coming to PS5 on February 19. Expect jump scares. Let's wrap things up for this week with an arcade game that requires just two inputs: one button to turn left, and another to veer right. You can't control the speed of your craft in Ship v Maze. All you can do to avoid crashing and ending your run is to react quickly enough to steer your ship through various obstacles. It's all about putting your reflexes to the test.Ship v Maze is from Cosmic Droplet (aka solo developer Frederic Vanmol), It'll hit Steam on April 2 for $4. A demo is available now.This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/relooted-reanimal-and-other-new-indie-games-worth-checking-out-120000234.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. A whole bunch of compelling games arrived this week, and Sony dropped some news about more that are on the way to PS5 and other platforms during its State of Play stream on Thursday. For one thing, I didn’t have a prequel for Neva, one of my favorite games of the last few years on my bingo card. I’m very much looking forward to checking out that DLC next week. It’s really neat that Motion Twin and Evil Empire — the studios behind Dead Cells and its expansions, respectively — are getting to make a proper Castlevania game. While it might not be developing many games in-house anymore, giving external studios the chance to run with its franchises is a very smart move on Konami’s part. Not least because we’re getting a Silent Hill game set in Scotland as well.I’ve had Big Walk on my radar since the game was first shown off at The Game Awards a couple of years back. This is a co-op multiplayer game from Untitled Goose Game studio House House and publisher Panic in which you'll go on adventures with your friends and help each other through puzzles and other challenges using voice, text chat and gestures. You can just hang out with your buds and watch the sunset or put their binoculars into the ocean too.Expect Big Walk to arrive later this year on PS5 (including as a Monthly Game for all PS Plus members), Steam and Epic Games Store. There will be support for cross-platform play between PS5 and PC.Also, Remedy Entertainment is technically an indie studio. As such, I can mention here that I cannot wait for Control Resonant, which is probably going to break my brain with all the perspective shifting Remedy showed off in the gameplay trailer. New releasesAs with any successful heist, planning and execution are equally paramount in Relooted. Setting things up properly before hightailing it out of a museum with artifacts reminds me a bit of Teardown albeit without all the voxel destruction. But Relooted is a lot more than that. It’s an anti-colonialist story in which parkour enthusiast Nomali and her crew take back African artifacts (all of which exist in real life) from Western museums. I did encounter some performance issues while playing on PC, but that didn't take too much away from the enjoyable, in-the-moment action and having to adjust escape routes on the fly when things go awry. Nor did the framerate drops detract one bit from the important story that South African studio Nyamakop is telling here.Relooted is out now on Steam, Epic Games Store and Xbox Series X/S. It typically costs $15, but there's a 10 percent discount on Steam until February 24. It's available on Game Pass Ultimate and PC Game Pass.Little Nightmares and Little Nightmares 2 developer Tarsier Studios is back with another slice of atmospheric horror. In Reanimal, two siblings set out to save their missing friends and escape from an island they once called home. However, they'll have to face a litany of dangers, including a lot of creepy creatures. I haven't played Reanimal yet, but the various trailers have have always grabbed my attention. It's out now on Steam, PS5, Xbox Series X/S and Nintendo Switch 2 for $40.Reanimal has single-player, couch co-op and online co-op modes. A friend pass that allows you to invite a pal to play with you online at no extra cost should be available soon.Mewgenics had been in the works for a very long time before it arrived this week. It was initially announced in 2012 when co-developer Edmund McMillen was still part of Super Meat Boy studio Team Meat. After years of Mewgenics being in development hell amid McMillen focusing on projects such as The Binding of Isaac: Rebirth, he's finally seen the game through with the help of longtime collaborator Tyler Glaiel.This is a turn-based strategy roguelike in which players breed cats and then take kitties with wild mutations and blends of powers into combat. There's a lot to explore and discover here. McMillen and Glaiel claim the main campaign runs for over 200 hours. Having more than 10 character classes (each with 75 unique abilities), more than 900 items and hundreds of bosses and enemies could well ensure that things stay fresh enough to justify that run time.Reviews have largely been positive for this one, though the humor didn't click for some critics. Mewgenics is out now on Steam. It usually costs $30, but you can save $3 if you buy it by February 24.Rogue Point is a co-op shooter for up to four players that’s worth paying attention to, in large part because it’s from the team behind Black Mesa, the fan remake of Half-Life. It's now available in early access on Steam, typically for $20, though there's a 15 percent discount until February 26.This appears to be in the vein of tactical shooters like Ubisoft's Tom Clancy games. There are objective-based missions and a Counter-Strike-style economy for unlocking and upgrading gear. While there are only four maps as things stand, Crowbar Collective has implemented a system that randomizes the layouts to keep things fresh. Upcoming Steam Next Fest is almost upon us. Many developers and publishers are preparing to release demos for their games, but some are arriving ahead of the event, such as one for Starship Troopers: Ultimate Bug War! The demo is a blast and it feels like the kind of retro Starship Troopers shooter I wish we'd had in the late '90s. I really enjoy Helldivers 2, which takes a lot of inspiration from Starship Troopers. In turn, this game draws from Helldivers 2, with features like tossing a flare to tell a support craft to send gear down to the planet's surface. I just wish the mech was a bit more fun and effective to use.If you would like to know more about this game from Warhammer 40,000: Boltgun developer Auroch Digital and publisher Dotemu, you can check out the demo on Steam. Starship Troopers: Ultimate Bug War! is coming to Steam, GOG, PS5, Xbox Series X/S and Nintendo Switch 2 on March 16.A demo for a line-based puzzle title called Rope popped up on Steam this week ahead of the full game's arrival in April for about $3.50. The aim is to connect ropes of the same color to clear them. More rules will be introduced over time to make the game more challenging.While Rope looks charming enough, I mainly wanted to include it in this week’s roundup because I thought developer Ikuo's comments in the press release were quite lovely. \"My games are neither flashy nor extravagant. Instead, I focus on preserving the essence of play. Like hide‑and‑seek or tag — simple rules that draw you in until you forget the time,\" Ikuo said. \"Rope brings that timeless spirit of play into a modern puzzle game. It is intuitive, endlessly replayable and quietly absorbing. I aimed to create a small, understated experience that stays with players long after they put it down. I hope this game leaves even a small impression on someone’s heart.\"The Mermaid Mask is a project that SFB Games put on the backburner after another one of their games became a hit (that would be Crow Country, which was one of our favorite games of 2024). This point-and-click puzzle game is the latest installment in the long-running Detective Grimoire series. A teaser trailer doesn't give away too much, but I do enjoy what we see of the hand-drawn 2D animation here. Here's hoping this is a worthy follow-up to Tangle Tower, an Apple Arcade game we enjoyed very much. We'll find out for sure when The Mermaid Mask lands on PC and consoles this summer. In the meantime, you can check out an updated demo that just hit Steam ahead of Next Fest. The premise of The Stairwell is practically identical to that of The Exit 8. You walk through a small, contained scene multiple times. If everything looks okay, keep walking forward. If something is out of the ordinary, you turn around. Just try not to miss many anomalies. Rather than walk through corridors as in The Exit 8 (the film adaptation of which looks pretty promising), The Stairwell sees you going up or down a seemingly infinite tower as you try to reach the goal. This anomaly game, which is from Hidden Palace, has been on Steam since last year. It’s coming to PS5 on February 19. Expect jump scares. Let's wrap things up for this week with an arcade game that requires just two inputs: one button to turn left, and another to veer right. You can't control the speed of your craft in Ship v Maze. All you can do to avoid crashing and ending your run is to react quickly enough to steer your ship through various obstacles. It's all about putting your reflexes to the test.Ship v Maze is from Cosmic Droplet (aka solo developer Frederic Vanmol), It'll hit Steam on April 2 for $4. A demo is available now.This article originally appeared on Engadget at https://www.engadget.com/gaming/playstation/relooted-reanimal-and-other-new-indie-games-worth-checking-out-120000234.html?src=rss",
          "feed_position": 26
        }
      ],
      "featured_image": "https://s.yimg.com/os/creatr-uploaded-images/2025-06/f88e8cd0-4638-11f0-bffd-78988bb5f8ab",
      "popularity_score": 2018.4219830555555
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 21:11:54 +0000",
      "title": "Space Station returns to a full crew complement after a month",
      "neutral_headline": "Space Station returns to a full crew complement after a month",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/space-station-returns-to-a-full-crew-complement-after-a-month/",
          "published_at": "Sun, 15 Feb 2026 21:11:54 +0000",
          "title": "Space Station returns to a full crew complement after a month",
          "standfirst": "\"It's only possible because of the incredibly talented workforce we have.\"",
          "content": "A Crew Dragon spacecraft docked with the International Space Station on Valentine's Day, and astronauts popped open the hatches at 5:14 pm ET (22:14 UTC) on Saturday evening. The arrival of four new astronauts as part of the Crew 12 mission—Jessica Meir and Jack Hathaway of NASA, Sophie Adenot of the European Space Agency, and Andrey Fedyaev of Roscosmos—brought the total number of crew on board the space station to seven, giving the US space agency a full complement in orbit. The number of astronauts living on board the station fluctuates over time, depending on crew rotations and private astronauts making shorter stays, but since Crew Dragon began flying regularly at the end of 2020 NASA has sought to keep at least four \"USOS\" astronauts on board at all time. This stands for \"US Orbital Segment,\" and means astronauts from the United States, Canada, Europe, and Japan who are trained to operate the areas of the station maintained by NASA and its partner astronauts.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/crew-12-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/crew-12-1152x648.jpg",
      "popularity_score": 346.6097608333333
    },
    {
      "id": "cluster_51",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 20:14:16 +0000",
      "title": "Ancient Mars was warm and wet, not cold and icy",
      "neutral_headline": "Ancient Mars was warm and wet, not cold and icy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/ancient-mars-was-warm-and-wet-not-cold-and-icy/",
          "published_at": "Sun, 15 Feb 2026 20:14:16 +0000",
          "title": "Ancient Mars was warm and wet, not cold and icy",
          "standfirst": "Kaolinite pebbles show evidence of alteration under high rainfall conditions.",
          "content": "A recent study showed that Mars was warm and wet billions of years ago. The finding contrasts with another theory that this era was mainly cold and icy. The result has implications for the idea that life could have developed on the planet at this time. Whether Mars was once habitable is a fascinating and intensely researched topic of interest over many decades. Mars, like the Earth, is about 4.5 billion years old and its geological history is divided into different epochs of time. The latest paper relates to Mars during a time called the Noachian epoch, which extended from about 4.1 to 3.7 billion years ago. This was during a stage in solar system history called the Late Heavy Bombardment (LHB). Evidence for truly cataclysmic meteorite impacts during the LHB are found on many bodies throughout the solar system.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/marssurface-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/marssurface-1152x648.jpg",
      "popularity_score": 332.64920527777775
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 18:09:09 +0000",
      "title": "Editor’s Note: Retraction of article containing fabricated quotations",
      "neutral_headline": "Editor’s Note: Retraction of article containing fabricated quotations",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/staff/2026/02/editors-note-retraction-of-article-containing-fabricated-quotations/",
          "published_at": "Sun, 15 Feb 2026 18:09:09 +0000",
          "title": "Editor’s Note: Retraction of article containing fabricated quotations",
          "standfirst": "We are reinforcing our editorial standards following this incident.",
          "content": "On Friday afternoon, Ars Technica published an article containing fabricated quotations generated by an AI tool and attributed to a source who did not say them. That is a serious failure of our standards. Direct quotations must always reflect what a source actually said. That this happened at Ars is especially distressing. We have covered the risks of overreliance on AI tools for years, and our written policy reflects those concerns. In this case, fabricated quotations were published in a manner inconsistent with that policy. We have reviewed recent work and have not identified additional issues. At this time, this appears to be an isolated incident. Ars Technica does not permit the publication of AI-generated material unless it is clearly labeled and presented for demonstration purposes. That rule is not optional, and it was not followed here.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/ars-logo-dark-background-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/ars-logo-dark-background-1152x648.jpg",
      "popularity_score": 330.5639275
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Sun, 15 Feb 2026 17:20:12 +0000",
      "title": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
      "neutral_headline": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/it-aint-no-unicorn-these-researchers-have-interviewed-130-bigfoot-hunters/",
          "published_at": "Sun, 15 Feb 2026 17:20:12 +0000",
          "title": "\"It ain't no unicorn\": These researchers have interviewed 130 Bigfoot hunters",
          "standfirst": "What prompts this community to spend time looking for a creature that likely doesn't exist?",
          "content": "It was the image that launched a cultural icon. In 1967, in the Northern California woods, a 7-foot-tall, ape-like creature covered in black fur and walking upright was captured on camera, at one point turning around to look straight down the lens. The image is endlessly copied in popular culture—it’s even become an emoji. But what was it? A hoax? A bear? Or a real-life example of a mysterious species called the Bigfoot? The film has been analysed and re-analysed countless times. Although most people believe it was some sort of hoax, there are some who argue that it’s never been definitively debunked. One group of people, dubbed Bigfooters, is so intrigued that they have taken to the forests of Washington, California, Oregon, Ohio, Florida, and beyond to look for evidence of the mythical creature. But why? That’s what sociologists Jamie Lewis and Andrew Bartlett wanted to uncover. They were itching to understand what prompts this community to spend valuable time and resources looking for a beast that is highly unlikely to even exist. During lockdown, Lewis started interviewing more than 130 Bigfooters (and a few academics) about their views, experiences, and practices, culminating in the duo’s recent book \"Bigfooters and Scientific Inquiry: On the Borderlands of Legitimate Science.\"Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/bigfoot-1.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/bigfoot-1.jpg",
      "popularity_score": 319.74809416666665
    },
    {
      "id": "cluster_89",
      "coverage": 1,
      "updated_at": "Sat, 14 Feb 2026 21:02:47 +0000",
      "title": "NASA has a new problem to fix before the next Artemis II countdown test",
      "neutral_headline": "NASA has a new problem to fix before the next Artemis II countdown test",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/nasa-chief-vows-to-solve-sls-rocket-fueling-issues-before-artemis-iii/",
          "published_at": "Sat, 14 Feb 2026 21:02:47 +0000",
          "title": "NASA has a new problem to fix before the next Artemis II countdown test",
          "standfirst": "\"We observed materially lower leak rates compared to prior observations during WDR-1.\"",
          "content": "NASA Administrator Jared Isaacman said Saturday the agency is looking at ways to prevent the fueling problems plaguing the Space Launch System rocket before the Artemis III mission. Artemis III is slated to be the first crew mission to land on the Moon since the Apollo program more than 50 years ago. As for Artemis II, which remains on the launch pad at Kennedy Space Center in Florida after missing a launch window earlier this month, NASA is preparing for a second countdown rehearsal as soon as next week to confirm whether technicians have resolved a hydrogen fuel leak that cut short a practice countdown run February 2. Artemis II is the first crew flight for SLS rocket and Orion spacecraft. The nearly 10-day mission will carry four astronauts around the far side of the Moon and return them to Earth.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2249116473-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2249116473-1152x648.jpg",
      "popularity_score": 298
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Sat, 14 Feb 2026 18:33:36 +0000",
      "title": "A Valentine's Day homage to Crouching Tiger, Hidden Dragon",
      "neutral_headline": "A Valentine's Day homage to Crouching Tiger, Hidden Dragon",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/02/a-valentines-day-homage-to-crouching-tiger-hidden-dragon/",
          "published_at": "Sat, 14 Feb 2026 18:33:36 +0000",
          "title": "A Valentine's Day homage to Crouching Tiger, Hidden Dragon",
          "standfirst": "Ang Lee's gorgeous 2000 masterpiece has awe-inspiring martial arts stunts and a tragic love story for the ages.",
          "content": "It's Valentine's Day, and while there are plenty of classic and current rom-coms out there for those wishing to immerse themselves in warm and fuzzy feelings, we're opting to celebrate in a different way: honoring Ang Lee's 2000 masterpiece Crouching Tiger, Hidden Dragon, a wuxia tragic fairy tale featuring one of the most beautifully heartbreaking love stories in film at its center. It's also got stunning cinematography and tons of awe-inspiring martial arts sequences, which makes it my personal perfect date night movie. (Spoilers below, but we will give you a heads up before the major reveals.) The film is adapted from a 1940s novel by Wang Dulu and is set sometime during the Qing dynasty, which lasted from 1644 through 1912. (No specific date is given.) The title is a direct translation of a line from a 6th century Chinese poem: \"behind the rock in the dark probably hides a tiger, and the coiling giant root resembles a crouching dragon.\" It's generally interpreted as a description of legendary martial arts masters living un-noticed and/or hiding in plain sight—until someone picks a fight, that is. And some of those hidden masters are women.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/crouch1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/crouch1-1152x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_103",
      "coverage": 1,
      "updated_at": "Sat, 14 Feb 2026 11:45:48 +0000",
      "title": "Astronomers are filling in the blanks of the Kuiper Belt",
      "neutral_headline": "Astronomers are filling in the blanks of the Kuiper Belt",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/astronomers-are-filling-in-the-blanks-of-the-kuiper-belt/",
          "published_at": "Sat, 14 Feb 2026 11:45:48 +0000",
          "title": "Astronomers are filling in the blanks of the Kuiper Belt",
          "standfirst": "Next-generation telescopes are mapping this outer frontier.",
          "content": "Out beyond the orbit of Neptune lies an expansive ring of ancient relics, dynamical enigmas, and possibly a hidden planet—or two. The Kuiper Belt, a region of frozen debris about 30 to 50 times farther from the sun than the Earth is—and perhaps farther, though nobody knows—has been shrouded in mystery since it first came into view in the 1990s. Over the past 30 years, astronomers have cataloged about 4,000 Kuiper Belt objects (KBOs), including a smattering of dwarf worlds, icy comets, and leftover planet parts. But that number is expected to increase tenfold in the coming years as observations from more advanced telescopes pour in. In particular, the Vera C. Rubin Observatory in Chile will illuminate this murky region with its flagship project, the Legacy Survey of Space and Time (LSST), which began operating last year. Other next-generation observatories, such as the James Webb Space Telescope (JWST), will also help to bring the belt into focus.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/kuiper-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/kuiper-1152x648.jpg",
      "popularity_score": 273
    }
  ]
}