{
  "updated_at": "2025-12-19T11:13:22.664Z",
  "clusters": [
    {
      "id": "cluster_33",
      "coverage": 2,
      "updated_at": "Fri, 19 Dec 2025 01:23:13 GMT",
      "title": "TikTok signs Trump-backed deal to sell US entity to American investors",
      "neutral_headline": "TikTok signs Trump-backed deal to sell US entity to American investors",
      "bullet_summary": [
        "The TikTok chief executive officer, Shou Zi Chew, said in the memo that ByteDance and TikTok have signed binding agreements with the three investors",
        "Reported by Guardian Tech, TechMeme"
      ],
      "items": [
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2025/dec/18/tiktok-signs-deal-us-entity-sale",
          "published_at": "Fri, 19 Dec 2025 01:23:13 GMT",
          "title": "TikTok signs Trump-backed deal to sell US entity to American investors",
          "standfirst": "Deal will allow app to continue operating in US as Elizabeth Warren condemns Trump and his ‘billionaire buddies’TikTok has signed a deal to sell its US business to three American investors – Oracle, Silver Lake and MGX – ensuring the popular social video platform can continue operating in the United States.The deal is expected to close on 22 January, according to an internal memo seen by he Associated Press and Reuters. The TikTok chief executive officer, Shou Zi Chew, said in the memo that ByteDance and TikTok have signed binding agreements with the three investors. Continue reading...",
          "content": "Deal will allow app to continue operating in US as Elizabeth Warren condemns Trump and his ‘billionaire buddies’TikTok has signed a deal to sell its US business to three American investors – Oracle, Silver Lake and MGX – ensuring the popular social video platform can continue operating in the United States.The deal is expected to close on 22 January, according to an internal memo seen by he Associated Press and Reuters. The TikTok chief executive officer, Shou Zi Chew, said in the memo that ByteDance and TikTok have signed binding agreements with the three investors. Continue reading...",
          "feed_position": 3
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/251218/p48#a251218p48",
          "published_at": "Thu, 18 Dec 2025 17:30:00 -0500",
          "title": "Internal memo: TikTok has signed a deal to sell its US unit; Oracle, Silver Lake, MGX will collectively own 45% of the US entity, and ByteDance will retain ~20% (Sara Fischer/Axios)",
          "standfirst": "Sara Fischer / Axios: Internal memo: TikTok has signed a deal to sell its US unit; Oracle, Silver Lake, MGX will collectively own 45% of the US entity, and ByteDance will retain ~20% &mdash; TikTok has signed a deal to divest its U.S. entity to a joint venture controlled by American investors, per an internal memo seen by Axios.",
          "content": "Sara Fischer / Axios: Internal memo: TikTok has signed a deal to sell its US unit; Oracle, Silver Lake, MGX will collectively own 45% of the US entity, and ByteDance will retain ~20% &mdash; TikTok has signed a deal to divest its U.S. entity to a joint venture controlled by American investors, per an internal memo seen by Axios.",
          "feed_position": 14,
          "image_url": "http://www.techmeme.com/251218/i48.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/251218/i48.jpg",
      "popularity_score": 2010.1639822222223
    },
    {
      "id": "cluster_21",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 03:18:51 +0000",
      "title": "These are the flying discs the government wants you to know about",
      "neutral_headline": "These are the flying discs the government wants you to know about",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/heres-why-nasa-and-the-space-force-are-interested-in-pizza-shaped-satellites/",
          "published_at": "Fri, 19 Dec 2025 03:18:51 +0000",
          "title": "These are the flying discs the government wants you to know about",
          "standfirst": "DiskSat's design offers \"a power-to-weight ratio unmatched by traditional aluminum satellites.\"",
          "content": "Four small satellites rode a Rocket Lab Electron launch vehicle into orbit from Virginia early Thursday, beginning a government-funded technology demonstration mission to test the performance of a new spacecraft design. The satellites were nestled inside a cylindrical dispenser on top of the 59-foot-tall (18-meter) Electron rocket when it lifted off from NASA’s Wallops Flight Facility at 12:03 am EST (05:03 UTC). A little more than an hour later, the rocket’s upper stage released the satellites one at a time at an altitude of about 340 miles (550 kilometers). The launch was the starting gun for a “proof of concept” mission to test the viability of a new kind of satellite called DiskSats. These satellites were designed by the Aerospace Corporation, a nonprofit federally funded research and development center. The project is jointly financed by NASA and the US Space Force, which paid for DiskSat’s development and launch, respectively.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/disksat-deploying-101-1152x648-1766112150.webp"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/disksat-deploying-101-1152x648-1766112150.webp",
      "popularity_score": 345.09120444444443
    },
    {
      "id": "cluster_39",
      "coverage": 1,
      "updated_at": "Fri, 19 Dec 2025 00:00:36 +0000",
      "title": "Parasites plagued Roman soldiers at Hadrian’s Wall",
      "neutral_headline": "Parasites plagued Roman soldiers at Hadrian’s Wall",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/study-roman-soldiers-battled-parasites-at-hadrians-wall/",
          "published_at": "Fri, 19 Dec 2025 00:00:36 +0000",
          "title": "Parasites plagued Roman soldiers at Hadrian’s Wall",
          "standfirst": "They were infected by roundworm, whipworm, and microscopic protozoans called Giardia duodenalis.",
          "content": "It probably sucked to be a Roman soldier guarding Hadrian’s Wall circa the third century CE. W.H. Auden imagined the likely harsh conditions in his poem “Roman Wall Blues,” in which a soldier laments enduring wet wind and rain with “lice in my tunic and a cold in my nose.” We can now add chronic nausea and bouts of diarrhea to his list of likely woes, thanks to parasitic infections, according to a new paper published in the journal Parasitology. As previously reported, archaeologists can learn a great deal by studying the remains of intestinal parasites in ancient feces. For instance, in 2022, we reported on an analysis of soil samples collected from a stone toilet found within the ruins of a swanky 7th-century BCE villa just outside Jerusalem. That analysis revealed the presence of parasitic eggs from four different species: whipworm, beef/pork tapeworm, roundworm, and pinworm. (It’s the earliest record of roundworm and pinworm in ancient Israel.) Later that same year, researchers from the University of Cambridge and the University of British Columbia analyzed the residue on an ancient Roman ceramic pot excavated at the site of a 5th-century CE Roman villa at Gerace, a rural district in Sicily. They identified the eggs of intestinal parasitic worms commonly found in feces—strong evidence that the 1,500-year-old pot in question was most likely used as a chamber pot.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hadrian1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hadrian1-1152x648.jpg",
      "popularity_score": 328.78703777777775
    },
    {
      "id": "cluster_49",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 22:39:54 +0000",
      "title": "YouTube bans two popular channels that created fake AI movie trailers",
      "neutral_headline": "YouTube bans two popular channels that created fake AI movie trailers",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2025/12/youtube-bans-two-popular-channels-that-created-fake-ai-movie-trailers/",
          "published_at": "Thu, 18 Dec 2025 22:39:54 +0000",
          "title": "YouTube bans two popular channels that created fake AI movie trailers",
          "standfirst": "Google loves AI content, except when it doesn't.",
          "content": "Google is generally happy to see people using generative AI tools to create content, and it’s doubly happy when they publish it on its platforms. But there are limits to everything. Two YouTube channels that attracted millions of subscribers with AI-generated movie trailers have been shuttered. Screen Culture and KH Studio flooded the site with fake but often believable trailers. The channels, which had a combined audience of more than 2 million subscribers, became a thorn in Google’s side in early 2025 when other YouTubers began griping about their sudden popularity in the age of AI. The channels produced videos with titles like “GTA: San Andreas (2025) Teaser Trailer” and “Malcom In The Middle Reboot (2025) First Trailer.” Of course, neither of those projects exist, but that didn’t stop them from appearing in user feeds. Google demonetized the channels in early 2025, forcing them to adopt language that made it clear they were not official trailers. The channels were able to monetize again, but the disclaimers were not consistently used. Indeed, many of the most popular videos from those channels in recent months included no “parody” or “concept trailer” disclosures. Now, visiting either channel’s page on YouTube produces an error reading, “This page isn’t available. Sorry about that. Try searching for something else.”Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/youtube-logo-1152x648-1740156964.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/youtube-logo-1152x648-1740156964.jpg",
      "popularity_score": 325.4420377777778
    },
    {
      "id": "cluster_45",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 23:05:42 +0000",
      "title": "Trump commits to Moon landing by 2028, followed by a lunar outpost two years later",
      "neutral_headline": "Trump commits to Moon landing by 2028, followed by a lunar outpost two years later",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/trump-commits-to-moon-landing-by-2028-followed-by-a-lunar-outpost-two-years-later/",
          "published_at": "Thu, 18 Dec 2025 23:05:42 +0000",
          "title": "Trump commits to Moon landing by 2028, followed by a lunar outpost two years later",
          "standfirst": "Also, the Trump administration wants to put some nuclear power reactors there, too.",
          "content": "A couple of hours after a judge formally swore in private astronaut Jared Isaacman as the next administrator of NASA on Thursday, President Donald Trump signed an executive order outlining his space policy objectives for the next three years. The executive order, titled “Ensuring American Space Superiority,” states that the country must “pursue a space policy that will extend the reach of human discovery, secure the nation’s vital economic and security interests, unleash commercial development, and lay the foundation for a new space age.” White House sets priorities There is nothing Earth-shattering in the new executive order, as much of it builds on previously announced policies that span multiple administrations. There are some notable points in the document that clearly reflect the White House’s priorities, though, and Isaacman’s leadership of NASA.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/54992620409_811a1c4713_c-800x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/54992620409_811a1c4713_c-800x648.jpg",
      "popularity_score": 320.8720377777778
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 22:18:21 +0000",
      "title": "Peacock showing ads upon launch opens the door for more disruptive streaming ads",
      "neutral_headline": "Peacock showing ads upon launch opens the door for more disruptive streaming ads",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/peacock-showing-ads-upon-launch-opens-the-door-for-more-disruptive-streaming-ads/",
          "published_at": "Thu, 18 Dec 2025 22:18:21 +0000",
          "title": "Peacock showing ads upon launch opens the door for more disruptive streaming ads",
          "standfirst": "Subscribers will start seeing ads when selecting a user next year.",
          "content": "Peacock subscribers will see ads immediately upon opening the streaming app or website next year. It’s a bold new strategy for attracting advertisers—something that’s been increasingly important to subscription-based streaming services—but it also risks alienating viewers As reported by Variety, the new type of ads will display on the profile selection page that shows when a subscriber launches Peacock. Starting next year, instead of the profile page just showing your different Peacock profiles, most of the page will be dominated by an advertorial image. The circles of NBCUniversal-owned characters selected for user profiles will be relegated to a vertical column on the screen’s left side, as you can see here. To avoid seeing what NBCUniversal is calling “Arrival Ads” every time you open Peacock, you need to subscribe to Peacock’s most expensive plan, which is ad-free and starts at $17 per month (Peacock’s ad-based plans start at $8/month.)Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/All-Her-Fault.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/All-Her-Fault.jpg",
      "popularity_score": 300.0828711111111
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 21:04:35 +0000",
      "title": "School security AI flagged clarinet as a gun. Exec says it wasn’t an error.",
      "neutral_headline": "School security AI flagged clarinet as a gun. Exec says it wasn’t an error.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/florida-schools-plan-to-vastly-expand-use-of-ai-that-mistook-clarinet-for-gun/",
          "published_at": "Thu, 18 Dec 2025 21:04:35 +0000",
          "title": "School security AI flagged clarinet as a gun. Exec says it wasn’t an error.",
          "standfirst": "Human review didn't stop AI from triggering lockdown at panicked middle school.",
          "content": "A Florida middle school was locked down last week after an AI security system called ZeroEyes mistook a clarinet for a gun, reviving criticism that AI may not be worth the high price schools pay for peace of mind. Human review of the AI-generated false flag did not stop police from rushing to Lawton Chiles Middle School. Cops expected to find “a man in the building, dressed in camouflage with a ‘suspected weapon pointed down the hallway, being held in the position of a shouldered rifle,'” a Washington Post review of the police report said. Instead, after finding no evidence of a shooter, cops double-checked with dispatchers who confirmed that a closer look at the images indicated that “the suspected rifle might have been a band instrument.” Among panicked students hiding in the band room, police eventually found the suspect, a student “dressed as a military character from the Christmas movie Red One for the school’s Christmas-themed dress-up day,” the Post reported.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1369829454-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1369829454-1152x648.jpg",
      "popularity_score": 293.8534266666667
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 21:35:58 +0000",
      "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "neutral_headline": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/reminder-donate-to-win-swag-in-our-annual-charity-drive-sweepstakes-18/",
          "published_at": "Thu, 18 Dec 2025 21:35:58 +0000",
          "title": "Reminder: Donate to win swag in our annual Charity Drive sweepstakes",
          "standfirst": "Help increase our charity haul of nearly $18,000 in just over a week.",
          "content": "If you’ve been too busy planning for Half-Life 3 to take part in this year’s Ars Technica Charity Drive sweepstakes, don’t worry. You still have time to donate to a good cause and get a chance to win your share of over $4,000 worth of swag (no purchase necessary to win). In the first week or so of the drive, over 300 readers have contributed nearly $18,000 to either the Electronic Frontier Foundation or Child’s Play as part of the charity drive (Child’s Play has a roughly 55/45 donation lead at the moment). That’s still a long way from 2020’s record haul of over $58,000, but there’s plenty of time until the Charity Drive wraps up on Friday, January 2, 2026. That doesn’t mean you should put your donation off, though. Do yourself and the charities involved a favor and give now while you’re thinking about it.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/charitydrive2025-1152x648.jpg",
      "popularity_score": 289.3764822222222
    },
    {
      "id": "cluster_59",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 21:31:03 +0000",
      "title": "RAM and SSD prices are still climbing—here’s our best advice for PC builders",
      "neutral_headline": "RAM and SSD prices are still climbing—here’s our best advice for PC builders",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/for-just-a-couple-of-months-in-the-middle-of-2025-it-was-an-ok-time-to-build-a-pc/",
          "published_at": "Thu, 18 Dec 2025 21:31:03 +0000",
          "title": "RAM and SSD prices are still climbing—here’s our best advice for PC builders",
          "standfirst": "I would avoid building a PC right now, but if you can't, here's our best advice.",
          "content": "The first few months of 2025 were full of graphics card reviews where we generally came away impressed with performance and completely at a loss on availability and pricing. The testing in these reviews is useful regardless, but when it came to extra buying advice, the best we could do was to compare Nvidia’s imaginary pricing to AMD’s imaginary pricing and wait for availability to improve. Now, as the year winds down, we’re facing price spikes for memory and storage that are unlike anything I’ve seen in two decades of pricing out PC parts. Pricing for most RAM kits has increased dramatically since this summer, driven by overwhelming demand for these parts in AI data centers. Depending on what you’re building, it’s now very possible that the memory could be the single most expensive component you buy; things are even worse now than they were the last time we compared prices a few weeks ago. Component Aug. 2025 price Nov. 2025 price Dec. 2025 price Patriot Viper Venom 16GB (2 x 8GB) DDR-6000 $49 $110 $189 Western Digital WD Blue SN5000 500GB $45 $69 $102* Silicon Power 16GB (2 x 8GB) DDR4-3200 $34 $89 $104 Western Digital WD Blue SN5000 1TB $64 $111 $135* Team T-Force Vulcan 32GB DDR5-6000 $82 $310 $341 Western Digital WD Blue SN5000 2TB $115 $154 $190* Western Digital WD Black SN7100 2TB $130 $175 $210 Team Delta RGB 64GB (2 x 32GB) DDR5-6400 $190 $700 $800 Some SSDs are getting to the point where they’re twice as expensive as they were this summer (for this comparison, I’ve swapped the newer WD Blue SN5100 pricing in for the SN5000, since the drive is both newer and slightly cheaper as of this writing). Some RAM kits, meanwhile, are around four times as expensive as they were in August. Yeesh.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_3087-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_3087-1152x648.jpeg",
      "popularity_score": 279.2945377777778
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 20:54:36 +0000",
      "title": "LLMs’ impact on science: Booming publications, stagnating quality",
      "neutral_headline": "LLMs’ impact on science: Booming publications, stagnating quality",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/llms-impact-on-science-booming-publications-stagnating-quality/",
          "published_at": "Thu, 18 Dec 2025 20:54:36 +0000",
          "title": "LLMs’ impact on science: Booming publications, stagnating quality",
          "standfirst": "Once researchers turn to LLMs, paper counts go up, quality does not.",
          "content": "There have been a number of high-profile cases where scientific papers have had to be retracted because they were filled with AI-generated slop—the most recent coming just two weeks ago. These instances raise serious questions about the quality of peer review in some journals—how could anyone let a figure with terms like “runctitional,” “fexcectorn,” and “frymblal” through, especially given the ‘m’ in frymblal has an extra hump? But it has not been clear whether these high-profile examples are representative. How significantly has AI use been influencing the scientific literature? A collaboration of researchers at Berkeley and Cornell have decided to take a look. They’ve scanned three of the largest archives of pre-publication papers and identified ones that are likely to have been produced using Large Language Models. And they found that, while researchers produce far more papers after starting to use AI and the quality of the language used went up, the publication rate of these papers has dropped. Searching the archives The researchers began by obtaining the abstracts of everything placed in three major pre-publication archives between 2018 and mid-2024. At the arXiv, this netted them 1.2 million documents; another 675,000 were found in the Social Science Research Network; and bioRxiv provided another 220,000. So, this was both a lot of material to work with and covered a lot of different fields of research. It also included documents that were submitted before Large Language Models were likely to be able to produce output that would be deemed acceptable.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-839904424-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-839904424-1152x648.jpg",
      "popularity_score": 258.6870377777778
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 19:27:24 +0000",
      "title": "Neural DSP models John Mayer’s entire amp and effects rig—and it sounds great",
      "neutral_headline": "Neural DSP models John Mayer’s entire amp and effects rig—and it sounds great",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/neuraldsp-models-john-mayers-entire-amp-and-effects-rig-and-it-sounds-great/",
          "published_at": "Thu, 18 Dec 2025 19:27:24 +0000",
          "title": "Neural DSP models John Mayer’s entire amp and effects rig—and it sounds great",
          "standfirst": "Mayer gets the \"Archetype\" treatment.",
          "content": "Guitarists today are spoiled for choice, and that goes doubly true for players who use computer-based amp modeling software. I’m one such player, and I don’t miss the size, weight, deafening volume, or cost of owning an amp and cabinet collection, to say nothing of all those pedals and cables. For clean to mid-gain tones alone, I already have more terrific options than I need, including Neural DSP’s Tone King and Cory Wong and Mateus Asato, Polychrome DSP’s Lumos, and Universal Audio’s new Paradise Guitar Studio. All work slightly differently, but they can each output record-ready tones that are really, really close to the (often incredibly expensive) hardware that they model, and they each give you plenty of great-sounding presets to start from. So do we really need one amp sim package? Neural DSP thinks we do, because the Finnish company just dropped a major new release yesterday called Archetype: John Mayer X. It doesn’t model Mayer’s type of gear but his actual hardware units, along with all the actual settings he uses in the studio and on stage. It even has some presets that he designed. Which is great if you want to sound like John Mayer—but what does the software offer for those of us not trying to cover Continuum?Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/intro-1152x648-1766079143.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/intro-1152x648-1766079143.jpg",
      "popularity_score": 247.23370444444444
    },
    {
      "id": "cluster_84",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 18:12:18 +0000",
      "title": "NASA will soon find out if the Perseverance rover can really persevere on Mars",
      "neutral_headline": "NASA will soon find out if the Perseverance rover can really persevere on Mars",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/nasa-will-soon-find-out-if-the-perseverance-rover-can-really-persevere-on-mars/",
          "published_at": "Thu, 18 Dec 2025 18:12:18 +0000",
          "title": "NASA will soon find out if the Perseverance rover can really persevere on Mars",
          "standfirst": "Engineers at JPL are certifying the Perseverance rover to drive up to 100 kilometers.",
          "content": "When the Perseverance rover arrived on Mars nearly five years ago, NASA officials thought the next American lander to take aim on the red planet would be taking shape by now. At the time, the leaders of the space agency expected this next lander could be ready for launch as soon as 2026—or more likely in 2028. Its mission would have been to retrieve Martian rock specimens collected by the Perseverance rover, then billed as the first leg of a multilaunch, multibillion-dollar Mars Sample Return campaign. Here we are on the verge of 2026, and there’s no sample retrieval mission nearing the launch pad. In fact, no one is building such a lander at all. NASA’s strategy for a Mars Sample Return, or MSR, mission remains undecided after the projected cost of the original plan ballooned to $11 billion. If MSR happens at all, it’s now unlikely to launch until the 2030s.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/1282-1152x648-1766078573.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/1282-1152x648-1766078573.jpg",
      "popularity_score": 149.98203777777778
    },
    {
      "id": "cluster_130",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 22:22:33 +0000",
      "title": "OpenAI’s new ChatGPT image generator makes faking photos easy",
      "neutral_headline": "OpenAI’s new ChatGPT image generator makes faking photos easy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/openais-new-chatgpt-image-generator-makes-faking-photos-easy/",
          "published_at": "Wed, 17 Dec 2025 22:22:33 +0000",
          "title": "OpenAI’s new ChatGPT image generator makes faking photos easy",
          "standfirst": "New GPT Image 1.5 allows more detailed conversational image editing, for better or worse.",
          "content": "For most of photography’s roughly 200-year history, altering a photo convincingly required either a darkroom, some Photoshop expertise, or, at minimum, a steady hand with scissors and glue. On Tuesday, OpenAI released a tool that reduces the process to typing a sentence. It’s not the first company to do so. While OpenAI had a conversational image-editing model in the works since GPT-4o in 2024, Google beat OpenAI to market in March with a public prototype, then refined it to a popular model called Nano Banana image model (and Nano Banana Pro). The enthusiastic response to Google’s image-editing model in the AI community got OpenAI’s attention. OpenAI’s new GPT Image 1.5 is an AI image synthesis model that reportedly generates images up to four times faster than its predecessor and costs about 20 percent less through the API. The model rolled out to all ChatGPT users on Tuesday and represents another step toward making photorealistic image manipulation a casual process that requires no particular visual skills.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/barbarian_crt_1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/barbarian_crt_1-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_134",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 20:56:32 +0000",
      "title": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
      "neutral_headline": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/man-sues-cops-who-jailed-him-for-37-days-for-trolling-a-charlie-kirk-vigil/",
          "published_at": "Wed, 17 Dec 2025 20:56:32 +0000",
          "title": "Man sues cops who jailed him for 37 days for trolling a Charlie Kirk vigil",
          "standfirst": "Cops may be fined for jailing a man over his Facebook posts.",
          "content": "Larry Bushart, a man who was jailed for 37 days for reposting a Trump meme, has now sued the cops who allegedly schemed to keep him imprisoned for as long as possible simply because they disagreed with his point of view. Bushart is a former cop who lost his post-retirement job after a seemingly vengeful sheriff jailed him for trolling a Charlie Kirk vigil post in a Facebook group. Upset that Kirk’s death commanded more attention than other victims of gun violence, Bushart posted a string of memes, among which was an image of Trump with an actual quote saying “We have to get over it” about a 2024 school shooting. Perry County sheriff Nick Weems has since acknowledged that he “knew” that the meme referenced a prior school shooting. However, the entire time that Bushart was detained, Weems maintained that Bushart’s post incited “mass hysteria” from parents concerned that he was threatening violence at a local high school. Painting Bushart as indifferent to the supposed hysteria, Weems justified his arrest, as well as the $2 million bond ensuring Bushart couldn’t afford bail and remained behind bars.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Larry-Bushart-via-FIRE.jpg.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Larry-Bushart-via-FIRE.jpg.jpeg",
      "popularity_score": 148
    },
    {
      "id": "cluster_135",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 20:46:39 +0000",
      "title": "FCC chair scrubs website after learning it called FCC an “independent agency”",
      "neutral_headline": "FCC chair scrubs website after learning it called FCC an “independent agency”",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/fcc-deletes-independent-agency-from-website-as-carr-defends-allegiance-to-trump/",
          "published_at": "Wed, 17 Dec 2025 20:46:39 +0000",
          "title": "FCC chair scrubs website after learning it called FCC an “independent agency”",
          "standfirst": "Meanwhile, Ted Cruz wants to restrict FCC's power to intimidate broadcasters.",
          "content": "Federal Communications Commission Chairman Brendan Carr today faced blistering criticism in a Senate hearing for his September threats to revoke ABC station licenses over comments made by Jimmy Kimmel. While Democrats provided nearly all the criticism, Sen. Ted Cruz (R-Texas) said that Congress should act to restrict the FCC’s power to intimidate news broadcasters. As an immediate result of today’s hearing, the FCC removed a statement from its website that said it is an independent agency. Carr, who has embraced President Trump’s declaration that independent agencies may no longer operate independently from the White House, apparently didn’t realize that the website still called the FCC an independent agency. “Yes or no, is the FCC an independent agency?” Sen. Ben Ray Luján (D-N.M.) asked. Carr answered that the FCC is not independent, prompting Luján to point to a statement on the FCC website calling the FCC “an independent US government agency overseen by Congress.”Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/brendan-carr-hearing-1152x648-1766003281.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/brendan-carr-hearing-1152x648-1766003281.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 12:00:22 +0000",
      "title": "The inside story of SpaceX’s historic rocket landing that changed launch forever",
      "neutral_headline": "The inside story of SpaceX’s historic rocket landing that changed launch forever",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/ten-years-ago-spacex-turned-tragedy-into-triumph-with-a-historic-rocket-landing/",
          "published_at": "Thu, 18 Dec 2025 12:00:22 +0000",
          "title": "The inside story of SpaceX’s historic rocket landing that changed launch forever",
          "standfirst": "\"It's hard to describe how epic this comeback was after our first Falcon 9 launch failure.\"",
          "content": "On Dec. 21, 2015, SpaceX launched the Orbcomm-2 mission on an upgraded version of its Falcon 9 rocket. That night, just days before Christmas, the company successfully landed the first stage for the first time. The story behind this remarkable achievement is nowhere more fully told than in the book Reentry, authored by Ars Technica Senior Space Editor Eric Berger and published in 2024. To mark the tenth anniversary, Ars is reprinting a slightly condensed chapter from the book that tells the inside story of this landing. The chapter begins in June 2015 with a tragedy, the disintegration of a Falcon 9 rocket carrying the CRS-7 cargo supply mission for NASA. It was the first time a Falcon 9 had been lost in flight. Seconds after the Dragon-bearing Falcon 9 rocket broke apart over the Atlantic Ocean, David Giger shouted into his headset, “Dragon is alive!” In the decade since he joined the company straight out of graduate school, Giger had taken on management of the entire Dragon program, reporting directly to Elon Musk. He watched the CRS-7 launch from mission control in Hawthorne not with a particular role, but rather providing a leadership presence. Giger could sense the Dragon mission team, mostly younger engineers, freeze up as video showed debris from the rocket showering back to Earth. A lot of the people involved in the hairy early flights of Dragon, including the C2 mission in 2012, had moved on to other positions at SpaceX or departed.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/23802552292_6407c7a06f_k-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/23802552292_6407c7a06f_k-1152x648.jpg",
      "popularity_score": 147
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 17:55:22 +0000",
      "title": "For the lazy techie: These are Ars staff’s last-minute holiday gift picks",
      "neutral_headline": "For the lazy techie: These are Ars staff’s last-minute holiday gift picks",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/shopping/2025/12/for-the-lazy-techie-these-are-ars-staffs-last-minute-holiday-gift-picks/",
          "published_at": "Thu, 18 Dec 2025 17:55:22 +0000",
          "title": "For the lazy techie: These are Ars staff’s last-minute holiday gift picks",
          "standfirst": "Two wireless mice, two external hard drives, and a partridge in a pear tree.",
          "content": "The holidays have snuck up on us. How is it already that time? If you’re on top of things and have already bought all your Christmas gifts, I commend you. Not all of us are so conscientious. In fact, one of us is so behind on holiday prep that he is not only running late on buying gifts; he’s also behind on publishing the Ars staff gift guide he said he’d write. (Whoever could we be talking about?) So for my fellow last-minute scramblers, I polled Ars writers and editors for gift ideas they know will be solid because they’ve actually used them. As such, you’ll find gift options below that Ars staffers have used enough to feel good about recommending. Further, I made sure all of these are available for delivery before Christmas as of today, at least where I live.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-gift-guide-2026-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/ars-gift-guide-2026-1152x648.jpg",
      "popularity_score": 135.69981555555555
    },
    {
      "id": "cluster_124",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 00:19:11 +0000",
      "title": "NASA finally—and we really do mean it this time—has a full-time leader",
      "neutral_headline": "NASA finally—and we really do mean it this time—has a full-time leader",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/nasa-finally-and-we-really-do-mean-it-this-time-has-a-full-time-leader/",
          "published_at": "Thu, 18 Dec 2025 00:19:11 +0000",
          "title": "NASA finally—and we really do mean it this time—has a full-time leader",
          "standfirst": "A long and winding road to reach NASA's headquarters in Washington, DC.",
          "content": "Jared Isaacman, a pilot and financial tech billionaire, has commanded two groundbreaking spaceflights, including leading the first private spacewalk. But his most remarkable flying has occurred over the last year. And on Wednesday, he stuck the landing by earning formal Senate approval to become NASA’s 15th administrator. With a final tally of 67 to 30, Wednesday’s Senate confirmation came 377 days after President Trump first nominated Isaacman to serve as NASA administrator. Since that time, Isaacman had to navigate the following issues:Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249116324-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2249116324-1024x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_101",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 14:46:33 +0000",
      "title": "Does swearing make you stronger? Science says yes.",
      "neutral_headline": "Does swearing make you stronger? Science says yes.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/does-swearing-make-you-stronger-science-says-yes/",
          "published_at": "Thu, 18 Dec 2025 14:46:33 +0000",
          "title": "Does swearing make you stronger? Science says yes.",
          "standfirst": "\"A calorie-neutral, drug-free, low-cost, readily available tool for when we need a boost in performance.”",
          "content": "If you’re human, you’ve probably hollered a curse word or two (or three) when barking your shin on a table edge or hitting your thumb with a hammer. Perhaps you’ve noticed that this seems to lessen your pain. There’s a growing body of scientific evidence that this is indeed the case. The technical term is the “hypoalgesic effect of swearing.” Cursing can also improve physical strength and endurance, according to a new paper published in the journal American Psychologist. As previously reported, co-author Richard Stephens, a psychologist at Keele, became interested in studying the potential benefits of profanity after noting his wife’s “unsavory language” while giving birth and wondered if profanity really could help alleviate pain. “Swearing is such a common response to pain. There has to be an underlying reason why we do it,” Stephens told Scientific American after publishing a 2009 study that was awarded the 2010 Ig Nobel Peace Prize. For that study, Stephens and his colleagues asked 67 study participants (college students) to immerse their hands in a bucket of ice water. They were then instructed to either swear repeatedly using the profanity of their choice or chant a neutral word. Lo and behold, the participants said they experienced less pain when they swore and were also able to leave their hands in the bucket about 40 seconds longer than when they weren’t swearing. It has been suggested that this is a primitive reflex that serves as a form of catharsis.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/screaming-f-bombs.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/screaming-f-bombs.jpg",
      "popularity_score": 130
    },
    {
      "id": "cluster_106",
      "coverage": 1,
      "updated_at": "Thu, 18 Dec 2025 13:52:45 +0000",
      "title": "Formula 1 is deploying new jargon for 2026",
      "neutral_headline": "Formula 1 is deploying new jargon for 2026",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/formula-1-is-deploying-new-jargon-for-2026/",
          "published_at": "Thu, 18 Dec 2025 13:52:45 +0000",
          "title": "Formula 1 is deploying new jargon for 2026",
          "standfirst": "Forget DRS, now it's all about corner mode, straight mode, and overtake mode.",
          "content": "While not quite a separate dialect, Formula 1-speak can be heavy on the jargon at times. They say “box” instead of pit, “power unit” to describe the engine and hybrid system, and that’s before we get into all the aerodynamics-related expressions like “outwash” and “dirty air.” Next year is a big technical shakeup for the sport, and it seems we’re getting some new terminology to go with it. So forget your DRS and get ready to talk about Boost mode instead. The F1 car of 2026 will be slightly narrower and slightly lighter than the machines that raced for the last time earlier this month. But not by a huge amount: minimum weight is decreased by 30 kg to 724 kg, the wheelbase is 200 mm shorter at 3,400 mm, and the car’s underfloor is 150 mm narrower than before. The front wing is 100 mm narrower and has just two elements to it, although for the first time in F1 history, this is now an active wing, which works in conjunction with the three-element active rear wing. Active rear wings have been a thing in F1 since the introduction of DRS—the drag reduction system—in 2011, but now there’s a philosophical change to how they’ll work.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026_Explainer_FIA_Front_3_4_1920x1080-2-1536x864-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/2026_Explainer_FIA_Front_3_4_1920x1080-2-1536x864-1-1152x648.jpg",
      "popularity_score": 130
    },
    {
      "id": "cluster_128",
      "coverage": 1,
      "updated_at": "Wed, 17 Dec 2025 22:46:21 +0000",
      "title": "Physicists 3D-printed a Christmas tree of ice",
      "neutral_headline": "Physicists 3D-printed a Christmas tree of ice",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/physicists-3d-printed-a-christmas-tree-of-ice/",
          "published_at": "Wed, 17 Dec 2025 22:46:21 +0000",
          "title": "Physicists 3D-printed a Christmas tree of ice",
          "standfirst": "New method uses no freezing technology or refrigeration equipment—just water and a vacuum.",
          "content": "Physicists at the University of Amsterdam came up with a really cool bit of Christmas decor: a miniature 3D-printed Christmas tree, a mere 8 centimeters tall, made of ice, without any refrigeration equipment or other freezing technology, and at minimal cost. The secret is evaporative cooling, according to a preprint posted to the physics arXiv. Evaporative cooling is a well-known phenomenon; mammals use it to regulate body temperature. You can see it in your morning cup of hot coffee: the hotter atoms rise to the top of the magnetic trap and “jump out” as steam. It also plays a role (along with shock wave dynamics and various other factors) in the formation of “wine tears.” It’s a key step in creating Bose-Einstein condensates. And evaporative cooling is also the main culprit behind the infamous “stall” that so frequently plagues aspiring BBQ pit masters eager to make a successful pork butt. The meat sweats as it cooks, releasing the moisture within, and that moisture evaporates and cools the meat, effectively canceling out the heat from the BBQ. That’s why a growing number of competitive pit masters wrap their meat in tinfoil after the first few hours (usually when the internal temperature hits 170° F).Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/icytree1-1152x648-1765997543.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/icytree1-1152x648-1765997543.jpg",
      "popularity_score": 130
    }
  ]
}