{
  "updated_at": "2026-01-27T07:22:20.755Z",
  "clusters": [
    {
      "id": "cluster_22",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 23:05:17 +0000",
      "title": "OpenAI spills technical details about how its AI coding agent works",
      "neutral_headline": "OpenAI spills technical details about how its AI coding agent works",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/openai-spills-technical-details-about-how-its-ai-coding-agent-works/",
          "published_at": "Mon, 26 Jan 2026 23:05:17 +0000",
          "title": "OpenAI spills technical details about how its AI coding agent works",
          "standfirst": "Unusually detailed post explains how OpenAI handles the Codex agent loop.",
          "content": "On Friday, OpenAI engineer Michael Bolin published a detailed technical breakdown of how the company's Codex CLI coding agent works internally, offering developers insight into AI coding tools that can write code, run tests, and fix bugs with human supervision. It complements our article in December on how AI agents work by filling in technical details on how OpenAI implements its \"agentic loop.\" AI coding agents are having something of a \"ChatGPT moment,\" where Claude Code with Opus 4.5 and Codex with GPT-5.2 have reached a new level of usefulness for rapidly coding up prototypes, interfaces, and churning out boilerplate code. The timing of OpenAI's post details the design philosophy behind Codex just as AI agents are becoming more practical tools for everyday work. These tools aren't perfect and remain controversial for some software developers. While OpenAI has previously told Ars Technica that it uses Codex as a coding tool to help develop the Codex product itself, we also discovered, through hands-on experience, that these tools can be astonishingly fast at simple tasks but remain brittle beyond their training data and require human oversight for production work. The rough framework of a project tends to come fast and feels magical, but filling in the details involves tedious debugging and workarounds for limitations the agent cannot overcome on its own.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg",
      "popularity_score": 359.7156236111111
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 20:18:02 +0000",
      "title": "Apple's AirTag 2 is easier to find thanks to new chip",
      "neutral_headline": "Apple's AirTag 2 is easier to find thanks to new chip",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/apple-introduces-new-airtag-with-better-range-and-a-louder-speaker/",
          "published_at": "Mon, 26 Jan 2026 20:18:02 +0000",
          "title": "Apple's AirTag 2 is easier to find thanks to new chip",
          "standfirst": "This is the first major upgrade since Apple introduced AirTags five years ago.",
          "content": "Apple is introducing a new version of its AirTag tracking device—simply dubbed \"the new AirTag\"—and claims it offers substantial improvements thanks to a new Bluetooth chip. The original AirTag came out five years ago now, and it became popular in a variety of contexts. There were some problems, though—there was real concern about unwanted tracking and stalking with the devices, based on real stories of it being used for that. The company gradually introduced new features and protections against that, getting it to a much better place. This new version is focused on making the device more effective in general. Thanks to the inclusion of the second-generation Ultra Wideband chip (the same one found in other recently released Apple devices like the iPhone 17), Apple says the new AirTag can work with the Precision Finding feature in the Find My app to direct users to the AirTag (and whatever lost item it's stored with or attached to) from up to 50 percent farther away.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/05/AirTag-2-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/05/AirTag-2-1152x648.png",
      "popularity_score": 338.9281236111111
    },
    {
      "id": "cluster_30",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 21:31:13 +0000",
      "title": "Doctors face-palm as RFK Jr.’s top vaccine advisor questions need for polio shot",
      "neutral_headline": "Doctors face-palm as RFK Jr.’s top vaccine advisor questions need for polio shot",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/do-we-really-need-polio-shots-deep-thoughts-by-rfk-jr-advisor-get-dragged/",
          "published_at": "Mon, 26 Jan 2026 21:31:13 +0000",
          "title": "Doctors face-palm as RFK Jr.’s top vaccine advisor questions need for polio shot",
          "standfirst": "Kirk Milhoan's comments come as federal vaccine policy slides to insignificance.",
          "content": "The chair of a federal vaccine advisory panel under anti-vaccine Health Secretary Robert F. Kennedy Jr. made his stance clear on vaccines in a podcast last week—and that stance was so alarming that the American Medical Association was compelled to respond with a scathing statement. Kirk Milhoan, who was named chair of the Advisory Committee on Immunization Practices for the Centers for Disease Control and Prevention in December, appeared on the aptly named podcast \"Why Should I Trust You.\" In the hour-long interview, Milhoan made a wide range of comments that have concerned medical experts and raised eyebrows. Early into the discussion, Milhoan, a pediatric cardiologist, declared, \"I don't like established science,\" and that \"science is what I observe.\" He lambasted the evidence-based methodology that previous ACIP panels used to carefully and transparently craft vaccine policy.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2235571142-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2235571142-1152x648.jpg",
      "popularity_score": 333.14784583333335
    },
    {
      "id": "cluster_31",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 21:02:26 +0000",
      "title": "Why has Microsoft been routing example.com traffic to a company in Japan?",
      "neutral_headline": "Why has Microsoft been routing example.com traffic to a company in Japan",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/odd-anomaly-caused-microsofts-network-to-mishandle-example-com-traffic/",
          "published_at": "Mon, 26 Jan 2026 21:02:26 +0000",
          "title": "Why has Microsoft been routing example.com traffic to a company in Japan?",
          "standfirst": "Company's autodiscover caused users' test credentials to be sent outside Microsoft networks.",
          "content": "From the Department of Bizarre Anomalies: Microsoft has suppressed an unexplained anomaly on its network that was routing traffic destined to example.com—a domain reserved for testing purposes—to a maker of electronics cables located in Japan. Under the RFC2606—an official standard maintained by the Internet Engineering Task Force—example.com isn't obtainable by any party. Instead it resolves to IP addresses assigned to Internet Assiged Names Authority. The designation is intended to prevent third parties from being bombarded with traffic when developers, penetration testers, and others need a domain for testing or discussing technical issues. Instead of naming an Internet-routable domain, they are to choose example.com or two others, example.net and example.org. Misconfig gone, but is it fixed? Output from the terminal command cURL shows that devices inside Azure and other Microsoft networks have been routing some traffic to subdomains of sei.co.jp, a domain belonging to Sumitomo Electric. Most of the resulting text is exactly what’s expected. The exception is the JSON-based response. Here’s the JSON output from Friday:Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/error-message-1000x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/error-message-1000x648.jpg",
      "popularity_score": 329.6681236111111
    },
    {
      "id": "cluster_36",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 20:13:47 +0000",
      "title": "“Wildly irresponsible”: DOT's use of AI to draft safety rules sparks concerns",
      "neutral_headline": "“Wildly irresponsible”: DOT's use of AI to draft safety rules sparks concerns",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/wildly-irresponsible-dots-use-of-ai-to-draft-safety-rules-sparks-concerns/",
          "published_at": "Mon, 26 Jan 2026 20:13:47 +0000",
          "title": "“Wildly irresponsible”: DOT's use of AI to draft safety rules sparks concerns",
          "standfirst": "Staffers warn DOT's use of Gemini to draft rules could cause injuries and deaths.",
          "content": "The US Department of Transportation apparently thinks it's a good idea to use artificial intelligence to draft rules impacting the safety of airplanes, cars, and pipelines, a ProPublica investigation revealed Monday. It could be a problem if DOT becomes the first agency to use AI to draft rules, ProPublica pointed out, since AI is known to confidently get things wrong and hallucinate fabricated information. Staffers fear that any failure to catch AI errors could result in flawed laws, leading to lawsuits, injuries, or even deaths in the transportation system. But the DOT's top lawyer, Gregory Zerzan, isn't worried about that, December meeting notes revealed, because the point isn't for AI to be perfect. It's for AI to help speed up the rulemaking process, so that rules that take weeks or months to draft can instead be written within 30 days. According to Zerzan, DOT's preferred tool, Google Gemini, can draft rules in under 30 minutes.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1438737819-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-1438737819-1152x648.jpg",
      "popularity_score": 316.8572902777778
    },
    {
      "id": "cluster_53",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:29:08 +0000",
      "title": "How to encrypt your PC's disk without giving the keys to Microsoft",
      "neutral_headline": "How to encrypt your PC's disk without giving the keys to Microsoft",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/how-to-encrypt-your-pcs-disk-without-giving-the-keys-to-microsoft/",
          "published_at": "Mon, 26 Jan 2026 18:29:08 +0000",
          "title": "How to encrypt your PC's disk without giving the keys to Microsoft",
          "standfirst": "Storing recovery keys with Microsoft allows the company to unlock your disk.",
          "content": "In early 2025, Forbes reports, investigators at the FBI served Microsoft with a warrant seeking the BitLocker encryption recovery keys for several laptops it believed held evidence of fraud in Guam's COVID-19 unemployment assistance program. And Microsoft complied with the FBI's request. BitLocker is the name of the full-disk encryption technology that has been part of Windows for nearly two decades. Though initially only available to owners of the Pro editions of Windows who turned it on manually, during the Windows 8 era Microsoft began using BitLocker to encrypt local disks automatically for all Windows 11 Home and Pro PCs that signed in with a Microsoft account. Using BitLocker in this way also uploads a recovery key for your device to Microsoft's servers—this makes it possible to unlock your disk so you don't lose data if something goes wrong with your system, or if you install a CPU upgrade or some other hardware change that breaks BitLocker. But it also (apparently) makes it possible for Microsoft to unlock your disk, too. A Microsoft rep said that the company handled \"around 20\" similar BitLocker recovery key requests from government authorities per year, and that these requests often fail because users haven't stored their recovery keys on Microsoft's servers. Microsoft and other tech companies have generally refused requests to install universal encryption backdoors for law enforcement purposes, and some companies (like Apple) claim to store device encryption keys using another layer of encryption that renders the keys inaccessible to the company.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/win11-pc-2023-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/win11-pc-2023-1152x648.jpeg",
      "popularity_score": 302.1131236111111
    },
    {
      "id": "cluster_56",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 18:05:50 +0000",
      "title": "The brothers meet Yoshi in Super Mario Galaxy Movie trailer",
      "neutral_headline": "The brothers meet Yoshi in Super Mario Galaxy Movie trailer",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/yoshi-joins-the-fun-in-latest-super-mario-galaxy-movie-trailer/",
          "published_at": "Mon, 26 Jan 2026 18:05:50 +0000",
          "title": "The brothers meet Yoshi in Super Mario Galaxy Movie trailer",
          "standfirst": "Toad: \"So some dinosaur just shows up and he's now part of the group. Cool.\"",
          "content": "Universal Pictures and Illumination dropped a new trailer for the upcoming Super Mario Galaxy Movie, and gaming fans will no doubt be delighted at the news that Yoshi, the little green dinosaur, features prominently, along with plenty of other Easter eggs for sharp-eyed fans. As previously reported, the first attempt at a Super Mario movie adaptation in 1993 was notoriously a dismal failure, although it still has its ’90s-nostalgic fans. But 2023’s Super Mario Bros. Movie won over gaming fans who were skeptical about another adaptation—including Ars Senior Gaming Editor Kyle Orland. The 2023 film reintroduced Mario and Luigi, two tight-knit but struggling Brooklyn plumbers who got separated when they unexpectedly fell into the fantastical Mushroom Kingdom. Mario sought Princess Peach’s help to rescue his brother from the evil clutches of Bowser, ruler of the Dark Lands, who was keen to marry Peach and threatened to destroy the Mushroom Kingdom with a Super Star if she refused him. So Peach led Mario on a quest to recruit allies and stop Bowser for good. They succeeded, shrinking Bowser and imprisoning him in a jar. Mario and Luigi moved to the Mushroom Kingdom and continued their plumbing work there.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/mario2-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/mario2-1152x648.jpg",
      "popularity_score": 294.7247902777778
    },
    {
      "id": "cluster_67",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 16:23:48 +0000",
      "title": "TikTok explained why some US creators are seeing posts with \"0 views\"",
      "neutral_headline": "TikTok explained why some US creators are seeing posts with \"0 views\"",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/tiktok-glitches-caused-by-data-center-power-outage-us-joint-venture-says/",
          "published_at": "Mon, 26 Jan 2026 16:23:48 +0000",
          "title": "TikTok explained why some US creators are seeing posts with \"0 views\"",
          "standfirst": "US TikTok users experienced a wide range of errors, sparking conspiracies.",
          "content": "TikTok has been glitching for US users since Sunday, and TikTok's new US owners finally confirmed the cause: a power outage at a US data center. \"Since yesterday we’ve been working to restore our services following a power outage at a US data center impacting TikTok and other apps we operate,\" the TikTok USDS Joint Venture posted on X on Monday morning. \"We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon.\" By Monday evening, the issues had not been resolved, with the TikTok USDS account posting an update warning users to expect \"bugs, slower load times, or timed-out requests, including when posting new content.\" The X post directly confronted creator concerns about receiving \"0 views\" on new videos and/or missing earnings. The glitch is temporary, TikTok USDS said, \"your actual data and engagement are safe.\"Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2257704765-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2257704765-1024x648.jpg",
      "popularity_score": 283.0242347222222
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 16:13:22 +0000",
      "title": "How to get Doom running on a pair of earbuds",
      "neutral_headline": "How to get Doom running on a pair of earbuds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/how-to-get-doom-running-on-a-pair-of-earbuds/",
          "published_at": "Mon, 26 Jan 2026 16:13:22 +0000",
          "title": "How to get Doom running on a pair of earbuds",
          "standfirst": "No display? No problem for the UART-to-web-server \"Doombuds\" project.",
          "content": "Over the years, hackers and modders at large have made it their mission to port classic first-person shooter Doom to practically anything with a display. Recently, though, coder Arin Sarkisan has taken the \"Can it Run Doom?\" idea in an unlikely direction: wireless earbuds that aren't designed to output graphics at all. To be clear, this hack doesn't apply to any generic set of earbuds. The \"Doombuds\" project is designed specifically for the PineBuds Pro, which are unique in featuring completely open source firmware and a community-maintained SDK. That means Sarkisan was able to code up a JavaScript interface that uses the earbuds' UART contact pads to send a heavily compressed MJPEG video stream to a web server (via a serial server). The 2.4 MB/s data stream from the UART connection can put out about 22 to 27 frames per second in this format, which is more than enough for a CPU that can only run the game at a maximum of 18 fps anyway.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/PineBuds-Pro-4-1152x648-1769443386.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/PineBuds-Pro-4-1152x648-1769443386.jpg",
      "popularity_score": 269.85034583333334
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 14:17:46 +0000",
      "title": "EU launches formal investigation of xAI over Grok's sexualized deepfakes",
      "neutral_headline": "EU launches formal investigation of xAI over Grok's sexualized deepfakes",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/eu-launches-formal-investigation-of-xai-over-groks-sexualized-deepfakes/",
          "published_at": "Mon, 26 Jan 2026 14:17:46 +0000",
          "title": "EU launches formal investigation of xAI over Grok's sexualized deepfakes",
          "standfirst": "Elon Musk's company faces fines of up to 6 percent of its daily turnover.",
          "content": "The EU has launched a formal investigation into Elon Musk’s xAI following a public outcry over how its Grok chatbot spread sexualized images of women and children. The billionaire entrepreneur has come under scrutiny from regulators around the world this month after people began using Grok to generate deepfakes of people without consent. The images were posted on the X social network as well as the separate Grok app, both of which are run by xAI. The probe, announced on Monday under the EU’s Digital Services Act, will assess if xAI tried to mitigate the risks of deploying Grok’s tools on X and the proliferation of content that “may amount to child sexual abuse material.”Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/xai-grok-1152x648-1752596823.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/xai-grok-1152x648-1752596823.jpg",
      "popularity_score": 260.92367916666666
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Mon, 26 Jan 2026 12:00:57 +0000",
      "title": "Former astronaut on lunar spacesuits: \"I don't think they're great right now\"",
      "neutral_headline": "Former astronaut on lunar spacesuits: \"I don't think they're great right now\"",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/former-astronaut-on-lunar-spacesuits-i-dont-think-theyre-great-right-now/",
          "published_at": "Mon, 26 Jan 2026 12:00:57 +0000",
          "title": "Former astronaut on lunar spacesuits: \"I don't think they're great right now\"",
          "standfirst": "\"These are just the difficulties of designing a spacesuit for the lunar environment.\"",
          "content": "Crew members traveling to the lunar surface on NASA's Artemis missions should be gearing up for a grind. They will wear heavier spacesuits than those worn by the Apollo astronauts, and NASA will ask them to do more than the first Moonwalkers did more than 50 years ago. The Moonwalking experience will amount to an \"extreme physical event\" for crews selected for the Artemis program's first lunar landings, a former NASA astronaut told a panel of researchers, physicians, and engineers convened by the National Academies. Kate Rubins, who retired from the space agency last year, presented the committee with her views on the health risks for astronauts on lunar missions. She outlined the concerns NASA officials often talk about: radiation exposure, muscle and bone atrophy, reduced cardiovascular and immune function, and other adverse medical effects of spaceflight.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jsc2025e077725-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/jsc2025e077725-1152x648.jpg",
      "popularity_score": 141.6434013888889
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Sun, 25 Jan 2026 12:00:25 +0000",
      "title": "A decade of Star Trek-themed fart jokes: The Greatest Generation podcast turns 10",
      "neutral_headline": "A decade of Star Trek-themed fart jokes: The Greatest Generation podcast turns 10",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2026/01/a-decade-of-star-trek-themed-fart-jokes-the-greatest-generation-podcast-turns-10/",
          "published_at": "Sun, 25 Jan 2026 12:00:25 +0000",
          "title": "A decade of Star Trek-themed fart jokes: The Greatest Generation podcast turns 10",
          "standfirst": "How two podcasters turned a Star Trek side project into a full-time career.",
          "content": "A decade is a long time for a TV series; no single iteration of Star Trek has made it that far. But “a Star Trek podcast by two guys just a little bit embarrassed to have a Star Trek podcast” has now passed the milestone. January 25, 2026, marks a full decade since The Greatest Generation, my favorite podcast, debuted. Like a bottle of Château Picard, the show has only improved with age. (I interviewed the guys behind the show back in 2016 when they were just getting started.) The podcast helped me rediscover, and appreciate more fully, Star Trek: The Next Generation—which is also my favorite TV show. The Greatest Generation continues to delight with its irreverent humor, its celebration of the most minor of characters, and its technical fascination with how a given episode was made.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ADAM_BEN_L1560319-1152x648-1769205900.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ADAM_BEN_L1560319-1152x648-1769205900.jpg",
      "popularity_score": 138
    }
  ]
}