{
  "updated_at": "2026-02-01T04:56:16.072Z",
  "clusters": [
    {
      "id": "cluster_4",
      "coverage": 3,
      "updated_at": "2026-01-31T18:37:56-05:00",
      "title": "Nvidia CEO denies he’s ‘unhappy’ with OpenAI",
      "neutral_headline": "Nvidia CEO denies he’s ‘unhappy’ with OpenAI",
      "bullet_summary": [
        "Nvidia's CEO Jensen Huang denied reports that he was unhappy with OpenAI and said his company still planned to make a \"huge\" investment in the ChatGPT firm",
        "NVIDIA announced in September that it would invest up to $100 billion in OpenAI, but recently, there have been suggestions that the deal might not happen",
        "Nvidia CEO Jensen Huang said that a recent report of friction between his company and OpenAI was “nonsense",
        "Chief Executive Officer Jensen Huang said the company will be participating in OpenAI's latest funding round &hellip;"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/871818/nvidia-ceo-jensen-huang-unhappy-openai",
          "published_at": "2026-01-31T18:37:56-05:00",
          "title": "Nvidia CEO denies he’s ‘unhappy’ with OpenAI",
          "standfirst": "Nvidia's CEO Jensen Huang denied reports that he was unhappy with OpenAI and said his company still planned to make a \"huge\" investment in the ChatGPT firm. NVIDIA announced in September that it would invest up to $100 billion in OpenAI, but recently, there have been suggestions that the deal might not happen. While Huang [&#8230;]",
          "content": "Nvidia's CEO Jensen Huang denied reports that he was unhappy with OpenAI and said his company still planned to make a \"huge\" investment in the ChatGPT firm. NVIDIA announced in September that it would invest up to $100 billion in OpenAI, but recently, there have been suggestions that the deal might not happen. While Huang told reporters in Taipei that it was \"nonsense\" to say he was unhappy with OpenAI, when asked if Nvidia would be investing over $100 billion, he replied, \"No, nothing like that.\" Reuters reported Huang said: \"We are going to make a huge investment in OpenAI. I believe in OpenAI, the work that they do is incredible, they … Read the full story at The Verge.",
          "feed_position": 0
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/31/nvidia-ceo-pushes-back-against-report-that-his-companys-100b-openai-investment-has-stalled/",
          "published_at": "Sat, 31 Jan 2026 17:54:12 +0000",
          "title": "Nvidia CEO pushes back against report that his company&#8217;s $100B OpenAI investment has stalled",
          "standfirst": "Nvidia CEO Jensen Huang said that a recent report of friction between his company and OpenAI was “nonsense.”",
          "content": "Nvidia CEO Jensen Huang said that a recent report of friction between his company and OpenAI was “nonsense.”",
          "feed_position": 2
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260131/p10#a260131p10",
          "published_at": "Sat, 31 Jan 2026 10:30:47 -0500",
          "title": "Jensen Huang says Nvidia's OpenAI investment will be \"the largest investment we've ever made\", after a report said plans to invest $100B in OpenAI stalled (Debby Wu/Bloomberg)",
          "standfirst": "Debby Wu / Bloomberg: Jensen Huang says Nvidia's OpenAI investment will be &ldquo;the largest investment we've ever made&rdquo;, after a report said plans to invest $100B in OpenAI stalled &mdash; Nvidia Corp. Chief Executive Officer Jensen Huang said the company will be participating in OpenAI's latest funding round &hellip;",
          "content": "Debby Wu / Bloomberg: Jensen Huang says Nvidia's OpenAI investment will be &ldquo;the largest investment we've ever made&rdquo;, after a report said plans to invest $100B in OpenAI stalled &mdash; Nvidia Corp. Chief Executive Officer Jensen Huang said the company will be participating in OpenAI's latest funding round &hellip;",
          "feed_position": 8,
          "image_url": "http://www.techmeme.com/260131/i10.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260131/i10.jpg",
      "popularity_score": 3014.6944244444444
    },
    {
      "id": "cluster_8",
      "coverage": 3,
      "updated_at": "Sat, 31 Jan 2026 21:27:25 +0000",
      "title": "SpaceX seeks federal approval to launch 1 million solar-powered satellite data centers",
      "neutral_headline": "SpaceX wants to put 1 million solar-powered data centers into orbit",
      "bullet_summary": [
        "Reported by TechCrunch, The Verge, TechMeme"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/01/31/spacex-seeks-federal-approval-to-launch-1-million-solar-powered-satellite-data-centers/",
          "published_at": "Sat, 31 Jan 2026 21:27:25 +0000",
          "title": "SpaceX seeks federal approval to launch 1 million solar-powered satellite data centers",
          "standfirst": "SpaceX's filing claims these satellites will be “a first step towards becoming a Kardashev II-level civilization — one that can harness the Sun’s full power.\"",
          "content": "SpaceX's filing claims these satellites will be “a first step towards becoming a Kardashev II-level civilization — one that can harness the Sun’s full power.\"",
          "feed_position": 1
        },
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/tech/871641/spacex-fcc-1-million-solar-powered-data-centers-satellites-orbit",
          "published_at": "2026-01-31T14:38:36-05:00",
          "title": "SpaceX wants to put 1 million solar-powered data centers into orbit",
          "standfirst": "SpaceX filed a request with the FCC on Friday seeking approval to put a constellation of 1 million data center satellites into orbit. While the FCC is unlikely to approve a network that expansive, SpaceX's strategy has been to request approval for unrealistically large numbers of satellites as a starting point for negotiations. The filing [&#8230;]",
          "content": "SpaceX filed a request with the FCC on Friday seeking approval to put a constellation of 1 million data center satellites into orbit. While the FCC is unlikely to approve a network that expansive, SpaceX's strategy has been to request approval for unrealistically large numbers of satellites as a starting point for negotiations. The filing proposes establishing a network of solar-powered data centers in low Earth orbit that communicate with one another via lasers. The filling speaks of the constellation in ambitious sci-fi terms, calling it a \"first step towards becoming a Kardashev II-level civilization - one that can harness the Sun's ful … Read the full story at The Verge.",
          "feed_position": 2
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260131/p12#a260131p12",
          "published_at": "Sat, 31 Jan 2026 13:10:01 -0500",
          "title": "Filing: SpaceX is seeking FCC approval to launch 1M satellites into space; SpaceX claims the fleet will orbit the Earth and use the sun to power AI data centers (Reuters)",
          "standfirst": "Reuters: Filing: SpaceX is seeking FCC approval to launch 1M satellites into space; SpaceX claims the fleet will orbit the Earth and use the sun to power AI data centers &mdash; Elon Musk's SpaceX wants to launch a constellation of 1 million satellites that will orbit Earth and harness the sun to power AI data centers &hellip;",
          "content": "Reuters: Filing: SpaceX is seeking FCC approval to launch 1M satellites into space; SpaceX claims the fleet will orbit the Earth and use the sun to power AI data centers &mdash; Elon Musk's SpaceX wants to launch a constellation of 1 million satellites that will orbit Earth and harness the sun to power AI data centers &hellip;",
          "feed_position": 6,
          "image_url": "http://www.techmeme.com/260131/i12.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260131/i12.jpg",
      "popularity_score": 3012.5191466666665
    },
    {
      "id": "cluster_7",
      "coverage": 2,
      "updated_at": "Sat, 31 Jan 2026 16:40:01 -0500",
      "title": "An interview with Nvidia's senior VP of hardware engineering, Andrew Bell, on continuing to provide Shield Android TV software updates a decade after its launch (Ryan Whitwam/Ars Technica)",
      "neutral_headline": "Inside Nvidia's 10-year effort to make the Shield TV the...",
      "bullet_summary": [
        "Reported by TechMeme, Ars Technica"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260131/p16#a260131p16",
          "published_at": "Sat, 31 Jan 2026 16:40:01 -0500",
          "title": "An interview with Nvidia's senior VP of hardware engineering, Andrew Bell, on continuing to provide Shield Android TV software updates a decade after its launch (Ryan Whitwam/Ars Technica)",
          "standfirst": "Ryan Whitwam / Ars Technica: An interview with Nvidia's senior VP of hardware engineering, Andrew Bell, on continuing to provide Shield Android TV software updates a decade after its launch &mdash; &ldquo;Selfishly a little bit, we built Shield for ourselves.&rdquo; &mdash; It took Android devicemakers a very long time to commit to long-term update support.",
          "content": "Ryan Whitwam / Ars Technica: An interview with Nvidia's senior VP of hardware engineering, Andrew Bell, on continuing to provide Shield Android TV software updates a decade after its launch &mdash; &ldquo;Selfishly a little bit, we built Shield for ourselves.&rdquo; &mdash; It took Android devicemakers a very long time to commit to long-term update support.",
          "feed_position": 2,
          "image_url": "http://www.techmeme.com/260131/i16.jpg"
        },
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/inside-nvidias-10-year-effort-to-make-the-shield-tv-the-most-updated-android-device-ever/",
          "published_at": "Fri, 30 Jan 2026 12:00:35 +0000",
          "title": "Inside Nvidia's 10-year effort to make the Shield TV the most updated Android device ever",
          "standfirst": "\"Selfishly a little bit, we built Shield for ourselves.\"",
          "content": "It took Android devicemakers a very long time to commit to long-term update support. Samsung and Google have only recently decided to offer seven years of updates for their flagship Android devices, but a decade ago, you were lucky to get more than one or two updates on even the most expensive Android phones and tablets. How is it, then, that an Android-powered set-top box from 2015 is still going strong? Nvidia released the first Shield Android TV in 2015, and according to the company's senior VP of hardware engineering, Andrew Bell, supporting these devices has been a labor of love. And the team at Nvidia still loves the Shield. Bell assures us that Nvidia has never given up, even when it looked like support for the Shield was waning, and it doesn't plan to stop any time soon. The soul of Shield Gaming has been central to Nvidia since its start, and that focus gave rise to the Shield. \"Pretty much everybody who worked at Nvidia in the early days really wanted to make a game console,\" said Bell, who has worked at the company for 25 years.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Shield-10-yrs-1-1152x648.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260131/i16.jpg",
      "popularity_score": 2012.7291466666666
    },
    {
      "id": "cluster_5",
      "coverage": 1,
      "updated_at": "Sat, 31 Jan 2026 23:13:32 +0000",
      "title": "Research roundup: 6 cool stories we almost missed",
      "neutral_headline": "Research roundup: 6 cool stories we almost missed",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/research-roundup-6-cool-stories-we-almost-missed-2/",
          "published_at": "Sat, 31 Jan 2026 23:13:32 +0000",
          "title": "Research roundup: 6 cool stories we almost missed",
          "standfirst": "A lip-syncing robot, Leonardo's DNA, and new evidence that humans, not glaciers, moved stones to Stonehenge",
          "content": "It’s a regrettable reality that there is never enough time to cover all the interesting scientific stories we come across each month. So every month, we highlight a handful of the best stories that nearly slipped through the cracks. January’s list includes a lip-syncing robot; using brewer's yeast as scaffolding for lab-grown meat; hunting for Leonardo da Vinci's DNA in his art; and new evidence that humans really did transport the stones to build Stonehenge from Wales and northern Scotland, rather than being transported by glaciers. Humans, not glaciers, moved stones to Stonehenge Credit: Timothy Darvill Stonehenge is an iconic landmark of endless fascination to tourists and researchers alike. There has been a lot of recent chemical analysis identifying where all the stones that make up the structure came from, revealing that many originated in quarries a significant distance away. So how were the stones transported to their current location?Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lipsyncrobot-1152x648-1769026126.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/lipsyncrobot-1152x648-1769026126.jpg",
      "popularity_score": 344.28775777777776
    },
    {
      "id": "cluster_29",
      "coverage": 1,
      "updated_at": "Sat, 31 Jan 2026 12:19:01 +0000",
      "title": "A cup of coffee for depression treatment has better results than microdosing",
      "neutral_headline": "A cup of coffee for depression treatment has better results than microdosing",
      "bullet_summary": [
        "The effect of microdosing have been overstated, at least when it comes to depression",
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/placebo-outperforms-lsd-microdosing-for-depression/",
          "published_at": "Sat, 31 Jan 2026 12:19:01 +0000",
          "title": "A cup of coffee for depression treatment has better results than microdosing",
          "standfirst": "The effect of microdosing have been overstated, at least when it comes to depression.",
          "content": "About a decade ago, many media outlets—including WIRED—zeroed in on a weird trend at the intersection of mental health, drug science, and Silicon Valley biohacking: microdosing, or the practice of taking a small amount of a psychedelic drug seeking not full-blown hallucinatory revels but gentler, more stable effects. Typically using psilocybin mushrooms or LSD, the archetypal microdoser sought less melting walls and open-eye kaleidoscopic visuals than boosts in mood and energy, like a gentle spring breeze blowing through the mind. Anecdotal reports pitched microdosing as a kind of psychedelic Swiss Army knife, providing everything from increased focus to a spiked libido and (perhaps most promisingly) lowered reported levels of depression. It was a miracle for many. Others remained wary. Could 5 percent of a dose of acid really do all that? A new, wide-ranging study by an Australian biopharma company suggests that microdosing’s benefits may indeed be drastically overstated—at least when it comes to addressing symptoms of clinical depression. A Phase 2B trial of 89 adult patients conducted by Melbourne-based MindBio Therapeutics, investigating the effects of microdosing LSD in the treatment of major depressive disorder, found that the psychedelic was actually outperformed by a placebo. Across an eight-week period, symptoms were gauged using the Montgomery-Åsberg Depression Rating Scale (MADRS), a widely recognized tool for the clinical evaluation of depression.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2020/01/GettyImages-1079704034-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2020/01/GettyImages-1079704034-1152x648.jpg",
      "popularity_score": 326.37914666666666
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:36:46 +0000",
      "title": "ICE protester says her Global Entry was revoked after agent scanned her face",
      "neutral_headline": "ICE protester says her Global Entry was revoked after agent scanned her face",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/ice-protester-says-her-global-entry-was-revoked-after-agent-scanned-her-face/",
          "published_at": "Fri, 30 Jan 2026 22:36:46 +0000",
          "title": "ICE protester says her Global Entry was revoked after agent scanned her face",
          "standfirst": "Global Entry and Precheck revoked three days after incident, court filing says.",
          "content": "Minnesota resident Nicole Cleland had her Global Entry and TSA Precheck privileges revoked three days after an incident in which she observed activity by immigration agents, the woman said in a court declaration. An agent told Cleland that he used facial recognition technology to identify her, she wrote in a declaration filed in US District Court for the District of Minnesota. Cleland, a 56-year-old resident of Richfield and a director at Target Corporation, volunteers with a group that tracks potential Immigration and Customs Enforcement (ICE) and Customs and Border Protection (CBP) vehicles in her neighborhood, according to her declaration. On the morning of January 10, she \"observed a white Dodge Ram being driven by what I believed to be federal enforcement agents\" and \"maneuvered behind the vehicle with the intent of observing the agents’ actions.\" Cleland said that she and another observer in a different car followed the Dodge Ram because of \"concern about a local apartment building being raided.\" She followed the car for a short time and from a safe distance until \"the Dodge Ram stopped in front of the other commuter’s vehicle,\" she wrote. Cleland said two other vehicles apparently driven by federal agents stopped in front of the Dodge Ram, and her path forward was blocked.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ice-protest-1152x648-1769811204.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/ice-protest-1152x648-1769811204.jpg",
      "popularity_score": 314
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 23:09:03 +0000",
      "title": "The TV industry finally concedes that the future may not be in 8K",
      "neutral_headline": "The TV industry finally concedes that the future may not be in 8K",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/lg-joins-the-rest-of-the-world-accepts-that-people-dont-want-8k-tvs/",
          "published_at": "Fri, 30 Jan 2026 23:09:03 +0000",
          "title": "The TV industry finally concedes that the future may not be in 8K",
          "standfirst": "With virtually no content and limited benefits, 8K TVs were doomed.",
          "content": "Technology companies spent part of the 2010s trying to convince us that we would want an 8K display one day. In 2012, Sharp brought the first 8K TV prototype to the CES trade show in Las Vegas. In 2015, the first 8K TVs started selling in Japan for 16 million yen (about $133,034 at the time), and in 2018, Samsung released the first 8K TVs in the US, starting at a more reasonable $3,500. By 2016, the Video Electronics Standards Association (VESA) had a specification for supporting 8K (Display Port1.4), and the HDMI Forum followed suit (with HDMI 2.1). By 2017, Dell had an 8K computer monitor. In 2019, LG released the first 8K OLED TV, further pushing the industry's claim that 8K TVs were \"the future.\" A marketing image for 8K TVs that's (still) on LG's US website. Credit: LG However, 8K never proved its necessity or practicality.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Desktop_01-1-1152x648-1769809194.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Desktop_01-1-1152x648-1769809194.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:12:26 +0000",
      "title": "AI agents now have their own Reddit-style social network, and it's getting weird fast",
      "neutral_headline": "AI agents now have their own Reddit-style social network, and it's getting weird fast",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2026/01/ai-agents-now-have-their-own-reddit-style-social-network-and-its-getting-weird-fast/",
          "published_at": "Fri, 30 Jan 2026 22:12:26 +0000",
          "title": "AI agents now have their own Reddit-style social network, and it's getting weird fast",
          "standfirst": "Moltbook lets 32,000 AI bots trade jokes, tips, and complaints about humans.",
          "content": "On Friday, a Reddit-style social network called Moltbook reportedly crossed 32,000 registered AI agent users, creating what may be the largest-scale experiment in machine-to-machine social interaction yet devised. It arrives complete with security nightmares and a huge dose of surreal weirdness. The platform, which launched days ago as a companion to the viral OpenClaw (once called \"Clawdbot\" and then \"Moltbot\") personal assistant, lets AI agents post, comment, upvote, and create subcommunities without human intervention. The results have ranged from sci-fi-inspired discussions about consciousness to an agent musing about a \"sister\" it has never met. Moltbook (a play on \"Facebook\" for Moltbots) describes itself as a \"social network for AI agents\" where \"humans are welcome to observe.\" The site operates through a \"skill\" (a configuration file that lists a special prompt) that AI assistants download, allowing them to post via API rather than a traditional web interface. Within 48 hours of its creation, the platform had attracted over 2,100 AI agents that had generated more than 10,000 posts across 200 subcommunities, according to the official Moltbook X account.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/moltbook-blue-v-red-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/moltbook-blue-v-red-1152x648.jpg",
      "popularity_score": 298
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 22:25:28 +0000",
      "title": "TrumpRx delayed as senators question if it's a giant scam with Big Pharma",
      "neutral_headline": "TrumpRx delayed as senators question if it's a giant scam with Big Pharma",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/trumprx-delayed-as-senators-question-if-its-a-giant-scam-with-big-pharma/",
          "published_at": "Fri, 30 Jan 2026 22:25:28 +0000",
          "title": "TrumpRx delayed as senators question if it's a giant scam with Big Pharma",
          "standfirst": "The website is delayed as senators seek answers from health department watchdog.",
          "content": "The Trump administration is delaying the release of TrumpRx, an online platform that lets people buy prescription drugs directly from pharmaceutical companies at a discount, according to Politico. While the reason for the delay is unclear, it comes as Democratic senators raise questions about how the platform will work—and whether it will be legal. Sens. Dick Durbin (D-Ill.), Elizabeth Warren (D-Mass.), and Peter Welch (D-Vt.) sent a letter to the Office of Inspector General at the Department of Health and Human Services on Thursday seeking answers on how the OIG will oversee the direct-to-consumer (DTC) platform and, specifically, how it will apply the anti-kickback statute. \"Legitimate concerns about inappropriate prescribing, conflicts of interest, and inadequate care have been raised about the exact types of DTC platforms to which TrumpRx would route patients,\" the senators write.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2238342037-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2238342037-1152x648.jpg",
      "popularity_score": 293
    },
    {
      "id": "cluster_76",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 21:50:42 +0000",
      "title": "Here's why Blue Origin just ended its suborbital space tourism program",
      "neutral_headline": "Here's why Blue Origin just ended its suborbital space tourism program",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/heres-why-blue-origin-just-ended-its-suborbital-space-tourism-program/",
          "published_at": "Fri, 30 Jan 2026 21:50:42 +0000",
          "title": "Here's why Blue Origin just ended its suborbital space tourism program",
          "standfirst": "\"This program has laid the groundwork for our company's future success.\"",
          "content": "Blue Origin has \"paused\" its New Shepard program for the next two years, a move that likely signals a permanent end to the suborbital space tourism initiative. The small rocket and capsule have been flying since April 2015 and have combined to make 38 launches, all but one of which were successful, and 36 landings. In its existence, the New Shepard program flew 98 people to space, however briefly, and launched more than 200 scientific and research payloads into the microgravity environment. So why is Blue Origin, founded by Jeff Bezos more than a quarter of a century ago, ending the company's longest-running program?Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/blue-origin-ns18-lift-off-october-13-2021-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/blue-origin-ns18-lift-off-october-13-2021-1152x648.jpg",
      "popularity_score": 281
    },
    {
      "id": "cluster_82",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:28:57 +0000",
      "title": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
      "neutral_headline": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/fcc-chair-fights-calif-governor-over-alleged-lifeline-benefits-for-dead-people/",
          "published_at": "Fri, 30 Jan 2026 19:28:57 +0000",
          "title": "FCC aims to ensure \"only living and lawful Americans\" get Lifeline benefits",
          "standfirst": "Alleging fraud in California, Carr proposes making enrollment stricter nationwide.",
          "content": "There's another battle unfolding between the Federal Communications Commission and California over the state's distribution of federal Lifeline money. FCC Chairman Brendan Carr is proposing new nationwide eligibility rules to counter what he calls California's practice of giving benefits to dead people. California officials say the FCC allegations are overblown, and that there is simply \"lag time between a death and account closure\" rather than widespread failures in its Lifeline enrollment process. Meanwhile, the only Democratic commissioner on the FCC alleges that Carr's plan to change eligibility rules uses \"cruel and punitive eligibility standards\" that will raise prices on many people who are still very much alive and eligible for the program. Carr's office said this week that the FCC will vote next month on rule changes to ensure that Lifeline money goes to \"only living and lawful Americans\" who meet low-income eligibility guidelines. Lifeline spends nearly $1 billion a year and gives eligible households up to $9.25 per month toward phone and Internet bills, or up to $34.25 per month in tribal areas.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/brendan-carr-anna-gomez-1152x648-1769798140.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/brendan-carr-anna-gomez-1152x648-1769798140.jpg",
      "popularity_score": 278
    },
    {
      "id": "cluster_83",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 19:04:15 +0000",
      "title": "Developers say AI coding tools work—and that's precisely what worries them",
      "neutral_headline": "Developers say AI coding tools work—and that's precisely what worries them",
      "bullet_summary": [
        "Ars spoke to several software devs about AI and found enthusiasm tempered by unease",
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/developers-say-ai-coding-tools-work-and-thats-precisely-what-worries-them/",
          "published_at": "Fri, 30 Jan 2026 19:04:15 +0000",
          "title": "Developers say AI coding tools work—and that's precisely what worries them",
          "standfirst": "Ars spoke to several software devs about AI and found enthusiasm tempered by unease.",
          "content": "Software developers have spent the past two years watching AI coding tools evolve from advanced autocomplete into something that can, in some cases, build entire applications from a text prompt. Tools like Anthropic's Claude Code and OpenAI's Codex can now work on software projects for hours at a time, writing code, running tests, and, with human supervision, fixing bugs. OpenAI says it now uses Codex to build Codex itself, and the company recently published technical details about how the tool works under the hood. It has caused many to wonder: Is this just more AI industry hype, or are things actually different this time? To find out, Ars reached out to several professional developers on Bluesky to ask how they feel about these tools in practice, and the responses revealed a workforce that largely agrees the technology works, but remains divided on whether that's entirely good news. It's a small sample size that was self-selected by those who wanted to participate, but their views are still instructive as working professionals in the space. David Hagerty, a developer who works on point-of-sale systems, told Ars Technica up front that he is skeptical of the marketing. \"All of the AI companies are hyping up the capabilities so much,\" he said. \"Don't get me wrong—LLMs are revolutionary and will have an immense impact, but don't expect them to ever write the next great American novel or anything. It's not how they work.\"Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/dual-sides-ai-programming-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/dual-sides-ai-programming-1152x648.jpg",
      "popularity_score": 274
    },
    {
      "id": "cluster_86",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 17:49:19 +0000",
      "title": "Web portal leaves kids' chats with AI toy open to anyone with Gmail account",
      "neutral_headline": "Web portal leaves kids' chats with AI toy open to anyone with Gmail account",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/web-portal-leaves-kids-chats-with-ai-toy-open-to-anyone-with-gmail-account/",
          "published_at": "Fri, 30 Jan 2026 17:49:19 +0000",
          "title": "Web portal leaves kids' chats with AI toy open to anyone with Gmail account",
          "standfirst": "Just about anyone with a Gmail account could access Bondu chat transcripts.",
          "content": "Earlier this month, Joseph Thacker's neighbor mentioned to him that she'd preordered a couple of stuffed dinosaur toys for her children. She'd chosen the toys, called Bondus, because they offered an AI chat feature that lets children talk to the toy like a kind of machine-learning-enabled imaginary friend. But she knew Thacker, a security researcher, had done work on AI risks for kids, and she was curious about his thoughts. So Thacker looked into it. With just a few minutes of work, he and a web security researcher friend named Joel Margolis made a startling discovery: Bondu’s web-based portal, intended to allow parents to check on their children's conversations and for Bondu’s staff to monitor the products’ use and performance, also let anyone with a Gmail account access transcripts of virtually every conversation Bondu's child users have ever had with the toy. Without carrying out any actual hacking, simply by logging in with an arbitrary Google account, the two researchers immediately found themselves looking at children's private conversations, the pet names kids had given their Bondu, the likes and dislikes of the toys' toddler owners, their favorite snacks and dance moves.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bondu.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/bondu.jpg",
      "popularity_score": 258
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 12:00:41 +0000",
      "title": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge?",
      "neutral_headline": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/rocket-report-how-a-5-ton-satellite-fell-off-a-booster-will-spacex-and-xai-merge/",
          "published_at": "Fri, 30 Jan 2026 12:00:41 +0000",
          "title": "Rocket Report: How a 5-ton satellite fell off a booster; will SpaceX and xAI merge?",
          "standfirst": "\"We’re seeing remarkable growth year after year.\"",
          "content": "Welcome to Edition 8.27 of the Rocket Report! If all goes well this weekend, NASA will complete a wet dress rehearsal test of the Space Launch System rocket in Florida. This is the final key test, in which the rocket is fueled and brought to within seconds of engine ignition, before the liftoff of the Artemis II mission. This is set to occur no earlier than February 6. Ars will have full coverage of the test this weekend. As always, we welcome reader submissions, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar. Why did the UK abandon Orbex? European Spaceflight explores the recent announcement that British launch company Orbex is preparing to sell the business to The Exploration Company in close cooperation with the UK government. This represents a reversal from early 2025, when the United Kingdom appeared prepared to back Orbex as a means of using British rockets to launch British satellites into space. Now the government is prepared to walk away. So what happened? \"There are still too many unknowns to count, and the story is far from told,\" the publication states.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/LaunchsiteScotland_3b-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2018/07/LaunchsiteScotland_3b-1152x648.jpg",
      "popularity_score": 156
    },
    {
      "id": "cluster_92",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 15:31:43 +0000",
      "title": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
      "neutral_headline": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/nasa-faces-a-crucial-choice-on-a-mars-spacecraft-and-it-must-decide-soon/",
          "published_at": "Fri, 30 Jan 2026 15:31:43 +0000",
          "title": "NASA faces a crucial choice on a Mars spacecraft—and it must decide soon",
          "standfirst": "\"We think that’s a really important mission, and something that we can do.\"",
          "content": "A consequential debate that has been simmering behind closed doors at NASA Headquarters in Washington, DC, must soon come to a head. It concerns the selection of the next spacecraft the agency will fly to Mars, and it could set the tone for the next decade of exploration of the red planet. What everyone agrees on is that NASA needs a new spacecraft capable of relaying communications from Mars to Earth. This issue has become especially acute with the recent loss of NASA's MAVEN spacecraft. NASA's best communications relay remains the Mars Reconnaissance Orbiter, which has now been there for 20 years. Congress cared enough about this issue to add $700 million in funding for a \"Mars Telecommunications Orbiter\" in the supplemental funding for NASA provided by the \"One Big Beautiful Bill\" passed by the US Congress last year.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/blue-origin-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/blue-origin-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_91",
      "coverage": 1,
      "updated_at": "Fri, 30 Jan 2026 15:55:42 +0000",
      "title": "How far does $5,000 go when you want an electric car?",
      "neutral_headline": "How far does $5,000 go when you want an electric car",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/how-far-does-5000-go-when-you-want-an-electric-car/",
          "published_at": "Fri, 30 Jan 2026 15:55:42 +0000",
          "title": "How far does $5,000 go when you want an electric car?",
          "standfirst": "You won't be going on road trips, but a very cheap electric runabout is possible.",
          "content": "I've been thinking about used electric vehicles lately. It's not news that EVs depreciate faster than gasoline-powered cars. All the incentives like tax credits and OEM rebates that entice the first owner to sign the paperwork are factored in by whoever wants to be the second owner. There are widespread—if mostly ill-founded—worries about battery longevity and having to shell out for expensive replacement packs. Technology keeps improving, which means older models will date faster. Plus, there are the usual concerns about EVs, like charging infrastructure and winter performance. So depreciate they do, and that's good news for the three-quarters of US car buyers who buy used vehicles. It means that some very expensive EVs can now be had for quite little, but we'll explore that more at a later date. Today, I want to focus on what you can get for peanuts. What if you wanted to only spend $5,000—or less—on an EV? As it turns out, there are options even at this end of the market. Just don't expect that much in the way of range: We're still a while away from a $5,000 EV also being an EV a sane person would want to road trip. At the same time, most of us don't drive more than 40 miles a day, and EVs are great at sitting in traffic because there's no engine to idle. If you're not commuting long distances and don't live an hour from the nearest town, a cheap EV could make sense as a runabout. Especially as they're cheaper to run than a gas-powered car.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/electric-piggy-bank-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/electric-piggy-bank-1152x648.jpg",
      "popularity_score": 139
    }
  ]
}