{
  "updated_at": "2026-01-22T11:18:13.776Z",
  "clusters": [
    {
      "id": "cluster_0",
      "coverage": 2,
      "updated_at": "Thu, 22 Jan 2026 06:10:01 -0500",
      "title": "An analysis of 5,290 AI research papers at NeurIPS: 141, or ~3%, had US-China AI lab collaboration, up from 134 in 2024; Llama featured in 106 Chinese papers (Will Knight/Wired)",
      "neutral_headline": "The US and China Are Collaborating More Closely on AI Than You Think",
      "bullet_summary": [
        "Reported by TechMeme, Wired Tech"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260122/p13#a260122p13",
          "published_at": "Thu, 22 Jan 2026 06:10:01 -0500",
          "title": "An analysis of 5,290 AI research papers at NeurIPS: 141, or ~3%, had US-China AI lab collaboration, up from 134 in 2024; Llama featured in 106 Chinese papers (Will Knight/Wired)",
          "standfirst": "Will Knight / Wired: An analysis of 5,290 AI research papers at NeurIPS: 141, or ~3%, had US-China AI lab collaboration, up from 134 in 2024; Llama featured in 106 Chinese papers &mdash; WIRED analyzed more than 5,000 papers from NeurIPS using OpenAI's Codex to understand the areas where the US and China actually work together on AI research.",
          "content": "Will Knight / Wired: An analysis of 5,290 AI research papers at NeurIPS: 141, or ~3%, had US-China AI lab collaboration, up from 134 in 2024; Llama featured in 106 Chinese papers &mdash; WIRED analyzed more than 5,000 papers from NeurIPS using OpenAI's Codex to understand the areas where the US and China actually work together on AI research.",
          "feed_position": 0,
          "image_url": "http://www.techmeme.com/260122/i13.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/us-china-collaboration-neurips-papers/",
          "published_at": "Wed, 21 Jan 2026 19:00:00 +0000",
          "title": "The US and China Are Collaborating More Closely on AI Than You Think",
          "standfirst": "WIRED analyzed more than 5,000 papers from NeurIPS using OpenAI’s Codex to understand the areas where the US and China actually work together on AI research.",
          "content": "WIRED analyzed more than 5,000 papers from NeurIPS using OpenAI’s Codex to understand the areas where the US and China actually work together on AI research.",
          "feed_position": 17,
          "image_url": "https://media.wired.com/photos/69710742e56cedae6f89e032/master/pass/AI-Lab-US-China-Cutting-Edge-AI-Business.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260122/i13.jpg",
      "popularity_score": 2019.8631177777777
    },
    {
      "id": "cluster_51",
      "coverage": 2,
      "updated_at": "2026-01-21T18:22:57-05:00",
      "title": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
      "neutral_headline": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
      "bullet_summary": [
        "SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos' space company, Blue Origin, has announced the TeraWave network",
        "Deployment of satellites is planned to begin in the last quarter of 2027, Blue Origin said, adding the network will be designed to have “data speeds of up to 6 Tbps anywhere on Earth”",
        "Blue Origin said the network would be meant to serve a maximum of roughly 100,000 customers"
      ],
      "items": [
        {
          "source": "The Verge",
          "url": "https://www.theverge.com/news/865282/blue-origin-terawave-satellite-6tb",
          "published_at": "2026-01-21T18:22:57-05:00",
          "title": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
          "standfirst": "SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos' space company, Blue Origin, has announced the TeraWave network. It says TeraWave will offer bandwidth of up to 6Tb available anywhere on Earth, for both upload and download. The only wrinkle? Even after satellite deployments are scheduled [&#8230;]",
          "content": "The Blue Origin New Glenn rocket lifts off at Launch Complex 36 in its second launch attempt at Cape Canaveral Space Force Station on November 13, 2025 in Cape Canaveral, Florida. | Photo: Miguel J. Rodriguez Carrillo / Getty Images SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos' space company, Blue Origin, has announced the TeraWave network. It says TeraWave will offer bandwidth of up to 6Tb available anywhere on Earth, for both upload and download. The only wrinkle? Even after satellite deployments are scheduled to start near the end of 2027, you probably won't be able to connect directly. That's by design, as former Amazon Alexa boss and current Blue Origin CEO Dave Limp said in a post that it's \"purpose-built for enterprise customers.\" Blue Origin's network has a \"multi-orbit\" design of 5,408 … Read the full story at The Verge.",
          "feed_position": 1
        },
        {
          "source": "Guardian Tech",
          "url": "https://www.theguardian.com/technology/2026/jan/21/blue-origin-satellites-2027-jeff-bezos",
          "published_at": "Wed, 21 Jan 2026 23:19:23 GMT",
          "title": "Bezos’s Blue Origin announces plans to deploy thousands of satellites in 2027",
          "standfirst": "Deployment will serve data centers, governments and businesses, jumping into market dominated by SpaceXJeff Bezos’s space company Blue Origin on Wednesday announced a plan to deploy 5,408 satellites in space for a communications network that will serve data centers, governments and businesses, jumping into a satellite constellation market dominated by Elon Musk’s SpaceX.Deployment of satellites is planned to begin in the last quarter of 2027, Blue Origin said, adding the network will be designed to have “data speeds of up to 6 Tbps anywhere on Earth”. That speed, possible with the satellites’ planned optical communications, is extreme by consumer standards and would make the network key for data processing and large-scale government programs. Blue Origin said the network would be meant to serve a maximum of roughly 100,000 customers. Continue reading...",
          "content": "Deployment will serve data centers, governments and businesses, jumping into market dominated by SpaceXJeff Bezos’s space company Blue Origin on Wednesday announced a plan to deploy 5,408 satellites in space for a communications network that will serve data centers, governments and businesses, jumping into a satellite constellation market dominated by Elon Musk’s SpaceX.Deployment of satellites is planned to begin in the last quarter of 2027, Blue Origin said, adding the network will be designed to have “data speeds of up to 6 Tbps anywhere on Earth”. That speed, possible with the satellites’ planned optical communications, is extreme by consumer standards and would make the network key for data processing and large-scale government programs. Blue Origin said the network would be meant to serve a maximum of roughly 100,000 customers. Continue reading...",
          "feed_position": 1
        }
      ],
      "popularity_score": 2008.0786733333334
    },
    {
      "id": "cluster_48",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 23:33:43 +0000",
      "title": "Judge orders stop to FBI search of devices seized from Washington Post reporter",
      "neutral_headline": "Judge orders stop to FBI search of devices seized from Washington Post reporter",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/judge-orders-stop-to-fbi-search-of-devices-seized-from-washington-post-reporter/",
          "published_at": "Wed, 21 Jan 2026 23:33:43 +0000",
          "title": "Judge orders stop to FBI search of devices seized from Washington Post reporter",
          "standfirst": "Order says gov't must stop search while court reviews Washington Post motions.",
          "content": "A federal judge today ordered the US government to stop searching devices seized from the house of a Washington Post reporter. It may be only a temporary reprieve for the Post and reporter Hannah Natanson, however. Further proceedings will be held on whether the search can resume or whether the government must return the devices. Natanson herself isn't the subject of investigation, but the FBI executed a search warrant at her home and seized her work and personal devices last week as part of an investigation into alleged leaks by a Pentagon contractor. The Post filed a motion to force the return of the reporter's property, and a separate motion for a standstill order that would prevent review of the seized devices until the court rules on whether they must be returned. \"Almost none of the seized data is even potentially responsive to the warrant, which seeks only records received from or relating to a single government contractor,\" a Post court filing today said. \"The seized data is core First Amendment-protected material, and some is protected by the attorney-client privilege.\"Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/judges-gavel-1152x648-1747771043.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/judges-gavel-1152x648-1747771043.jpg",
      "popularity_score": 347.2581177777778
    },
    {
      "id": "cluster_52",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 23:22:14 +0000",
      "title": "Millions of people imperiled through sign-in links sent by SMS",
      "neutral_headline": "Millions of people imperiled through sign-in links sent by SMS",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/01/millions-of-people-imperiled-through-sign-in-links-sent-by-sms/",
          "published_at": "Wed, 21 Jan 2026 23:22:14 +0000",
          "title": "Millions of people imperiled through sign-in links sent by SMS",
          "standfirst": "Even well-known services with millions of users are exposing sensitive data.",
          "content": "Websites that authenticate users through links and codes sent in text messages are imperiling the privacy of millions of people, leaving them vulnerable to scams, identity theft, and other crimes, recently published research has found. The links are sent to people seeking a range of services, including those offering insurance quotes, job listings, and referrals for pet sitters and tutors. To eliminate the hassle of collecting usernames and passwords—and for users to create and enter them—many such services instead require users to provide a cell phone number when signing up for an account. The services then send authentication links or passcodes by SMS when the users want to log in. Easy to execute at scale A paper published last week has found more than 700 endpoints delivering such texts on behalf of more than 175 services that put user security and privacy at risk. One practice that jeopardizes users is the use of links that are easily enumerated, meaning scammers can guess them by simply modifying the security token, which usually appears at the right of a URL. By incrementing or randomly guessing the token—for instance, by first changing 123 to 124 or ABC to ABD and so on—the researchers were able to access accounts belonging to other users. From there, the researchers could view personal details, such as partially completed insurance applications.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/sms-phone-risk-trap-privacy-security-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/sms-phone-risk-trap-privacy-security-1152x648.jpg",
      "popularity_score": 331.06672888888886
    },
    {
      "id": "cluster_55",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 22:51:26 +0000",
      "title": "mRNA cancer vaccine shows protection at 5-year follow-up, Moderna and Merck say",
      "neutral_headline": "MRNA cancer vaccine shows protection at 5-year follow-up, Moderna and Merck say",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/mrna-cancer-vaccine-shows-protection-at-5-year-follow-up-moderna-and-merck-say/",
          "published_at": "Wed, 21 Jan 2026 22:51:26 +0000",
          "title": "mRNA cancer vaccine shows protection at 5-year follow-up, Moderna and Merck say",
          "standfirst": "The vaccines are tailor-made to target each patient's unique cancer.",
          "content": "In a small clinical trial, customized mRNA vaccines against high-risk skin cancers appeared to reduce the risk of cancer recurrence and death by nearly 50 percent over five years when compared with standard treatment alone. That's according to Moderna and Merck, the two pharmaceutical companies that have collaborated on the experimental cancer vaccine, called intismeran autogene (mRNA-4157 or V940). So far, the companies have only reported the top-line results in a press release this week. However, the results align closely with previous, more detailed analyses from the trial, which examined rates of recurrence and death at earlier time points, specifically at two years and three years after the treatment. More data from the trial—a Phase 2 trial—will soon be presented at a medical conference, the companies said. A Phase 3 trial is also underway, with enrollment complete. The ongoing Phase 2 trial included 157 patients who were diagnosed with stage 3 or stage 4 melanoma and were at high risk of having it recur after surgical removal. A standard treatment to prevent recurrence after such surgery is immunotherapy, including Merck's Keytruda (pembrolizumab). This drug essentially enables immune cells, specifically T cells, to attack and kill cancer cells—something they normally do. But, in many types of cancers, including melanoma, cancer cells have the ability to bind to receptors on T cells (called PD-1 receptors), which basically shuts the T cells down. Keytruda works by physically blocking the PD-1 receptors, preventing cancer cells from binding and keeping the T cells activated so they can kill the cancer.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1290558683.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1290558683.jpg",
      "popularity_score": 320.55339555555554
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 21:03:02 +0000",
      "title": "Why adding modern controls to 1996's Tomb Raider simply doesn't work",
      "neutral_headline": "Why adding modern controls to 1996's Tomb Raider simply doesn't work",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/01/the-problem-with-revisiting-tomb-raider-reacclimating-to-tank-controls/",
          "published_at": "Wed, 21 Jan 2026 21:03:02 +0000",
          "title": "Why adding modern controls to 1996's Tomb Raider simply doesn't work",
          "standfirst": "For our C:\\ArsGames series, we look at the controls conundrum of early 3D.",
          "content": "For a lot of the games I've written about in the C:\\ArsGames series, I've come to the conclusion that the games hold up pretty well, despite their age—Master of Orion II, Jill of the Jungle, and Wing Commander Privateer, for example. Each of those have flaws that show now more than ever, but I still had a blast revisiting each of them. This time I'd like to write about one that I think doesn't hold up quite as well for me: For the first time in almost 30 years, I revisited the original Tomb Raider via 2024's Tomb Raider I-III Remastered collection. You might be thinking this is going to be a dunk on the work done on the remaster, but that's not the case, because the core issue with playing 1996's Tomb Raider in 2026 is actually unsolvable, no matter how much care is put into a remaster.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Tomb-Raider-hero-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Tomb-Raider-hero-1152x648.jpg",
      "popularity_score": 313.74672888888887
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 21:50:21 +0000",
      "title": "Trump FCC threatens to enforce equal-time rule on late-night talk shows",
      "neutral_headline": "Trump FCC threatens to enforce equal-time rule on late-night talk shows",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/trump-fcc-tries-to-get-more-republicans-on-late-night-and-daytime-talk-shows/",
          "published_at": "Wed, 21 Jan 2026 21:50:21 +0000",
          "title": "Trump FCC threatens to enforce equal-time rule on late-night talk shows",
          "standfirst": "FCC disputes long-standing view that the shows are exempt from equal-time rule.",
          "content": "The Federal Communications Commission today issued a warning to late-night and daytime talk shows, saying these shows may no longer qualify for an exemption to the FCC's equal-time rule. Because the FCC is chaired by vocal Trump supporter Brendan Carr, changing how the rule is enforced could pressure shows into seeking out more interviews with Republican candidates. The public notice providing what the FCC calls \"guidance on political equal opportunities requirement for broadcast television stations\" appears to be part of the Trump administration's campaign against alleged liberal bias on broadcast TV. Carr, who has eroded the FCC's historical independence from the White House, previously pressured ABC to suspend Jimmy Kimmel and threatened ABC’s The View with the equal-time rule. The Carr FCC's public notice today said that federal rules \"prevent broadcast television stations, which have been given access to a valuable public resource (namely, spectrum), from unfairly putting their thumbs on the scale for one political candidate or set of candidates over another.\" These rules come from \"the decision by Congress that broadcast television stations have an obligation to operate in the public interest—not in any narrow partisan, political interest,\" the Carr FCC said.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/jimmy-kimmel-return-1152x648-1758739114.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/09/jimmy-kimmel-return-1152x648-1758739114.jpg",
      "popularity_score": 309.53534
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 20:37:00 +0000",
      "title": "Kioxia's memory is \"sold out\" for 2026, prolonging a \"high-end and expensive phase\"",
      "neutral_headline": "Kioxia's memory is \"sold out\" for 2026, prolonging a \"high-end and expensive phase\"",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/kioxias-memory-is-sold-out-for-2026-prolonging-a-high-end-and-expensive-phase/",
          "published_at": "Wed, 21 Jan 2026 20:37:00 +0000",
          "title": "Kioxia's memory is \"sold out\" for 2026, prolonging a \"high-end and expensive phase\"",
          "standfirst": "Kioxia is spinning up more manufacturing capacity, but relief will come slowly.",
          "content": "The companies that make RAM and flash memory chips are enjoying record profits because of the AI-induced memory crunch—and they’re also indicating that they don’t expect conditions to improve much if at all in 2026. And while RAM kits have been hit the fastest and hardest by shortages and price increases, we shouldn't expect SSD pricing to improve any time soon, either. That's the message from Shunsuke Nakato (via PC Gamer), managing director of the memory division of Kioxia, the Japanese memory company that was spun off from Toshiba at the end of the 2010s. Nakato says that Kioxia’s manufacturing capacity is sold out through the rest of 2026, driving the market for both enterprise and consumer SSDs to a “high-end and expensive phase.” “There is a sense of crisis that companies will be eliminated the moment they stop investing in AI, so they have no choice but to continue investing,” said Nakato, as reported by the Korean-language publication Digital Daily. Absent a big change in the demand for generative AI data centers, that cycle of investments will keep prices high for the foreseeable future.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/kioxia-ssds-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/kioxia-ssds-1152x648.jpg",
      "popularity_score": 288.31284
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 19:34:14 +0000",
      "title": "Spotify won court order against Anna’s Archive, taking down .org domain",
      "neutral_headline": "Spotify won court order against Anna’s Archive, taking down .org domain",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/annas-archive-said-spotify-scrape-didnt-cause-domain-suspension-it-was-wrong/",
          "published_at": "Wed, 21 Jan 2026 19:34:14 +0000",
          "title": "Spotify won court order against Anna’s Archive, taking down .org domain",
          "standfirst": "Lawsuit was filed under seal; Anna's Archive wasn't notified until after takedown.",
          "content": "When shadow library Anna's Archive lost its .org domain in early January, the controversial site's operator said the suspension didn't appear to have anything to do with its recent mass scraping of Spotify. But it turns out, probably not surprisingly to most people, that the domain suspension resulted from a lawsuit filed by Spotify, along with major record labels Sony, Warner, and Universal Music Group (UMG). The music companies sued Anna's Archive in late December in US District Court for the Southern District of New York, and the case was initially sealed. A judge ordered the case unsealed on January 16 \"because the purpose for which sealing was ordered has been fulfilled.\" Numerous documents were made public on the court docket yesterday, and they explain events around the domain suspension.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spotify-logos-1152x648-1767642275.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/spotify-logos-1152x648-1767642275.jpg",
      "popularity_score": 282.2667288888889
    },
    {
      "id": "cluster_71",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 19:47:27 +0000",
      "title": "Watch a robot swarm \"bloom\" like a garden",
      "neutral_headline": "Watch a robot swarm \"bloom\" like a garden",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/watch-a-robot-swarm-bloom-like-a-garden/",
          "published_at": "Wed, 21 Jan 2026 19:47:27 +0000",
          "title": "Watch a robot swarm \"bloom\" like a garden",
          "standfirst": "The Swarm Garden: An array of modular robot agents that adapt to changing conditions for living architecture.",
          "content": "Researchers at Princeton University have built a swarm of interconnected mini-robots that \"bloom\" like flowers in response to changing light levels in an office. According to their new paper published in the journal Science Robotics, such robotic swarms could one day be used as dynamic facades in architectural designs, enabling buildings to adapt to changing climate conditions as well as interact with humans in creative ways. The authors drew inspiration from so-called \"living architectures,\" such as beehives. Fire ants provide a textbook example of this kind of collective behavior. A few ants spaced well apart behave like individual ants. But pack enough of them closely together, and they behave more like a single unit, exhibiting both solid and liquid properties. You can pour them from a teapot like ants, as Goldman’s lab demonstrated several years ago, or they can link together to build towers or floating rafts—a handy survival skill when, say, a hurricane floods Houston. They also excel at regulating their own traffic flow. You almost never see an ant traffic jam. Naturally scientists are keen to mimic such systems. For instance, in 2018, Georgia Tech researchers built ant-like robots and programmed them to dig through 3D-printed magnetic plastic balls designed to simulate moist soil. Robot swarms capable of efficiently digging underground without jamming would be super beneficial for mining or disaster recovery efforts, where using human beings might not be feasible.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/swarm1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/swarm1-1152x648.jpg",
      "popularity_score": 274.4870066666667
    },
    {
      "id": "cluster_74",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 18:40:21 +0000",
      "title": "Another Jeff Bezos company has announced plans to develop a megaconstellation",
      "neutral_headline": "Another Jeff Bezos company has announced plans to develop a megaconstellation",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/blue-origin-we-want-to-have-a-megaconstellation-too/",
          "published_at": "Wed, 21 Jan 2026 18:40:21 +0000",
          "title": "Another Jeff Bezos company has announced plans to develop a megaconstellation",
          "standfirst": "With data speeds of up to 6Tbps, one could stream a lot of HD movies.",
          "content": "The announcement came out of the blue, from Blue, on Wednesday. The space company founded by Jeff Bezos, Blue Origin, said it was developing a new megaconstellation named TeraWave to deliver data speeds of up to 6Tbps anywhere on Earth. The constellation will consist of 5,408 optically interconnected satellites, with a majority in low-Earth orbit and the remainder in medium-Earth orbit. The satellites in low-Earth orbit will provide up to 144Gbps through radio spectrum, whereas those in medium-Earth orbit will provide higher data rates through optical links.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/G_NEl2bbgAAr100-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/G_NEl2bbgAAr100-1152x648.jpg",
      "popularity_score": 262.36867333333333
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 17:30:58 +0000",
      "title": "Here's Volvo's new EX60 $60,000 electric midsize SUV",
      "neutral_headline": "Here's Volvo's new EX60 $60,000 electric midsize SUV",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/01/heres-volvos-new-ex60-60000-electric-midsize-suv/",
          "published_at": "Wed, 21 Jan 2026 17:30:58 +0000",
          "title": "Here's Volvo's new EX60 $60,000 electric midsize SUV",
          "standfirst": "The EX60 goes into production in April 2026.",
          "content": "After a teaser campaign that included a world exclusive with Ars, Volvo has officially unveiled its next electric vehicle, the EX60. We already knew it would have up to 400 miles of range, according to the US EPA test cycle, and be capable of charging at rates of up to 400 kW. And we learned last week that the EX60 is packed full of powerful computer hardware from Nvidia and Qualcomm, enabling both advanced driver assistance systems and a new AI personal assistant. Today, we got full tech specs for the three different EX60 powertrain variants, as well as a pair of rugged EX60 Cross Country models. P6, P10, P12 The entry-level version of Volvo's next midsize crossover is the EX60 P6. This is a single-motor variant, with 369 hp (275 kW), 354 lb-ft (480 Nm) on tap at the rear wheels. The 80 kWh (usable, 83 kWH gross) battery pack can charge at up to 320 kW and can take as little as 18 minutes to DC charge from 10 to 80 percent. The EX60 will also be the first Volvo model on sale in the US with a built-in NACS port. Range for the P6 version is 310 miles (490 km) when fitted with 20-inch wheels; subtract 10 miles (16 km) for the 21-inch wheels and 20 miles (32 km) for the 22-inch wheels. 0–60 mph (0–98 km/h) takes 5.7 seconds, and like all modern Volvos, the EX60 is speed-limited to 112 mph (180 km/h). (Again, all range estimates are based on the US EPA test cycle; if you see different numbers online at non-US publications, those are using Europe's WLTP test.)Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/JPG-Full-TIM_1154_EX60_DETAIL_HIGH_FRONT-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/JPG-Full-TIM_1154_EX60_DETAIL_HIGH_FRONT-1152x648.jpg",
      "popularity_score": 251.21228444444444
    },
    {
      "id": "cluster_94",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 15:03:39 +0000",
      "title": "Has Gemini surpassed ChatGPT? We put the AI models to the test.",
      "neutral_headline": "Has Gemini surpassed ChatGPT? We put the AI models to the test.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2026/01/has-gemini-surpassed-chatgpt-we-put-the-ai-models-to-the-test/",
          "published_at": "Wed, 21 Jan 2026 15:03:39 +0000",
          "title": "Has Gemini surpassed ChatGPT? We put the AI models to the test.",
          "standfirst": "Did Apple make the right choice in partnering with Google for Siri's AI features?",
          "content": "The last time we did comparative tests of AI models from OpenAI and Google at Ars was in late 2023, when Google's offering was still called Bard. In the roughly two years since, a lot has happened in the world of artificial intelligence. And now that Apple has made the consequential decision to partner with Google Gemini to power the next generation of its Siri voice assistant, we thought it was high time to do some new tests to see where the models from these AI giants stand today. For this test, we're comparing the default models that both OpenAI and Google present to users who don't pay for a regular subscription—ChatGPT 5.2 for OpenAI and Gemini 3.2 Fast for Google. While other models might be more powerful, we felt this test best recreates the AI experience as it would work for the vast majority of Siri users, who don't pay to subscribe to either company's services. As in the past, we'll feed the same prompts to both models and evaluate the results using a combination of objective evaluation and subjective feel. Rather than re-using the relatively simple prompts we ran back in 2023, though, we'll be running these models on an updated set of more complex prompts that we first used when pitting GPT-5 against GPT-4o last summer.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/chatgpt-vs-gemini-apple-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/chatgpt-vs-gemini-apple-1152x648.jpg",
      "popularity_score": 153
    },
    {
      "id": "cluster_99",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 12:15:23 +0000",
      "title": "Wikipedia volunteers spent years cataloging AI tells. Now there's a plugin to avoid them.",
      "neutral_headline": "Wikipedia volunteers spent years cataloging AI tells. Now there's...",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/01/new-ai-plugin-uses-wikipedias-ai-writing-detection-rules-to-help-it-sound-human/",
          "published_at": "Wed, 21 Jan 2026 12:15:23 +0000",
          "title": "Wikipedia volunteers spent years cataloging AI tells. Now there's a plugin to avoid them.",
          "standfirst": "The web's best guide to spotting AI writing has become a manual for hiding it.",
          "content": "On Saturday, tech entrepreneur Siqi Chen released an open source plugin for Anthropic's Claude Code AI assistant that instructs the AI model to stop writing like an AI model. Called \"Humanizer,\" the simple prompt plugin feeds Claude a list of 24 language and formatting patterns that Wikipedia editors have listed as chatbot giveaways. Chen published the plugin on GitHub, where it has picked up over 1,600 stars as of Monday. \"It's really handy that Wikipedia went and collated a detailed list of 'signs of AI writing,'\" Chen wrote on X. \"So much so that you can just tell your LLM to... not do that.\" The source material is a guide from WikiProject AI Cleanup, a group of Wikipedia editors who have been hunting AI-generated articles since late 2023. French Wikipedia editor Ilyas Lebleu founded the project. The volunteers have tagged over 500 articles for review and, in August 2025, published a formal list of the patterns they kept seeing.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/ai_typewriter_getty-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/ai_typewriter_getty-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_112",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 22:35:32 +0000",
      "title": "Verizon starts requiring 365 days of paid service before it will unlock phones",
      "neutral_headline": "Verizon starts requiring 365 days of paid service before it will unlock phones",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/verizon-starts-requiring-365-days-of-paid-service-before-it-will-unlock-phones/",
          "published_at": "Tue, 20 Jan 2026 22:35:32 +0000",
          "title": "Verizon starts requiring 365 days of paid service before it will unlock phones",
          "standfirst": "Verizon changed prepaid brands' policy a week after FCC waived unlocking rule.",
          "content": "Verizon has started enforcing a 365-day lock period on phones purchased through its TracFone division, one week after the Federal Communications Commission waived a requirement that Verizon unlock handsets 60 days after they are activated on its network. Verizon was previously required to unlock phones automatically after 60 days due to restrictions imposed on its spectrum licenses and merger conditions that helped Verizon obtain approval of its purchase of TracFone. But an update applied today to the TracFone unlocking policy said new phones will be locked for at least a year and that each customer will have to request an unlock instead of getting it automatically. The \"new\" TracFone policy is basically a return to the yearlong locking it imposed before Verizon bought the company in 2021. TracFone first agreed to provide unlocking in a 2015 settlement with the Obama-era FCC, which alleged that TracFone failed to comply with a commitment to unlock phones for customers enrolled in the Lifeline subsidy program. TracFone later shortened the locking period from a year to 60 days as a condition of the Verizon merger.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/verizon-1152x648-1752087139.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/verizon-1152x648-1752087139.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_114",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 22:17:02 +0000",
      "title": "Google temporarily disabled YouTube's advanced captions without warning",
      "neutral_headline": "Google temporarily disabled YouTube's advanced captions without warning",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2026/01/google-temporarily-disabled-youtubes-advanced-captions-without-warning/",
          "published_at": "Tue, 20 Jan 2026 22:17:02 +0000",
          "title": "Google temporarily disabled YouTube's advanced captions without warning",
          "standfirst": "Google says SRV3 captions were causing playback errors, so it has \"temporarily\" disabled them.",
          "content": "YouTubers have been increasingly frustrated with Google's management of the platform, with disinformation welcomed back and an aggressive push for more AI (except where Google doesn't like it). So it's no surprise that creators have been up in arms over the suspicious removal of YouTube's advanced SRV3 caption format. You don't have to worry too much just yet—Google says this is only temporary, and it's working on a fix for the underlying bug. Google added support for this custom subtitle format around 2018, giving creators more customization options than with traditional captions. SRV3 (also known as YTT or YouTube Timed Text) allows for custom colors, transparency, animations, fonts, and precise positioning in videos. Uploaders using this format can color-code and position captions to help separate multiple speakers, create sing-along animations, or style them to match the video. Over the last several days, creators who have become accustomed to this level of control have been dismayed to see that YouTube is no longer accepting videos with this Google-created format. Many worried Google had ditched the format entirely, which could be problematic for all those previously uploaded videos.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/06/youtube-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/06/youtube-1152x648.jpg",
      "popularity_score": 145
    },
    {
      "id": "cluster_96",
      "coverage": 1,
      "updated_at": "Wed, 21 Jan 2026 14:33:00 +0000",
      "title": "Zillow removed climate risk scores. This climate expert is restoring them.",
      "neutral_headline": "Zillow removed climate risk scores. This climate expert is restoring them.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/zillow-removed-climate-risk-scores-this-climate-expert-is-restoring-them/",
          "published_at": "Wed, 21 Jan 2026 14:33:00 +0000",
          "title": "Zillow removed climate risk scores. This climate expert is restoring them.",
          "standfirst": "Real estate website scrubbed data under pressure from California real estate brokers.",
          "content": "Even as exposure to floods, fire, and extreme heat increase in the face of climate change, a popular tool for evaluating risk has disappeared from the nation’s leading real estate website. Zillow removed the feature displaying climate risk data to home buyers in November after the California Regional Multiple Listing Service, which provides a database of real estate listings to real estate agents and brokers in the state, questioned the accuracy of the flood risk models on the site. Now, a climate policy expert in California is working to put data back in buyers’ hands.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/floods-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/floods-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_110",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 23:33:57 +0000",
      "title": "Webb reveals a planetary nebula with phenomenal clarity, and it is spectacular",
      "neutral_headline": "Webb reveals a planetary nebula with phenomenal clarity, and it is spectacular",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/01/webb-has-given-us-with-a-stunning-new-view-of-a-well-known-planetary-nebula/",
          "published_at": "Tue, 20 Jan 2026 23:33:57 +0000",
          "title": "Webb reveals a planetary nebula with phenomenal clarity, and it is spectacular",
          "standfirst": "The colors show the star’s final breath transforming into the raw ingredients for new worlds.",
          "content": "The Helix Nebula is one of the most well-known and commonly photographed planetary nebulae because it resembles the \"Eye of Sauron.\" It is also one of the closest bright nebulae to Earth, located approximately 655 light-years from our Solar System. You may not know what this particular nebula looks like when reading its name, but the Hubble Space Telescope has taken some iconic images of it over the years. And almost certainly, you'll recognize a photograph of the Helix Nebula, shown below. Like many objects in astronomy, planetary nebulae have a confusing name, since they are formed not by planets but by stars like our own Sun, though a little larger. Near the end of their lives, these stars shed large amounts of gas in an expanding shell that, however briefly in cosmological time, put on a grand show.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/STScI-01KCMAMZ8ZSMRTR9KKD8Y6EMRJ-1152x648.png"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/STScI-01KCMAMZ8ZSMRTR9KKD8Y6EMRJ-1152x648.png",
      "popularity_score": 139
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 23:22:26 +0000",
      "title": "Zuck stuck on Trump’s bad side: FTC appeals loss in Meta monopoly case",
      "neutral_headline": "Zuck stuck on Trump’s bad side: FTC appeals loss in Meta monopoly case",
      "bullet_summary": [
        "FTC will appeal ruling that found Meta has no monopoly in social networking",
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/zuck-stuck-on-trumps-bad-side-ftc-appeals-loss-in-meta-monopoly-case/",
          "published_at": "Tue, 20 Jan 2026 23:22:26 +0000",
          "title": "Zuck stuck on Trump’s bad side: FTC appeals loss in Meta monopoly case",
          "standfirst": "FTC will appeal ruling that found Meta has no monopoly in social networking.",
          "content": "Still feeling uneasy about Meta's acquisition of Instagram in 2012 and WhatsApp in 2014, the Federal Trade Commission will be appealing a November ruling that cleared Meta of allegations that it holds an illegal monopoly in a market dubbed \"personal social networking.\" The FTC hopes the US Court of Appeals for the District of Columbia will agree that \"robust evidence at trial\" showed that Meta's acquisitions were improper. In the initial trial, the FTC sought a breakup of Meta's apps, with Meta risking forced divestments of Instagram or WhatsApp. In a press release Tuesday, the FTC confirmed that it \"continues to allege\" that \"for over a decade Meta has illegally maintained a monopoly in personal social networking services through anticompetitive conduct—by buying the significant competitive threats it identified in Instagram and WhatsApp.\"Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/zuck-the-monopolist-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/zuck-the-monopolist-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_115",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 21:59:38 +0000",
      "title": "Flesh-eating flies are eating their way through Mexico, CDC warns",
      "neutral_headline": "Flesh-eating flies are eating their way through Mexico, CDC warns",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/01/be-on-the-lookout-for-flesh-eating-flies-cdc-tells-clinicians-in-alert/",
          "published_at": "Tue, 20 Jan 2026 21:59:38 +0000",
          "title": "Flesh-eating flies are eating their way through Mexico, CDC warns",
          "standfirst": "Eight animal cases in Mexico's Tamaulipas spur CDC to warn doctors of festering wounds.",
          "content": "The US Centers for Disease Control and Prevention issued a health alert to clinicians Tuesday, warning that the savage, flesh-eating parasitic fly—the New World Screwworm—is not only approaching the Texas border, but also felling an increasing number of animals in the bordering Mexican state of Tamaulipas. The advisory, released through the agency's Health Alert Network, directs doctors, veterinarians, and other health workers to be on the lookout for patients with wounds teeming with ferocious maggots burrowing into their living flesh. The alert also provides guidance on what to do if any such festering wounds are encountered—namely, remove each and every maggot to prevent the patient from dying, and, under no circumstance allow any of the parasites to survive and escape. The New World Screwworm (NWS) is a fly that lays its eggs—up to 400 at a time—in the wounds, orifices, and mucus membranes of any warm-blooded animal. The eggs hatch into flesh-eating maggots, which look and act much like screws, twisting and boring into their victims while eating them alive.Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2016/11/CSIRO_ScienceImage_115_The_Tip_of_a_Screw_Worm_Fly_Larvae.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2016/11/CSIRO_ScienceImage_115_The_Tip_of_a_Screw_Worm_Fly_Larvae.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_116",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 21:25:30 +0000",
      "title": "Macaque facial gestures are more than just a reflex, study finds",
      "neutral_headline": "Macaque facial gestures are more than just a reflex, study finds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/01/macaque-facial-gestures-are-more-than-just-a-reflex-study-finds/",
          "published_at": "Tue, 20 Jan 2026 21:25:30 +0000",
          "title": "Macaque facial gestures are more than just a reflex, study finds",
          "standfirst": "Study is first to implant micro-electrode arrays to record neurons as they produce facial gestures.",
          "content": "Recent advances in brain-computer interfaces have made it possible to more accurately extract speech from neural signals in humans, but language is just one of the tools we use to communicate. “When my young nephew asks for ice cream before dinner and I say ‘no,’ the meaning is entirely dictated by whether the word is punctuated with a smirk or a stern frown,” says Geena Ianni, a neuroscientist at the University of Pennsylvania. That’s why in the future, she thinks, neural prostheses meant for patients with a stroke or paralysis will decode facial gestures from brain signals in the same way they decode speech. To lay a foundation for these future facial gesture decoders, Ianni and her colleagues designed an experiment to find out how neural circuitry responsible for making faces really works. “Although in recent years neuroscience got a good handle on how the brain perceives facial expressions, we know relatively little about how they are generated,” Ianni says. And it turned out that a surprisingly large part of what neuroscientists assumed about facial gestures was wrong. The natural way For a long time, neuroscientists thought facial gestures in primates stemmed from a neat division of labor in the brain. “Case reports of patients with brain lesions suggested some brain regions were responsible for certain types of emotional expressions while other regions were responsible for volitional movements like speech,” Ianni explains. We’ve developed a clearer picture of speech by tracing the origin of these movements down to the level of individual neurons. But we’ve not done the same for facial expressions. To fill this gap, Ianni and her team designed a study using macaques—social primates that share most of their complex facial musculature with humans.Read full article Comments",
          "feed_position": 18,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2243934190-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/GettyImages-2243934190-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_120",
      "coverage": 1,
      "updated_at": "Tue, 20 Jan 2026 19:24:12 +0000",
      "title": "Netflix to pay all cash for Warner Bros. to fend off Paramount hostile takeover",
      "neutral_headline": "Netflix to pay all cash for Warner Bros. to fend off Paramount hostile takeover",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/01/netflix-to-pay-all-cash-for-warner-bros-to-fend-off-paramount-hostile-takeover/",
          "published_at": "Tue, 20 Jan 2026 19:24:12 +0000",
          "title": "Netflix to pay all cash for Warner Bros. to fend off Paramount hostile takeover",
          "standfirst": "Netflix and Warner seek quick shareholder vote as Paramount tries to upend deal.",
          "content": "Netflix agreed to pay all cash for Warner Bros. Discovery, amending its $72 billion deal in an attempt to fight off Paramount's hostile takeover bid. Netflix originally agreed to buy the company with a mix of cash and stock. To sweeten the offer for shareholders, Netflix and Warner Bros. today announced that Netflix will pay all cash instead. If successful, Netflix's purchase will include HBO Max, WB Studios, and other assets. The price is unchanged at $27.75 per share, and Warner Bros. is targeting an April 2026 shareholder vote. The original plan was for Netflix to buy each Warner Bros. share with $23.25 in cash and $4.50 in Netflix stock.Read full article Comments",
          "feed_position": 19,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/netflix-paramount-wb-icons-1152x648-1767815429.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/netflix-paramount-wb-icons-1152x648-1767815429.jpg",
      "popularity_score": 133
    }
  ]
}