{
  "updated_at": "2025-12-10T07:17:58.104Z",
  "clusters": [
    {
      "id": "cluster_41",
      "coverage": 3,
      "updated_at": "Tue, 09 Dec 2025 21:08:11 +0000",
      "title": "Big Tech joins forces with Linux Foundation to standardize AI agents",
      "neutral_headline": "Big Tech joins forces with Linux Foundation to standardize AI agents",
      "bullet_summary": [
        "The Agentic AI Foundation launches to support MCP, AGENTS",
        "Anthropic, Block, and OpenAI are backing the Linux Foundation’s new Agentic AI Foundation, donating MCP, Goose, and AGENTS"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2025/12/big-tech-joins-forces-with-linux-foundation-to-standardize-ai-agents/",
          "published_at": "Tue, 09 Dec 2025 21:08:11 +0000",
          "title": "Big Tech joins forces with Linux Foundation to standardize AI agents",
          "standfirst": "The Agentic AI Foundation launches to support MCP, AGENTS.md, and goose.",
          "content": "Big Tech has spent the past year telling us we’re living in the era of AI agents, but most of what we’ve been promised is still theoretical. As companies race to turn fantasy into reality, they’ve developed a collection of tools to guide the development of generative AI. A cadre of major players in the AI race, including Anthropic, Block, and OpenAI, has come together to promote interoperability with the newly formed Agentic AI Foundation (AAIF). This move elevates a handful of popular technologies and could make them a de facto standard for AI development going forward. The development path for agentic AI models is cloudy to say the least, but companies have invested so heavily in creating these systems that some tools have percolated to the surface. The AAIF, which is part of the nonprofit Linux Foundation, has been launched to govern the development of three key AI technologies: Model Context Protocol (MCP), goose, and AGENTS.md. MCP is probably the most well-known of the trio, having been open-sourced by Anthropic a year ago. The goal of MCP is to link AI agents to data sources in a standardized way—Anthropic (and now the AAIF) is fond of calling MCP a “USB-C port for AI.” Rather than creating custom integrations for every different database or cloud storage platform, MCP allows developers to quickly and easily connect to any MCP-compliant server.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/GettyImages-1327016094-1152x648.jpg"
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/09/openai-anthropic-and-block-join-new-linux-foundation-effort-to-standardize-the-ai-agent-era/",
          "published_at": "Tue, 09 Dec 2025 17:28:36 +0000",
          "title": "OpenAI, Anthropic, and Block join new Linux Foundation effort to standardize the AI agent era",
          "standfirst": "Anthropic, Block, and OpenAI are backing the Linux Foundation’s new Agentic AI Foundation, donating MCP, Goose, and AGENTS.md to standardize AI agents, boost interoperability, and curb proprietary fragmentation.",
          "content": "Anthropic, Block, and OpenAI are backing the Linux Foundation’s new Agentic AI Foundation, donating MCP, Goose, and AGENTS.md to standardize AI agents, boost interoperability, and curb proprietary fragmentation.",
          "feed_position": 17
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/openai-anthropic-and-block-are-teaming-up-on-ai-agent-standards/",
          "published_at": "Tue, 09 Dec 2025 17:06:58 +0000",
          "title": "OpenAI, Anthropic, and Block Are Teaming Up to Make AI Agents Play Nice",
          "standfirst": "American AI giants are backing a new effort to establish open standards for building agentic software and tools.",
          "content": "American AI giants are backing a new effort to establish open standards for building agentic software and tools.",
          "feed_position": 14,
          "image_url": "https://media.wired.com/photos/693854c57eeef7f25b0423c2/master/pass/ai-agents-play-nice-1.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/12/GettyImages-1327016094-1152x648.jpg",
      "popularity_score": 3009.8369155555556
    },
    {
      "id": "cluster_54",
      "coverage": 2,
      "updated_at": "Tue, 09 Dec 2025 19:41:40 +0000",
      "title": "Slack CEO Denise Dresser to join OpenAI as chief revenue officer",
      "neutral_headline": "Slack CEO Denise Dresser to join OpenAI as chief revenue officer",
      "bullet_summary": [
        "Reported by TechCrunch, Wired Tech"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2025/12/09/slack-ceo-denise-dresser-to-join-openai-as-chief-revenue-officer/",
          "published_at": "Tue, 09 Dec 2025 19:41:40 +0000",
          "title": "Slack CEO Denise Dresser to join OpenAI as chief revenue officer",
          "standfirst": "OpenAI says that Dresser will be responsible for the company's revenue strategy in enterprise and customer success.",
          "content": "OpenAI says that Dresser will be responsible for the company's revenue strategy in enterprise and customer success.",
          "feed_position": 10
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/slack-ceo-denise-dresser-joins-openai-chief-revenue-officer/",
          "published_at": "Tue, 09 Dec 2025 18:35:01 +0000",
          "title": "OpenAI Hires Slack CEO as New Chief Revenue Officer",
          "standfirst": "A memo obtained by WIRED confirms Denise Dresser's departure from Slack. She is now headed to OpenAI.",
          "content": "A memo obtained by WIRED confirms Denise Dresser's departure from Slack. She is now headed to OpenAI.",
          "feed_position": 11,
          "image_url": "https://media.wired.com/photos/693859e8da23a81834d81ac9/master/pass/OpenAI-Hires-Slack-CEO-Denise-Dresser-as-Chief-Revenue-Officer-Business-2181104969.jpg"
        }
      ],
      "featured_image": "https://media.wired.com/photos/693859e8da23a81834d81ac9/master/pass/OpenAI-Hires-Slack-CEO-Denise-Dresser-as-Chief-Revenue-Officer-Business-2181104969.jpg",
      "popularity_score": 2008.394971111111
    },
    {
      "id": "cluster_35",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 22:34:39 +0000",
      "title": "Over 250 people quarantined in South Carolina as measles outbreak rages",
      "neutral_headline": "Over 250 people quarantined in South Carolina as measles outbreak rages",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2025/12/over-250-people-quarantined-in-south-carolina-as-measles-outbreak-rages/",
          "published_at": "Tue, 09 Dec 2025 22:34:39 +0000",
          "title": "Over 250 people quarantined in South Carolina as measles outbreak rages",
          "standfirst": "16 cases are linked to a church, which followed exposures at four schools last week.",
          "content": "A measles outbreak that began in South Carolina at the start of October is showing no signs of slowing as officials on Tuesday reported 27 new cases since Friday. Those cases bring the outbreak total to 111. The southern state’s outbreak now rivals outbreaks ongoing in Utah and Arizona, which have tallied 115 and 176 cases, respectively. The outbreaks are threatening to cost the country its measles elimination status, which was earned in 2000 after vaccination efforts stopped the virus from spreading continuously. If the current transmission of the virus isn’t halted by January, the virus will have circulated for 12 consecutive months, marking it once again as an endemic disease in the US. In an update on Tuesday, South Carolina’s health department suggested the spread is far from over. Of the state’s 27 new cases, 16 were linked to exposure at a church, the Way of Truth Church in Inman. And amid the new cases, new exposures were identified at Inman Intermediate School. That’s on top of exposures announced Friday at four other schools in the region, which led to well over 100 students being quarantined.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/GettyImages-2152300024-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/02/GettyImages-2152300024-1152x648.jpg",
      "popularity_score": 344.2780266666667
    },
    {
      "id": "cluster_58",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 18:53:21 +0000",
      "title": "Supreme Court appears likely to approve Trump’s firing of FTC Democrat",
      "neutral_headline": "Supreme Court appears likely to approve Trump’s firing of FTC Democrat",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/supreme-court-appears-likely-to-approve-trumps-firing-of-ftc-democrat/",
          "published_at": "Tue, 09 Dec 2025 18:53:21 +0000",
          "title": "Supreme Court appears likely to approve Trump’s firing of FTC Democrat",
          "standfirst": "Conservative justices seem ready to back Trump control of independent agencies.",
          "content": "The Supreme Court’s conservative justices appear ready to overturn a 90-year-old precedent that said the president cannot fire a Federal Trade Commission member without cause. A ruling for Trump would give him more power over the FTC and potentially other independent agencies such as the Federal Communications Commission. Former FTC Commissioner Rebecca Kelly Slaughter, a Democrat, sued Trump after he fired both Democrats from the commission in March. Slaughter’s case rests largely on the 1935 ruling in Humphrey’s Executor v. United States, in which the Supreme Court unanimously held that the president can only remove FTC commissioners for inefficiency, neglect of duty, or malfeasance in office. Chief Justice John Roberts said during yesterday’s oral arguments that Humphrey’s Executor is a “dried husk” despite being the “primary authority” that Slaughter’s legal team is relying on. Roberts said the court’s 2020 ruling in Seila Law made it “pretty clear… that Humphrey’s Executor is just a dried husk of whatever people used to think it was because, in the opinion itself, it described the powers of the agency it was talking about, and they’re vanishingly insignificant, have nothing to do with what the FTC looks like today.”Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-supreme-court-1152x648.jpg",
      "popularity_score": 320.58969333333334
    },
    {
      "id": "cluster_66",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 17:47:01 +0000",
      "title": "Court: “Because Trump said to” may not be a legally valid defense",
      "neutral_headline": "Court: “Because Trump said to” may not be a legally valid defense",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/trumps-order-blocking-wind-development-thrown-out-by-court/",
          "published_at": "Tue, 09 Dec 2025 17:47:01 +0000",
          "title": "Court: “Because Trump said to” may not be a legally valid defense",
          "standfirst": "The \"arbitrary and capricious\" standard strikes down another administration action.",
          "content": "On Monday, US District Court Judge Patti Saris vacated a Trump executive order that brought a halt to all offshore wind power development, as well as some projects on land. That order had called for the suspension of all permitting for wind power on federal land and waters pending a review of current practices. This led states and an organization representing wind power companies to sue, claiming among other things that the suspension was arbitrary and capricious. Over 10 months since the relevant government agencies were ordered to start a re-evaluation of the permitting process, testimony revealed that they had barely begun to develop the concept of a review. As such, the only reason they could offer in defense of the suspension consisted of Trump’s executive order and a Department of the Interior memo implementing it. “Whatever level of explanation is required when deviating from longstanding agency practice,” Judge Saris wrote, “this is not it.” Lifting Trump’s suspension does not require the immediate approval of any wind projects. Instead, the relevant agencies are likely to continue following Trump’s wishes and slow-walking any leasing and licensing processes, which may force states and project owners to sue individually. But it does provide a legal backdrop for any suits that ultimately occur, one in which the government’s actions have little justification beyond Trump’s personal animosity toward wind power.Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235990625-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235990625-1024x648.jpg",
      "popularity_score": 314.4841377777778
    },
    {
      "id": "cluster_62",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 18:09:05 +0000",
      "title": "NASA astronauts will have their own droid when they go back to the Moon",
      "neutral_headline": "NASA astronauts will have their own droid when they go back to the Moon",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/lunar-outpost-rover-to-study-lunar-dust-alongside-artemis-astronauts-on-moon/",
          "published_at": "Tue, 09 Dec 2025 18:09:05 +0000",
          "title": "NASA astronauts will have their own droid when they go back to the Moon",
          "standfirst": "NASA crew will be the first astronauts to work with a robot on a celestial body other than Earth.",
          "content": "B-9 had Will Robinson. Twiki had Buck Rogers. And, of course, C-3PO and R2-D2 had Luke Skywalker. Now, in a scenario straight out of science fiction, MAPP will have whoever NASA names to the crew of the second Artemis mission to land on the moon. The space agency has selected Lunar Outpost’s Mobile Autonomous Prospecting Platform, or MAPP, to become the first robotic rover to operate on the moon alongside astronauts. Although its tasks will be far simpler than those of the robots seen on TV and in the movies, the autonomous four-wheeled MAPP will help scientists learn more about the crew’s surroundings. Science instruments on the rover will characterize the surface plasma and behavior of the dust in the lunar environment. “The Apollo era taught us that the further humanity is from Earth, the more dependent we are on science to protect and sustain human life on other planets,” said Nicky Fox, NASA’s associate administrator for science, in a statement. “By deploying these… science instruments on the lunar surface, our proving ground, NASA is leading the world in the creation of humanity’s interplanetary survival guide to ensure the health and safety of our spacecraft and human explorers as we begin our epic journey back to the Moon.”Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/news-120825a-lg-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/news-120825a-lg-1152x648.jpg",
      "popularity_score": 309.85191555555554
    },
    {
      "id": "cluster_73",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 17:00:28 +0000",
      "title": "Google is reviving wearable gesture controls, but only for the Pixel Watch 4",
      "neutral_headline": "Google is reviving wearable gesture controls, but only for the Pixel Watch 4",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/google-is-reviving-wearable-gesture-controls-but-only-for-the-pixel-watch-4/",
          "published_at": "Tue, 09 Dec 2025 17:00:28 +0000",
          "title": "Google is reviving wearable gesture controls, but only for the Pixel Watch 4",
          "standfirst": "Google will let you select and dismiss with a gesture, but only on the newest watch.",
          "content": "Long ago, Google’s Android-powered wearables had hands-free navigation gestures. Those fell by the wayside as Google shredded its wearable strategy over and over, but gestures are back, baby. The Pixel Watch 4 is getting an update that adds several gestures, one of which is straight out of the Apple playbook. When the update hits devices, the Pixel Watch 4 will gain a double pinch gesture like the Apple Watch has. By tapping your thumb and forefinger together, you can answer or end calls, pause timers, and more. The watch will also prompt you at times when you can use the tap gesture to control things. In previous incarnations of Google-powered watches, a quick wrist turn gesture would scroll through lists. In the new gesture system, that motion dismisses what’s on the screen. For example, you can clear a notification from the screen or dismiss an incoming call. Pixel Watch 4 owners will also enjoy this one when the update arrives.Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Pixel-watch-4-1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Pixel-watch-4-1-1152x648.jpg",
      "popularity_score": 306.7083044444444
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 16:10:45 +0000",
      "title": "Brazil weakens Amazon protections days after COP30",
      "neutral_headline": "Brazil weakens Amazon protections days after COP30",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/days-after-cop30-brazil-weakened-amazon-safeguards/",
          "published_at": "Tue, 09 Dec 2025 16:10:45 +0000",
          "title": "Brazil weakens Amazon protections days after COP30",
          "standfirst": "Backed by powerful corporations, nations are giving public false choices: Environmental protection or economic growth.",
          "content": "Despite claims of environmental leadership and promises to preserve the Amazon rainforest ahead of COP30, Brazil is stripping away protections for the region’s vital ecosystems faster than workers dismantled the tents that housed the recent global climate summit in Belém. On Nov. 27, less than a week after COP30 ended, a powerful political bloc in Brazil’s National Congress, representing agribusiness, and development interests, weakened safeguards for the Amazon’s rivers, forests, and Indigenous communities. The rollback centered on provisions in an environmental licensing bill passed by the government a few months before COP30. The law began to take shape well before, during the Jair Bolsonaro presidency from 2019 to 2023. It reflected the deregulatory agenda of the rural caucus, the Frente Parlamentar da Agropecuária, which wielded significant power during his term and remains influential today.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1249347312-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1249347312-1152x648.jpg",
      "popularity_score": 274.8796933333333
    },
    {
      "id": "cluster_78",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 16:00:29 +0000",
      "title": "Pompeii construction site confirms recipe for Roman concrete",
      "neutral_headline": "Pompeii construction site confirms recipe for Roman concrete",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2025/12/study-confirms-romans-used-hot-mixing-to-make-concrete/",
          "published_at": "Tue, 09 Dec 2025 16:00:29 +0000",
          "title": "Pompeii construction site confirms recipe for Roman concrete",
          "standfirst": "Latest results from a recently discovered ancient Roman construction site confirm earlier findings.",
          "content": "Back in 2023, we reported on MIT scientists’ conclusion that the ancient Romans employed “hot mixing” with quicklime, among other strategies, to make their famous concrete, giving the material self-healing functionality. The only snag was that this didn’t match the recipe as described in historical texts. Now the same team is back with a fresh analysis of samples collected from a recently discovered site that confirms the Romans did indeed use hot mixing, according to a new paper published in the journal Nature Communications. As we’ve reported previously, like today’s Portland cement (a basic ingredient of modern concrete), ancient Roman concrete was basically a mix of a semi-liquid mortar and aggregate. Portland cement is typically made by heating limestone and clay (as well as sandstone, ash, chalk, and iron) in a kiln. The resulting clinker is then ground into a fine powder with just a touch of added gypsum to achieve a smooth, flat surface. But the aggregate used to make Roman concrete was made up of fist-sized pieces of stone or bricks. In his treatise De architectura (circa 30 CE), the Roman architect and engineer Vitruvius wrote about how to build concrete walls for funerary structures that could endure for a long time without falling into ruin. He recommended the walls be at least two feet thick, made of either “squared red stone or of brick or lava laid in courses.” The brick or volcanic rock aggregate should be bound with mortar composed of hydrated lime and porous fragments of glass and crystals from volcanic eruptions (known as volcanic tephra).Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/concrete1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/concrete1-1152x648.jpg",
      "popularity_score": 267.7085822222222
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 16:00:25 +0000",
      "title": "In a major new report, scientists build rationale for sending astronauts to Mars",
      "neutral_headline": "In a major new report, scientists build rationale for sending astronauts to Mars",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/in-a-major-new-report-scientists-build-rationale-for-sending-astronauts-to-mars/",
          "published_at": "Tue, 09 Dec 2025 16:00:25 +0000",
          "title": "In a major new report, scientists build rationale for sending astronauts to Mars",
          "standfirst": "\"Everyone is inspired by this because it's becoming real.\"",
          "content": "Sending astronauts to the red planet will be a decades-long activity and cost many billions of dollars. So why should NASA undertake such a bold mission? A new report published Tuesday, titled “A Science Strategy for the Human Exploration of Mars,” represents the answer from leading scientists and engineers in the United States: finding whether life exists, or once did, beyond Earth. “We’re searching for life on Mars,” said Dava Newman, a professor in the Department of Aeronautics and Astronautics at Massachusetts Institute of Technology and co-chair of the committee that wrote the report, in an interview with Ars. “The answer to the question ‘are we alone‘ is always going to be ‘maybe,’ unless it becomes yes.”Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/file-20250327-56-dflaq1-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/file-20250327-56-dflaq1-1152x648.jpg",
      "popularity_score": 265.7074711111111
    },
    {
      "id": "cluster_81",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 15:35:39 +0000",
      "title": "Asked why we need Golden Dome, the man in charge points to a Hollywood film",
      "neutral_headline": "Asked why we need Golden Dome, the man in charge points to a Hollywood film",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2025/12/asked-why-we-need-golden-dome-the-man-in-charge-points-to-a-hollywood-film/",
          "published_at": "Tue, 09 Dec 2025 15:35:39 +0000",
          "title": "Asked why we need Golden Dome, the man in charge points to a Hollywood film",
          "standfirst": "\"If they see how prepared we are, no one starts a nuclear war.\"",
          "content": "Near the end of the film A House of Dynamite, a fictional American president portrayed by Idris Elba sums up the theory of nuclear deterrence. “Just being ready is the point, right?” Elba says. “It keeps people in check. Keeps the world straight. If they see how prepared we are, no one starts a nuclear war.” There’s a lot that goes wrong in the film, namely the collapse of deterrence itself. For more than 60 years, the US military has used its vast arsenal of nuclear weapons, constantly deployed on Navy submarines, at Air Force bomber bases, and in Minuteman missile fields, as a way of saying, “Don’t mess with us.” In the event of a first strike against the United States, an adversary would be assured of an overwhelming nuclear response, giving rise to the concept of mutual assured destruction.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/5208709-1152x648-1765274456.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/5208709-1152x648-1765274456.jpg",
      "popularity_score": 247.29469333333333
    },
    {
      "id": "cluster_85",
      "coverage": 1,
      "updated_at": "Tue, 09 Dec 2025 15:00:56 +0000",
      "title": "Pebble maker announces Index 01, a smart-ish ring for under $100",
      "neutral_headline": "Pebble maker announces Index 01, a smart-ish ring for under $100",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/resurrected-pebble-maker-announces-a-kind-of-smart-ring-for-capturing-audio-notes/",
          "published_at": "Tue, 09 Dec 2025 15:00:56 +0000",
          "title": "Pebble maker announces Index 01, a smart-ish ring for under $100",
          "standfirst": "The Pebble Index 01 isn't quite a smart ring, but it can do some smart things.",
          "content": "Nearly a decade after Pebble’s nascent smartwatch empire crumbled, the brand is staging a comeback with new wearables. The Pebble Core Duo 2 and Core Time 2 are a natural evolution of the company’s low-power smartwatch designs, but its next wearable is something different. The Index 01 is a ring, but you probably shouldn’t call it a smart ring. The Index does just one thing—capture voice notes—but the firm says it does that one thing extremely well. Most of today’s smart rings offer users the ability to track health stats, along with various minor smartphone integrations. With all the sensors and data collection, these devices can cost as much as a smartwatch and require frequent charging. The Index 01 doesn’t do any of that. It contains a Bluetooth radio, a microphone, a hearing aid battery, and a physical button. You press the button, record your note, and that’s it. The company says the Index 01 will run for years on a charge and will cost just $75 during the preorder period. After that, it will go up to $99. Core Devices, the new home of Pebble, says the Index is designed to be worn on your index finger (get it?), where you can easily mash the device’s button with your thumb. Unlike recording notes with a phone or smartwatch, you don’t need both hands to create voice notes with the Index.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Index01-polished-silver-rocks-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/Index01-polished-silver-rocks-1152x648.jpg",
      "popularity_score": 136.7160822222222
    },
    {
      "id": "cluster_106",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 21:54:58 +0000",
      "title": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
      "neutral_headline": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2025/12/iceblock-lawsuit-trump-admin-bragged-about-demanding-app-store-removal/",
          "published_at": "Mon, 08 Dec 2025 21:54:58 +0000",
          "title": "ICEBlock lawsuit: Trump admin bragged about demanding App Store removal",
          "standfirst": "ICEBlock creator sues to protect apps that are crowd-sourcing ICE sightings.",
          "content": "In a lawsuit filed against top Trump administration officials on Monday, Apple was accused of caving to unconstitutional government demands by removing an Immigration and Customs Enforcement-spotting app from the App Store with more than a million users. In his complaint, Joshua Aaron, creator of ICEBlock, cited a Fox News interview in which Attorney General Pam Bondi “made plain that the United States government used its regulatory power to coerce a private platform to suppress First Amendment-protected expression.” Suing Bondi—along with Department of Homeland Security Secretary Kristi Noem, Acting Director of ICE Todd Lyons, White House “Border Czar” Thomas D. Homan, and unnamed others—Aaron further alleged that US officials made false statements and “unlawful threats” to criminally investigate and prosecute him for developing ICEBlock.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235825531-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2235825531-1024x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_110",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 18:36:16 +0000",
      "title": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
      "neutral_headline": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gadgets/2025/12/paramount-says-it-could-get-antitrust-approval-for-wbd-before-netflix/",
          "published_at": "Mon, 08 Dec 2025 18:36:16 +0000",
          "title": "Paramount tries to swipe Warner Bros. from Netflix with a hostile takeover",
          "standfirst": "Paramount has already proven it can get a controversial merger done.",
          "content": "Netflix won the bidding war for Warner Bros. Discovery’s (WBD’s) streaming and movie studio businesses last week. But Paramount Skydance isn’t relenting on its dreams of owning WBD and is pushing forward with a hostile takeover bid. On Friday, Netflix announced that it had agreed to pay an equity value of $72 billion, or an approximate total enterprise value of $82.7 billion, for WBD’s streaming and film businesses, as well as its film and TV libraries. The deal includes HBO and the HBO Max streaming service but not WBD’s cable channels, which are to be split off ahead of the acquisition into a separate company called Discovery Global. Netflix said WBD’s split should conclude in Q3 2026. Paramount has different plans, though.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250240969-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250240969-1024x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_114",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 14:57:11 +0000",
      "title": "Meta offers EU users ad-light option in push to end investigation",
      "neutral_headline": "Meta offers EU users ad-light option in push to end investigation",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/information-technology/2025/12/meta-offers-eu-users-ad-light-option-in-push-to-end-investigation/",
          "published_at": "Mon, 08 Dec 2025 14:57:11 +0000",
          "title": "Meta offers EU users ad-light option in push to end investigation",
          "standfirst": "Facebook agrees to change \"pay or consent\" model after talks with European Commission.",
          "content": "Meta has agreed to make changes to its “pay or consent” business model in the EU, seeking to agree to a deal that avoids further regulatory fines at a time when the bloc’s digital rule book is drawing anger from US authorities. On Tuesday, the European Commission announced that the social media giant had offered users an alternative choice of Facebook and Instagram services that would show them fewer personalized advertisements. The offer follows an EU investigation into Meta’s policy of requiring users either to consent to data tracking or pay for an ad-free service. The Financial Times reported on optimism that an agreement could be reached between the parties in October.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1359152239-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-1359152239-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_118",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 12:00:14 +0000",
      "title": "Please send help. I can’t stop playing these roguelikes.",
      "neutral_headline": "Please send help. I can’t stop playing these roguelikes.",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2025/12/please-send-help-i-cant-stop-playing-these-roguelikes/",
          "published_at": "Mon, 08 Dec 2025 12:00:14 +0000",
          "title": "Please send help. I can’t stop playing these roguelikes.",
          "standfirst": "2025 was a very good year for my favorite genre.",
          "content": "It’s time to admit, before God and the good readers of Ars Technica, that I have a problem. I love roguelikes. Reader, I can’t get enough of them. If there’s even a whisper of a hot new roguelike on Steam, I’m there. You may call them arcane, repetitive, or maddeningly difficult; I call them heaven. The second best part of video games is taking a puny little character and, over 100 hours, transforming that adventurer into a god of destruction. The best thing about video games is doing the same thing in under an hour. Beat a combat encounter, get an upgrade. Enter a new area, choose a new item. Put together a build and watch it sing. If you die—immediately ending your ascent and returning you to the beginning of the game—you’ll often make a pit stop at a home base to unlock new goodies to help you on your next run. (Some people distiguish between roguelikes and “roguelites,” with the latter including permanent, between-run upgrades. For simplicity’s sake, I’ll use “roguelike” as an umbrella term).Read full article Comments",
          "feed_position": 17,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hades2_dec22_01-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/hades2_dec22_01-1152x648.jpg",
      "popularity_score": 133
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 17:01:37 +0000",
      "title": "F1 in Abu Dhabi: And that’s the championship",
      "neutral_headline": "F1 in Abu Dhabi: And that’s the championship",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/f1-in-abu-dhabi-and-thats-the-championship/",
          "published_at": "Mon, 08 Dec 2025 17:01:37 +0000",
          "title": "F1 in Abu Dhabi: And that’s the championship",
          "standfirst": "A three-way fight down to the wire as the ground effect era comes to a close.",
          "content": "The 2025 Formula 1 World Championship drew to a close this past weekend in Abu Dhabi, and with it came the end of the current generation of cars. After a grueling 24 races, the title was decided in a three-way fight by the finest of margins; just two points, less than half a percent, separated the winning driver from second place when the checkered flag waved on Sunday. Coming into Abu Dhabi, McLaren’s Lando Norris was, if not a comfortable favorite, then at least the driver with the highest odds of prevailing. After a strong start to the season, the British driver’s form dipped at the Dutch Grand Prix. But he bounced back, retaking the championship lead from his Australian teammate Oscar Piastri in Mexico in October. For much of the season, it seemed to be a two-car race. McLaren had a clear car advantage and two strong drivers, suggesting a repeat of the years we saw Lewis Hamilton and Nico Rosberg duking it out to bring home titles for Mercedes. But that didn’t figure on Red Bull developing its car late in the season. New boss Laurent Mekies has revitalized the energy drinks squad, and four-time champion Max Verstappen was able to close inexorably toward the McLaren drivers in the points with a string of sublime performances.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250341495-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/GettyImages-2250341495-1152x648.jpg",
      "popularity_score": 130
    },
    {
      "id": "cluster_113",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 15:49:32 +0000",
      "title": "A big bike on a budget: Lectric’s XPress 750",
      "neutral_headline": "A big bike on a budget: Lectric’s XPress 750",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2025/12/lectric-xpress-750-a-full-sized-bike-for-the-budget-minded/",
          "published_at": "Mon, 08 Dec 2025 15:49:32 +0000",
          "title": "A big bike on a budget: Lectric’s XPress 750",
          "standfirst": "A budget e-bike that offers more than you might expect.",
          "content": "Almost every bit of bike testing I’ve done starts out the same way. After assembling the bike, I set the seatpost to its maximum recommended height, take it on a short test ride, and try to figure out new and creative phrasing to describe the same old problem: The frame isn’t quite big enough to accommodate my legs. While I’m on the tall side at a bit over 6 feet (~190 cm), I’m definitely not abnormally large. Yet very few e-bike manufacturers seem to be interested in giving people my height a comfortable ride. So imagine my surprise when, within two blocks of my first ride on the XPress 750, I had to pull off to the side of the street and lower the seat. This was especially notable given that the XPress is a budget bike (currently on sale for just under $1,000.00) that is only offered in a single frame size. So kudos to Lectric for giving me a comfortable and enjoyable ride, and doing so with a lot of features I wouldn’t expect at this price point. That said, hitting that price necessitated some significant compromises. We’ll discuss those in detail so you can get a sense of whether any of them will get in the way of your riding enjoyment.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_1802-1152x648.jpeg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/IMG_1802-1152x648.jpeg",
      "popularity_score": 130
    },
    {
      "id": "cluster_115",
      "coverage": 1,
      "updated_at": "Mon, 08 Dec 2025 14:03:30 +0000",
      "title": "The Boys gears up for a supe-ocalypse in S5 teaser",
      "neutral_headline": "The Boys gears up for a supe-ocalypse in S5 teaser",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/culture/2025/12/the-boys-gears-up-for-a-supe-ocalypse-in-s5-teaser/",
          "published_at": "Mon, 08 Dec 2025 14:03:30 +0000",
          "title": "The Boys gears up for a supe-ocalypse in S5 teaser",
          "standfirst": "\"So how about it, you lot? One last go?\"",
          "content": "Prime Video dropped an extended teaser for the fifth and final season of The Boys—based on the comic book series of the same name by Garth Ennis and Darick Robertson—during CCXP in Sao Paulo, Brazil. And it looks like we’re getting nothing less than a full-on Supe-ocalypse as an all-powerful Homelander seeks revenge on The Boys. (Spoilers for prior seasons of The Boys and S2 of Gen V below.) Things were not looking good for our antiheroes after the S4 finale. They managed to thwart the assassination of newly elected US President Robert Singer, but new Vought CEO/evil supe Sister Sage (Susan Heyward) essentially overthrew the election and installed Senator Steve Calhoun (David Andrews) as president. Calhoun declared martial law, and naturally, Homelander (Antony “Give Him an Emmy Already” Starr) swore loyalty as his chief enforcer. Butcher (Karl Urban) and Annie (Erin Moriarty) escaped, but the rest of The Boys were rounded up and placed in re-education—er, “Freedom”—camps.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/boys2-1152x648-1765118776.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2025/12/boys2-1152x648-1765118776.jpg",
      "popularity_score": 130
    }
  ]
}