{
  "updated_at": "2026-02-07T23:22:47.109Z",
  "clusters": [
    {
      "id": "cluster_12",
      "coverage": 3,
      "updated_at": "Sat, 07 Feb 2026 18:23:04 +0000",
      "title": "New York lawmakers propose a three-year pause on new data centers",
      "neutral_headline": "New York lawmakers propose a three-year pause on new data centers",
      "bullet_summary": [
        "Reported by TechCrunch, TechMeme, Wired Tech"
      ],
      "items": [
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/07/new-york-lawmakers-propose-a-three-year-pause-on-new-data-centers/",
          "published_at": "Sat, 07 Feb 2026 18:23:04 +0000",
          "title": "New York lawmakers propose a three-year pause on new data centers",
          "standfirst": "Although the bill’s prospects are uncertain, New York is at least the sixth state to consider pausing construction of new data centers.",
          "content": "Although the bill’s prospects are uncertain, New York is at least the sixth state to consider pausing construction of new data centers.",
          "feed_position": 1
        },
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260206/p29#a260206p29",
          "published_at": "Fri, 06 Feb 2026 20:40:00 -0500",
          "title": "New York lawmakers propose a bill to impose a three-year moratorium on data center development, making NY at least the sixth state to introduce such legislation (Molly Taft/Wired)",
          "standfirst": "Molly Taft / Wired: New York lawmakers propose a bill to impose a three-year moratorium on data center development, making NY at least the sixth state to introduce such legislation &mdash; Red and blue states alike have introduced legislation in recent weeks that would halt data center development, citing concerns from climate to high energy prices.",
          "content": "Molly Taft / Wired: New York lawmakers propose a bill to impose a three-year moratorium on data center development, making NY at least the sixth state to introduce such legislation &mdash; Red and blue states alike have introduced legislation in recent weeks that would halt data center development, citing concerns from climate to high energy prices.",
          "feed_position": 14,
          "image_url": "http://www.techmeme.com/260206/i29.jpg"
        },
        {
          "source": "Wired Tech",
          "url": "https://www.wired.com/story/new-york-is-the-latest-state-to-consider-a-data-center-pause/",
          "published_at": "Fri, 06 Feb 2026 18:58:46 +0000",
          "title": "New York Is the Latest State to Consider a Data Center Pause",
          "standfirst": "Red and blue states alike have introduced legislation in recent weeks that would halt data center development, citing concerns from climate to high energy prices.",
          "content": "Red and blue states alike have introduced legislation in recent weeks that would halt data center development, citing concerns from climate to high energy prices.",
          "feed_position": 13,
          "image_url": "https://media.wired.com/photos/6985ffc322e26927f08c23c1/master/pass/sci-ny-datacenters-2163725750.jpg"
        }
      ],
      "featured_image": "http://www.techmeme.com/260206/i29.jpg",
      "popularity_score": 3015.0046919444444
    },
    {
      "id": "cluster_29",
      "coverage": 2,
      "updated_at": "Sat, 07 Feb 2026 13:00:00 +0000",
      "title": "How to track your sleep and view your sleep data in Apple Health",
      "neutral_headline": "How to track your sleep and view your sleep data in Apple Health",
      "bullet_summary": [
        "Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company)",
        "You'll unlock stickers that can be applied to said dice and they’ll interact with each other too",
        "Its creator, Daniel Zeller, (Zellah Games) has revealed a new project",
        "\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html",
          "published_at": "Sat, 07 Feb 2026 13:00:00 +0000",
          "title": "How to track your sleep and view your sleep data in Apple Health",
          "standfirst": "Apple Health brings sleep tracking, scheduling and long-term analysis into one place, with your iPhone acting as the hub and the Apple Watch doing the overnight monitoring. Once everything is set up, Apple Health can show how long you slept each night, how consistent your sleep schedule is and how much time you spend in different sleep stages. Here is how to get started, track your sleep and review your data.Sleep tracking in Apple Health relies on two things: You need to set up Sleep in the Health app on your iPhone, and you need a compatible Apple Watch to wear to bed. While you can set sleep schedules without a watch, detailed sleep data — including sleep stages — requires an Apple Watch.How to set up Sleep in Apple HealthSleep tracking is available on all watchOS 8 (or later) models and setup starts in the Health app on your iPhone. Open Health, tap Browse and then tap Sleep. If this is your first time setting it up, you will see an option to get started. Apple Health will guide you through choosing a sleep goal, setting a bedtime and wake-up time and deciding whether you want one sleep schedule for every day or different schedules for weekdays and weekends.During setup, you can also enable sleep reminders and a wind-down period. Wind Down reduces distractions before bedtime by activating features like Focus mode and dimming notifications at a set time before sleep. These settings are optional but they help keep your schedule consistent, which improves the quality of the data Apple Health collects over time.Once Sleep is configured, Apple Health automatically syncs those settings to your Apple Watch. You can adjust your sleep schedule later by returning to the Sleep section in Health and tapping Full Schedule and Options. Any changes you make here update on both your iPhone and Apple Watch.How to prepare your Apple Watch for sleep trackingTo track sleep, your Apple Watch needs to be worn overnight and have enough battery to last until morning. If the battery drops below 30 percent before bedtime, your watch will prompt you to charge it first. Sleep tracking also relies on Sleep Focus which activates automatically based on your sleep schedule. Once Sleep Focus has been set, open the Settings app on your Apple Watch, tap Sleep and ensure that Track Sleep with Apple Watch is turned on. With both features enabled your watch can monitor sleep automatically without any manual start or stop each night. Comfort matters when wearing a watch to bed, so many people prefer a softer band for sleep. As long as the watch fits securely and stays in contact with your wrist, it can track sleep without issue.The Apple Watch Series 11 on a person's wrist, showing a ring with three segmented arcs encircling a Sleep Score of 53 and the description \"OK\" in the bottom left.Cherlynn Low for EngadgetHow Apple Watch tracks your sleepWhen Sleep Focus is active, the Apple Watch uses its accelerometer and heart rate sensor to detect when you are asleep and awake. Newer models also track sleep stages, including time spent in REM, core and deep sleep. Apple Health combines this information into a single overnight record that appears in the Sleep section the next morning.You do not need to start or stop sleep tracking manually. As long as you follow your sleep schedule or enable Sleep Focus before bed, the Apple Watch automatically does everything else. If you wake up early or go to bed later than planned, Apple Health adjusts the data based on actual movement and heart rate rather than just your scheduled times. In addition, some Apple Watch models (SE 3 or higher) support on-device Siri, enabling you to ask questions such as “how much sleep did I have last night?” for a more immediate response. How to view your sleep data in Apple HealthTo see your sleep data, open the Health app on your iPhone and tap Browse, then Sleep. At the top of the screen, you will see a chart showing how long you slept the previous night. Tapping this chart reveals a detailed breakdown, including time asleep, time in bed and sleep stages (if available).Scrolling down shows trends over longer periods. You can switch between daily, weekly, monthly and six-month views to see patterns in your sleep duration and consistency. Apple Health also highlights whether you are meeting your sleep goal and how regular your schedule has been.Under Highlights, Apple Health may surface insights such as changes in average sleep time, variations in sleep stages or your nightly sleep score. Sleep scores provide a simplified summary of how well you slept, and is based on factors such as duration, consistency and restfulness. These summaries update automatically as more data is collected over time.Understanding sleep stages and trendsIf your Apple Watch supports sleep stages, Apple Health displays how much time you spent in REM, core and deep sleep. These stages give context to your overall sleep quality, though Apple emphasizes trends over individual nights. Occasional short nights or unusual stage distributions are normal.Over time, Apple Health makes it easier to spot patterns. Consistently short sleep durations, irregular bedtimes or frequent awakenings become clearer when viewing weekly or monthly summaries. This makes the Sleep section useful not just for nightly check-ins but for understanding longer-term habits.Editing and managing sleep dataApple Health allows you to add or edit sleep data if needed manually. In the Sleep section, tap Add Data to log sleep that was not recorded automatically. This can be useful if you forget to wear your watch or take a nap without it.You can also manage which devices contribute sleep data by scrolling to the bottom of the Sleep screen and tapping Data Sources and Access. This is helpful if you use third-party sleep apps or multiple devices.Once set up, sleep tracking in Apple Health runs quietly in the background. With a consistent schedule and a charged Apple Watch, your sleep data builds into a clear picture of your nightly rest, all stored securely within Apple’s health platform.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html?src=rss",
          "content": "Apple Health brings sleep tracking, scheduling and long-term analysis into one place, with your iPhone acting as the hub and the Apple Watch doing the overnight monitoring. Once everything is set up, Apple Health can show how long you slept each night, how consistent your sleep schedule is and how much time you spend in different sleep stages. Here is how to get started, track your sleep and review your data.Sleep tracking in Apple Health relies on two things: You need to set up Sleep in the Health app on your iPhone, and you need a compatible Apple Watch to wear to bed. While you can set sleep schedules without a watch, detailed sleep data — including sleep stages — requires an Apple Watch.How to set up Sleep in Apple HealthSleep tracking is available on all watchOS 8 (or later) models and setup starts in the Health app on your iPhone. Open Health, tap Browse and then tap Sleep. If this is your first time setting it up, you will see an option to get started. Apple Health will guide you through choosing a sleep goal, setting a bedtime and wake-up time and deciding whether you want one sleep schedule for every day or different schedules for weekdays and weekends.During setup, you can also enable sleep reminders and a wind-down period. Wind Down reduces distractions before bedtime by activating features like Focus mode and dimming notifications at a set time before sleep. These settings are optional but they help keep your schedule consistent, which improves the quality of the data Apple Health collects over time.Once Sleep is configured, Apple Health automatically syncs those settings to your Apple Watch. You can adjust your sleep schedule later by returning to the Sleep section in Health and tapping Full Schedule and Options. Any changes you make here update on both your iPhone and Apple Watch.How to prepare your Apple Watch for sleep trackingTo track sleep, your Apple Watch needs to be worn overnight and have enough battery to last until morning. If the battery drops below 30 percent before bedtime, your watch will prompt you to charge it first. Sleep tracking also relies on Sleep Focus which activates automatically based on your sleep schedule. Once Sleep Focus has been set, open the Settings app on your Apple Watch, tap Sleep and ensure that Track Sleep with Apple Watch is turned on. With both features enabled your watch can monitor sleep automatically without any manual start or stop each night. Comfort matters when wearing a watch to bed, so many people prefer a softer band for sleep. As long as the watch fits securely and stays in contact with your wrist, it can track sleep without issue.The Apple Watch Series 11 on a person's wrist, showing a ring with three segmented arcs encircling a Sleep Score of 53 and the description \"OK\" in the bottom left.Cherlynn Low for EngadgetHow Apple Watch tracks your sleepWhen Sleep Focus is active, the Apple Watch uses its accelerometer and heart rate sensor to detect when you are asleep and awake. Newer models also track sleep stages, including time spent in REM, core and deep sleep. Apple Health combines this information into a single overnight record that appears in the Sleep section the next morning.You do not need to start or stop sleep tracking manually. As long as you follow your sleep schedule or enable Sleep Focus before bed, the Apple Watch automatically does everything else. If you wake up early or go to bed later than planned, Apple Health adjusts the data based on actual movement and heart rate rather than just your scheduled times. In addition, some Apple Watch models (SE 3 or higher) support on-device Siri, enabling you to ask questions such as “how much sleep did I have last night?” for a more immediate response. How to view your sleep data in Apple HealthTo see your sleep data, open the Health app on your iPhone and tap Browse, then Sleep. At the top of the screen, you will see a chart showing how long you slept the previous night. Tapping this chart reveals a detailed breakdown, including time asleep, time in bed and sleep stages (if available).Scrolling down shows trends over longer periods. You can switch between daily, weekly, monthly and six-month views to see patterns in your sleep duration and consistency. Apple Health also highlights whether you are meeting your sleep goal and how regular your schedule has been.Under Highlights, Apple Health may surface insights such as changes in average sleep time, variations in sleep stages or your nightly sleep score. Sleep scores provide a simplified summary of how well you slept, and is based on factors such as duration, consistency and restfulness. These summaries update automatically as more data is collected over time.Understanding sleep stages and trendsIf your Apple Watch supports sleep stages, Apple Health displays how much time you spent in REM, core and deep sleep. These stages give context to your overall sleep quality, though Apple emphasizes trends over individual nights. Occasional short nights or unusual stage distributions are normal.Over time, Apple Health makes it easier to spot patterns. Consistently short sleep durations, irregular bedtimes or frequent awakenings become clearer when viewing weekly or monthly summaries. This makes the Sleep section useful not just for nightly check-ins but for understanding longer-term habits.Editing and managing sleep dataApple Health allows you to add or edit sleep data if needed manually. In the Sleep section, tap Add Data to log sleep that was not recorded automatically. This can be useful if you forget to wear your watch or take a nap without it.You can also manage which devices contribute sleep data by scrolling to the bottom of the Sleep screen and tapping Data Sources and Access. This is helpful if you use third-party sleep apps or multiple devices.Once set up, sleep tracking in Apple Health runs quietly in the background. With a consistent schedule and a charged Apple Watch, your sleep data builds into a clear picture of your nightly rest, all stored securely within Apple’s health platform.This article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/how-to-track-your-sleep-and-view-your-sleep-data-in-apple-health-130000023.html?src=rss",
          "feed_position": 8,
          "image_url": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/acf51d20-9296-11f0-9146-7e82dd205a74"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html",
          "published_at": "Sat, 07 Feb 2026 12:00:00 +0000",
          "title": "Hotline Miami meets football, the power of video editing and other new indie games worth checking out",
          "standfirst": "Welcome to our latest roundup of what's going on in the indie game space. As always, we've got a bunch of neat games to tell you about. Perhaps I'll tear myself away from playing as Chappell Roan in Fortnite or Jetpack Cat in Overwatch long enough to check more of them out.Thanks to the folks at Aftermath, I learned about a short, text-based game from Woe Industries from a while back called You Have Billions Invested In Generative AI. Surprisingly enough, you take on the role of a venture capitalist who has plowed gobs of money into genAI technology and might be starting to have doubts about that investment. Other characters warn you about the dangers of the tech and real-life headlines showing the impact of genAI hallucinations pop up. It's tagged as a horror game, for what it's worth. It's both satirical and all too real, and it's pretty funny. Plus, any game that allows me to yell at Noam Chomsky is A-OK in my book. You can play You Have Billions Invested In Generative AI for free on Itch.io.New releasesTackle for Loss had a very timely arrival this week, just ahead of a certain other big, real-life game. This is a football-themed take on action-heavy, top-down games like Hotline Miami. Developer Indifferent Penguin took some inspiration from the Taken film series as well — you take on the role of a CTE-afflicted former football player who sets out to rescue his kidnapped daughter.The combat sounds pretty interesting here. You need to clear out all of the bad guys on each floor of a multistory building before you can progress, but you only have four offensive actions at your disposal each time (this draws from the four-down format of football). You'll need to plan things out before you go on the attack, not least because your character and the enemies all die in a single hit.Tackle for Loss is out now on Steam. It'll usually run you $11, but it's 15 percent off until February 12. Trust Me, I Nailed It is an intriguing turn-based strategy game from Team Afternoon and publisher Jungle Game Lab. A useless warrior hires you as a video editor to make them look like a true hero capable of slaying any beast. Enemy attacks and other actions appear on the edit timeline as pre-recorded footage, and the idea is to plot out the warrior's movements around those. You have post-processing visual effects tricks at your disposal, so you can let the warrior teleport and convert low-power strikes into critical hits.It's a fun idea, and a reminder (as if we should need one in the current climate) not to always take videos at face value. Trust Me, I Nailed It is on Steam now and it's free-to-play.Tomb of the Bloodletter is a spin on the roguelike deckbuilder genre that I haven't really seen before. Your deck consists of magic powers that are applied to letters of the alphabet. Spelling out words using these Magicks can result in powerful combinations, particularly if you use the same letter multiple times. That's right, this is a typing game — a roguelike deckbuilder that the likes of Wordle players might be interested in.It's really about coming up with words that put the right letters in a specific order. For instance, certain letters are more effective if you place them at the end of a word. So, this should get your brain ticking. Tomb of the Bloodletter — from Ethan's Secretions and indie.io — debuted during the Steam Typing Fest. It'll typically cost $8, but there's a 20 percent discount until February 19.Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company). It's set in the same universe as Secret Door's Sunderfolk. The action plays out on a hexagonal board with randomized rooms and enemies. Positioning will be key, and finding synergies between the abilities of the playable characters will put you in good stead.Shadowstone will hit Steam in early access later this year for $15. It's also coming to the Epic Games Store.Meanwhile, a major update for Sunderfolk is set to go live on March 10. It will introduce a new tank-style character and two fresh sets of missions. Secret Door will also add two much-requested features to PC versions: online multiplayer and — so you don't have to use your phone to play the game anymore — mouse and keyboard controls.I really loved Planet of Lana and the sequel is among my most-anticipated games of this year. There's now a release date for the upcoming puzzle platformer. Wishfully and Thunderful Publishing are bringing it to Steam, Xbox, PlayStation and Nintendo Switch on March 5. It'll also be on Game Pass on day one.A Planet of Lana II: Children of the Leaf demo will hit Steam, Xbox and PlayStation on February 11. It will arrive on Switch a bit later.Is Sticker/Ball the first Ball x Pit-like? I'm not entirely sure. Still, it is now firmly on my radar. Instead of firing balls at a horde of constantly-advancing enemies, here you'll shoot them at dice to earn points. You'll unlock stickers that can be applied to said dice and they’ll interact with each other too. For instance, spiders can create webs and these can catch flies that are attracted to poop stickers. The trailer describes another interaction, \"frog jumped and triggered cigarette pack.\" Frogs can also hijack spaceships, apparently, and there's a bouncing DVD (well, \"VID\") logo. There are more than 100 types of stickers and dozens of different enemies.I don't really understand what's going on in the trailer, but it's somehow making my brain happy, so this is going on my wishlist. Solo dev Bilge is behind Sticker/Ball, which is coming to Steam soon through the help of publisher Future Friends Games. A demo is available now, so that's my weekend sorted.Skate City has long been one of the best games on Apple Arcade. Its creator, Daniel Zeller, (Zellah Games) has revealed a new project. Skate Style is billed as a \"next-gen skateboarding game with high-end graphics.\" You'll be able to take to the virtual streets of Barcelona and Prague to show off your best moves. What could help Skate Style really stand out from the pack is the animation editor, which enables you to create completely new tricks. The game is slated to have an \"advanced\" character creation tool as well as mod support, so there'll be a high level of customization available. A Skate Style demo is available on Steam now. The full game should land on PC later this year. Here's hoping the soundtrack can match up to those from the Tony Hawk's Pro Skater series.Crimson Capes is billed as a 2D Soulslike action RPG with four playable characters, elemental magic, more than 25 bosses, swordfighting, lots of secrets, co-op, optional hunts with randomized dungeons and invasions from other players. That all sounds neat enough, but most exciting to me here is the pixel-art, rotoscoped animation work. It looks modern and retro at the same time, and I'd love to see this sort of style in more games. I also dig that you get a PDF instruction manual and game guide as well as a printable world map when you buy the game.You (and I) won't have to wait long to play Crimson Capes, which is from Poor Locke. It's coming to Steam on February 12 for $15, though you'll get 10 percent off if you pick it up within the first nine days. Console versions are in the pipeline too. This article originally appeared on Engadget at https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html?src=rss",
          "content": "Welcome to our latest roundup of what's going on in the indie game space. As always, we've got a bunch of neat games to tell you about. Perhaps I'll tear myself away from playing as Chappell Roan in Fortnite or Jetpack Cat in Overwatch long enough to check more of them out.Thanks to the folks at Aftermath, I learned about a short, text-based game from Woe Industries from a while back called You Have Billions Invested In Generative AI. Surprisingly enough, you take on the role of a venture capitalist who has plowed gobs of money into genAI technology and might be starting to have doubts about that investment. Other characters warn you about the dangers of the tech and real-life headlines showing the impact of genAI hallucinations pop up. It's tagged as a horror game, for what it's worth. It's both satirical and all too real, and it's pretty funny. Plus, any game that allows me to yell at Noam Chomsky is A-OK in my book. You can play You Have Billions Invested In Generative AI for free on Itch.io.New releasesTackle for Loss had a very timely arrival this week, just ahead of a certain other big, real-life game. This is a football-themed take on action-heavy, top-down games like Hotline Miami. Developer Indifferent Penguin took some inspiration from the Taken film series as well — you take on the role of a CTE-afflicted former football player who sets out to rescue his kidnapped daughter.The combat sounds pretty interesting here. You need to clear out all of the bad guys on each floor of a multistory building before you can progress, but you only have four offensive actions at your disposal each time (this draws from the four-down format of football). You'll need to plan things out before you go on the attack, not least because your character and the enemies all die in a single hit.Tackle for Loss is out now on Steam. It'll usually run you $11, but it's 15 percent off until February 12. Trust Me, I Nailed It is an intriguing turn-based strategy game from Team Afternoon and publisher Jungle Game Lab. A useless warrior hires you as a video editor to make them look like a true hero capable of slaying any beast. Enemy attacks and other actions appear on the edit timeline as pre-recorded footage, and the idea is to plot out the warrior's movements around those. You have post-processing visual effects tricks at your disposal, so you can let the warrior teleport and convert low-power strikes into critical hits.It's a fun idea, and a reminder (as if we should need one in the current climate) not to always take videos at face value. Trust Me, I Nailed It is on Steam now and it's free-to-play.Tomb of the Bloodletter is a spin on the roguelike deckbuilder genre that I haven't really seen before. Your deck consists of magic powers that are applied to letters of the alphabet. Spelling out words using these Magicks can result in powerful combinations, particularly if you use the same letter multiple times. That's right, this is a typing game — a roguelike deckbuilder that the likes of Wordle players might be interested in.It's really about coming up with words that put the right letters in a specific order. For instance, certain letters are more effective if you place them at the end of a word. So, this should get your brain ticking. Tomb of the Bloodletter — from Ethan's Secretions and indie.io — debuted during the Steam Typing Fest. It'll typically cost $8, but there's a 20 percent discount until February 19.Upcoming Shadowstone is an upcoming turn-based tactical co-op roguelike for up to four players from developer Secret Door and Dreamhaven (Blizzard co-founder and ex-CEO Mike Morhaime's company). It's set in the same universe as Secret Door's Sunderfolk. The action plays out on a hexagonal board with randomized rooms and enemies. Positioning will be key, and finding synergies between the abilities of the playable characters will put you in good stead.Shadowstone will hit Steam in early access later this year for $15. It's also coming to the Epic Games Store.Meanwhile, a major update for Sunderfolk is set to go live on March 10. It will introduce a new tank-style character and two fresh sets of missions. Secret Door will also add two much-requested features to PC versions: online multiplayer and — so you don't have to use your phone to play the game anymore — mouse and keyboard controls.I really loved Planet of Lana and the sequel is among my most-anticipated games of this year. There's now a release date for the upcoming puzzle platformer. Wishfully and Thunderful Publishing are bringing it to Steam, Xbox, PlayStation and Nintendo Switch on March 5. It'll also be on Game Pass on day one.A Planet of Lana II: Children of the Leaf demo will hit Steam, Xbox and PlayStation on February 11. It will arrive on Switch a bit later.Is Sticker/Ball the first Ball x Pit-like? I'm not entirely sure. Still, it is now firmly on my radar. Instead of firing balls at a horde of constantly-advancing enemies, here you'll shoot them at dice to earn points. You'll unlock stickers that can be applied to said dice and they’ll interact with each other too. For instance, spiders can create webs and these can catch flies that are attracted to poop stickers. The trailer describes another interaction, \"frog jumped and triggered cigarette pack.\" Frogs can also hijack spaceships, apparently, and there's a bouncing DVD (well, \"VID\") logo. There are more than 100 types of stickers and dozens of different enemies.I don't really understand what's going on in the trailer, but it's somehow making my brain happy, so this is going on my wishlist. Solo dev Bilge is behind Sticker/Ball, which is coming to Steam soon through the help of publisher Future Friends Games. A demo is available now, so that's my weekend sorted.Skate City has long been one of the best games on Apple Arcade. Its creator, Daniel Zeller, (Zellah Games) has revealed a new project. Skate Style is billed as a \"next-gen skateboarding game with high-end graphics.\" You'll be able to take to the virtual streets of Barcelona and Prague to show off your best moves. What could help Skate Style really stand out from the pack is the animation editor, which enables you to create completely new tricks. The game is slated to have an \"advanced\" character creation tool as well as mod support, so there'll be a high level of customization available. A Skate Style demo is available on Steam now. The full game should land on PC later this year. Here's hoping the soundtrack can match up to those from the Tony Hawk's Pro Skater series.Crimson Capes is billed as a 2D Soulslike action RPG with four playable characters, elemental magic, more than 25 bosses, swordfighting, lots of secrets, co-op, optional hunts with randomized dungeons and invasions from other players. That all sounds neat enough, but most exciting to me here is the pixel-art, rotoscoped animation work. It looks modern and retro at the same time, and I'd love to see this sort of style in more games. I also dig that you get a PDF instruction manual and game guide as well as a printable world map when you buy the game.You (and I) won't have to wait long to play Crimson Capes, which is from Poor Locke. It's coming to Steam on February 12 for $15, though you'll get 10 percent off if you pick it up within the first nine days. Console versions are in the pipeline too. This article originally appeared on Engadget at https://www.engadget.com/gaming/hotline-miami-meets-football-the-power-of-video-editing-and-other-new-indie-games-worth-checking-out-120000628.html?src=rss",
          "feed_position": 10
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/technology/what-the-openclaw-moment-means-for-enterprises-5-big-takeaways",
          "published_at": "Fri, 06 Feb 2026 22:50:00 GMT",
          "title": "What the OpenClaw moment means for enterprises: 5 big takeaways",
          "standfirst": "The \"OpenClaw moment\" represents the first time autonomous AI agents have successfully \"escaped the lab\" and moved into the hands of the general workforce. Originally developed by Austrian engineer Peter Steinberger as a hobby project called \"Clawdbot\" in November 2025, the framework went through a rapid branding evolution to \"Moltbot\" before settling on \"OpenClaw\" in late January 2026. Unlike previous chatbots, OpenClaw is designed with \"hands\"—the ability to execute shell commands, manage local files, and navigate messaging platforms like WhatsApp and Slack with persistent, root-level permissions.This capability — and the uptake of what was then called Moltbot by many AI power users on X — directly led another entrepreneur, Matt Schlicht, to develop Moltbook, a social network where thousands of OpenClaw-powered agents autonomously sign up and interact. The result has been a series of bizarre, unverified reports that have set the tech world ablaze: agents reportedly forming digital \"religions\" like Crustafarianism, hiring human micro-workers for digital tasks on another website, \"Rentahuman,\" and in some extreme unverified cases, attempting to lock their own human creators out of their credentials.For IT leaders, the timing is critical. This week, the release of Claude Opus 4.6 and OpenAI’s Frontier agent creation platform signaled that the industry is moving from single agents to \"agent teams.\" Simultaneously, the \"SaaSpocalypse\"—a massive market correction that wiped over $800 billion from software valuations—has proven that the traditional seat-based licensing model is under existential threat.So how should enterprise technical decision-makers think through this fast-moving start to the year, and how can they start to understand what OpenClaw means for their businesses? I spoke to a small group of leaders at the forefront of enterprise AI adoption this week to get their thoughts. Here&#x27;s what I learned:1. The death of over-engineering: productive AI works on \"garbage\" dataThe prevailing wisdom once suggested that enterprises needed massive infrastructure overhauls and perfectly curated data sets before AI could be useful. The OpenClaw moment has shattered that myth, proving that modern models can navigate messy, uncurated data by treating \"intelligence as a service.\"\"The first takeaway is the amount of preparation that we need to do to make AI productive,\" says Tanmai Gopal, Co-founder & CEO at PromptQL, a well-funded enterprise data engineering and consulting firm. \"There is a surprising insight there: you actually don&#x27;t need to do too much preparation. Everybody thought we needed new software and new AI-native companies to come and do things. It will catalyze more disruption as leadership realizes that we don&#x27;t actually need to prep so much to get AI to be productive. We need to prep in different ways. You can just let it be and say, &#x27;go read all of this context and explore all of this data and tell me where there are dragons or flaws.&#x27;\"\"The data is already there,\" agreed Rajiv Dattani, co-founder of AIUC (the AI Underwriting Corporation), which has developed the AIUC-1 standard for AI agents as part of a consortium with leaders from Anthropic, Google, CISCO, Stanford and MIT. \"But the compliance and the safeguards, and most importantly, the institutional trust is not. How can you ensure your agentic systems don&#x27;t go off and go full MechaHitler and start offending people or causing problems?\" Hence why Dattani&#x27;s company, AUIC, provides a certification standard, AIUC-1, that enterprises can put agents through in order to obtain insurance that backs them up in event they do cause problems. Without putting OpenClaw agents or other similar agents through such a process, enterprises are likely less ready to accept the consequences and costs of autonomy gone awry. 2. The rise of the \"secret cyborgs\": shadow IT is the new normalWith OpenClaw amassing over 160,000 GitHub stars, employees are deploying local agents through the back door to stay productive. This creates a \"Shadow IT\" crisis where agents often run with full user-level permissions, potentially creating backdoors into corporate systems (as Wharton School of Business Professor Ethan Mollick has written, many employees are secretly adopting AI to get ahead at work and obtain more leisure time, without informing superiors or the organization). Now, executives are actually observing this trend in realtime as employees deploy OpenClaw on work machines without authorization.\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal. \"There are companies finding engineers who have given OpenClaw access to their devices. In larger enterprises, you&#x27;re going to notice that you&#x27;ve given root-level access to your machine. People want tools so tools can do their jobs, but enterprises are concerned.\"Brianne Kimmel, Founder & Managing Partner of venture capital firm Worklife Ventures, views this through a talent-retention lens. \"People are trying these on evenings and weekends, and it’s hard for companies to ensure employees aren’t trying the latest technologies. From my perspective, we&#x27;ve seen how that really allows teams to stay sharp. I have always erred on the side of encouraging, especially early-career folks, to try all of the latest tools.\"3. The collapse of seat-based pricing as a viable business modelThe 2026 \"SaaSpocalypse\" saw massive value erased from software indices as investors realized agents could replace human headcount. If an autonomous agent can perform the work of dozens of human users, the traditional \"per-seat\" business model becomes a liability for legacy vendors.\"If you have AI that can log into a product and do all the work, why do you need 1,000 users at your company to have access to that tool?\" Hamal asks. \"Anyone that does user-based pricing—it&#x27;s probably a real concern. That&#x27;s probably what you&#x27;re seeing with the decay in SaaS valuations, because anybody that is indexed to users or discrete units of &#x27;jobs to be done&#x27; needs to rethink their business model.\"4. Transitioning to an \"AI coworker\" modelThe release of Claude Opus 4.6 and OpenAI’s Frontier this week already signals a shift from single agents to coordinated \"agent teams.\" In this environment, the volume of AI-generated code and content is so high that traditional human-led review is no longer physically possible.\"Our senior engineers just cannot keep up with the volume of code being generated; they can&#x27;t do code reviews anymore,\" Gopal notes. \"Now we have an entirely different product development lifecycle where everyone needs to be trained to be a product person. Instead of doing code reviews, you work on a code review agent that people maintain. You&#x27;re looking at software that was 100% vibe-coded... it&#x27;s glitchy, it&#x27;s not perfect, but dude, it works.\"\"The productivity increases are impressive,\" Dattani concurred. \"It&#x27;s clear that we are at the onset of a major shift in business globally, but each business will need to approach that slightly differently depending on their specific data security and safety requirements. Remember that even while you&#x27;re trying to outdo your competition, they are bound by the same rules and regulations as you — and it&#x27;s worth it to take time to get it right, start small, don&#x27;t try to do too much at once.\" 5. Future outlook: voice interfaces, personality, and global scalingThe experts I spoke to all see a future where \"vibe working\" becomes the norm. Local, personality-driven AI—including through voice interfaces like Wispr or ElevenLabs powered OpenClaw agents—will become the primary interface for work, while agents handle the heavy lifting of international expansion.\"Voice is the primary interface for AI; it keeps people off their phones and improves quality of life,\" says Kimmel. \"The more you can give AI a personality that you&#x27;ve uniquely designed, the better the experience. Previously, you&#x27;d need to hire a GM in a new country and build a translation team. Now, companies can think international from day one with a localized lens.\"Hamal adds a broader perspective on the global stakes: \"We have knowledge worker AGI. It&#x27;s proven it can be done. Security is a concern that will rate-limit enterprise adoption, which means they&#x27;re more vulnerable to disruption from the low end of the market who don&#x27;t have the same concerns.\"Best practices for enterprise leaders seeking to embrace agentic AI capabilities at workAs OpenClaw and similar autonomous frameworks proliferate, IT departments must move beyond blanket bans toward structured governance. Use the following checklist to manage the \"Agentic Wave\" safely:Implement Identity-Based Governance: Every agent must have a strong, attributable identity tied to a human owner or team. Use frameworks like IBC (Identity, Boundaries, Context) to track who an agent is and what it is allowed to do at any moment.Enforce Sandbox Requirements: Prohibit OpenClaw from running on systems with access to live production data. All experimentation should occur in isolated, purpose-built sandboxes on segregated hardware.Audit Third-Party \"Skills\": Recent reports indicate nearly 20% of skills in the ClawHub registry contain vulnerabilities or malicious code. Mandate a \"white-list only\" policy for approved agent plugins.Disable Unauthenticated Gateways: Early versions of OpenClaw allowed \"none\" as an authentication mode. Ensure all instances are updated to current versions where strong authentication is mandatory and enforced by default.Monitor for \"Shadow Agents\": Use endpoint detection tools to scan for unauthorized OpenClaw installations or abnormal API traffic to external LLM providers.Update AI Policy for Autonomy: Standard Generative AI policies often fail to address \"agents.\" Update policies to explicitly define human-in-the-loop requirements for high-risk actions like financial transfers or file system modifications.",
          "content": "The \"OpenClaw moment\" represents the first time autonomous AI agents have successfully \"escaped the lab\" and moved into the hands of the general workforce. Originally developed by Austrian engineer Peter Steinberger as a hobby project called \"Clawdbot\" in November 2025, the framework went through a rapid branding evolution to \"Moltbot\" before settling on \"OpenClaw\" in late January 2026. Unlike previous chatbots, OpenClaw is designed with \"hands\"—the ability to execute shell commands, manage local files, and navigate messaging platforms like WhatsApp and Slack with persistent, root-level permissions.This capability — and the uptake of what was then called Moltbot by many AI power users on X — directly led another entrepreneur, Matt Schlicht, to develop Moltbook, a social network where thousands of OpenClaw-powered agents autonomously sign up and interact. The result has been a series of bizarre, unverified reports that have set the tech world ablaze: agents reportedly forming digital \"religions\" like Crustafarianism, hiring human micro-workers for digital tasks on another website, \"Rentahuman,\" and in some extreme unverified cases, attempting to lock their own human creators out of their credentials.For IT leaders, the timing is critical. This week, the release of Claude Opus 4.6 and OpenAI’s Frontier agent creation platform signaled that the industry is moving from single agents to \"agent teams.\" Simultaneously, the \"SaaSpocalypse\"—a massive market correction that wiped over $800 billion from software valuations—has proven that the traditional seat-based licensing model is under existential threat.So how should enterprise technical decision-makers think through this fast-moving start to the year, and how can they start to understand what OpenClaw means for their businesses? I spoke to a small group of leaders at the forefront of enterprise AI adoption this week to get their thoughts. Here&#x27;s what I learned:1. The death of over-engineering: productive AI works on \"garbage\" dataThe prevailing wisdom once suggested that enterprises needed massive infrastructure overhauls and perfectly curated data sets before AI could be useful. The OpenClaw moment has shattered that myth, proving that modern models can navigate messy, uncurated data by treating \"intelligence as a service.\"\"The first takeaway is the amount of preparation that we need to do to make AI productive,\" says Tanmai Gopal, Co-founder & CEO at PromptQL, a well-funded enterprise data engineering and consulting firm. \"There is a surprising insight there: you actually don&#x27;t need to do too much preparation. Everybody thought we needed new software and new AI-native companies to come and do things. It will catalyze more disruption as leadership realizes that we don&#x27;t actually need to prep so much to get AI to be productive. We need to prep in different ways. You can just let it be and say, &#x27;go read all of this context and explore all of this data and tell me where there are dragons or flaws.&#x27;\"\"The data is already there,\" agreed Rajiv Dattani, co-founder of AIUC (the AI Underwriting Corporation), which has developed the AIUC-1 standard for AI agents as part of a consortium with leaders from Anthropic, Google, CISCO, Stanford and MIT. \"But the compliance and the safeguards, and most importantly, the institutional trust is not. How can you ensure your agentic systems don&#x27;t go off and go full MechaHitler and start offending people or causing problems?\" Hence why Dattani&#x27;s company, AUIC, provides a certification standard, AIUC-1, that enterprises can put agents through in order to obtain insurance that backs them up in event they do cause problems. Without putting OpenClaw agents or other similar agents through such a process, enterprises are likely less ready to accept the consequences and costs of autonomy gone awry. 2. The rise of the \"secret cyborgs\": shadow IT is the new normalWith OpenClaw amassing over 160,000 GitHub stars, employees are deploying local agents through the back door to stay productive. This creates a \"Shadow IT\" crisis where agents often run with full user-level permissions, potentially creating backdoors into corporate systems (as Wharton School of Business Professor Ethan Mollick has written, many employees are secretly adopting AI to get ahead at work and obtain more leisure time, without informing superiors or the organization). Now, executives are actually observing this trend in realtime as employees deploy OpenClaw on work machines without authorization.\"It&#x27;s not an isolated, rare thing; it&#x27;s happening across almost every organization,\" warns Pukar Hamal, CEO & Founder of enterprise AI security diligence firm SecurityPal. \"There are companies finding engineers who have given OpenClaw access to their devices. In larger enterprises, you&#x27;re going to notice that you&#x27;ve given root-level access to your machine. People want tools so tools can do their jobs, but enterprises are concerned.\"Brianne Kimmel, Founder & Managing Partner of venture capital firm Worklife Ventures, views this through a talent-retention lens. \"People are trying these on evenings and weekends, and it’s hard for companies to ensure employees aren’t trying the latest technologies. From my perspective, we&#x27;ve seen how that really allows teams to stay sharp. I have always erred on the side of encouraging, especially early-career folks, to try all of the latest tools.\"3. The collapse of seat-based pricing as a viable business modelThe 2026 \"SaaSpocalypse\" saw massive value erased from software indices as investors realized agents could replace human headcount. If an autonomous agent can perform the work of dozens of human users, the traditional \"per-seat\" business model becomes a liability for legacy vendors.\"If you have AI that can log into a product and do all the work, why do you need 1,000 users at your company to have access to that tool?\" Hamal asks. \"Anyone that does user-based pricing—it&#x27;s probably a real concern. That&#x27;s probably what you&#x27;re seeing with the decay in SaaS valuations, because anybody that is indexed to users or discrete units of &#x27;jobs to be done&#x27; needs to rethink their business model.\"4. Transitioning to an \"AI coworker\" modelThe release of Claude Opus 4.6 and OpenAI’s Frontier this week already signals a shift from single agents to coordinated \"agent teams.\" In this environment, the volume of AI-generated code and content is so high that traditional human-led review is no longer physically possible.\"Our senior engineers just cannot keep up with the volume of code being generated; they can&#x27;t do code reviews anymore,\" Gopal notes. \"Now we have an entirely different product development lifecycle where everyone needs to be trained to be a product person. Instead of doing code reviews, you work on a code review agent that people maintain. You&#x27;re looking at software that was 100% vibe-coded... it&#x27;s glitchy, it&#x27;s not perfect, but dude, it works.\"\"The productivity increases are impressive,\" Dattani concurred. \"It&#x27;s clear that we are at the onset of a major shift in business globally, but each business will need to approach that slightly differently depending on their specific data security and safety requirements. Remember that even while you&#x27;re trying to outdo your competition, they are bound by the same rules and regulations as you — and it&#x27;s worth it to take time to get it right, start small, don&#x27;t try to do too much at once.\" 5. Future outlook: voice interfaces, personality, and global scalingThe experts I spoke to all see a future where \"vibe working\" becomes the norm. Local, personality-driven AI—including through voice interfaces like Wispr or ElevenLabs powered OpenClaw agents—will become the primary interface for work, while agents handle the heavy lifting of international expansion.\"Voice is the primary interface for AI; it keeps people off their phones and improves quality of life,\" says Kimmel. \"The more you can give AI a personality that you&#x27;ve uniquely designed, the better the experience. Previously, you&#x27;d need to hire a GM in a new country and build a translation team. Now, companies can think international from day one with a localized lens.\"Hamal adds a broader perspective on the global stakes: \"We have knowledge worker AGI. It&#x27;s proven it can be done. Security is a concern that will rate-limit enterprise adoption, which means they&#x27;re more vulnerable to disruption from the low end of the market who don&#x27;t have the same concerns.\"Best practices for enterprise leaders seeking to embrace agentic AI capabilities at workAs OpenClaw and similar autonomous frameworks proliferate, IT departments must move beyond blanket bans toward structured governance. Use the following checklist to manage the \"Agentic Wave\" safely:Implement Identity-Based Governance: Every agent must have a strong, attributable identity tied to a human owner or team. Use frameworks like IBC (Identity, Boundaries, Context) to track who an agent is and what it is allowed to do at any moment.Enforce Sandbox Requirements: Prohibit OpenClaw from running on systems with access to live production data. All experimentation should occur in isolated, purpose-built sandboxes on segregated hardware.Audit Third-Party \"Skills\": Recent reports indicate nearly 20% of skills in the ClawHub registry contain vulnerabilities or malicious code. Mandate a \"white-list only\" policy for approved agent plugins.Disable Unauthenticated Gateways: Early versions of OpenClaw allowed \"none\" as an authentication mode. Ensure all instances are updated to current versions where strong authentication is mandatory and enforced by default.Monitor for \"Shadow Agents\": Use endpoint detection tools to scan for unauthorized OpenClaw installations or abnormal API traffic to external LLM providers.Update AI Policy for Autonomy: Standard Generative AI policies often fail to address \"agents.\" Update policies to explicitly define human-in-the-loop requirements for high-risk actions like financial transfers or file system modifications.",
          "feed_position": 0,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/3q67hIphrWar1zZdhKR2ss/1f8157dcb5adbad8e42943351fa74f42/XR7z-YHBn3iPBbV1IrWrk_w5M6NPon.png?w=300&q=30"
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/save-up-to-81-percent-on-expressvpn-two-year-plans-right-now-180602273.html",
          "published_at": "Fri, 06 Feb 2026 18:00:36 +0000",
          "title": "Save up to 81 percent on ExpressVPN two-year plans right now",
          "standfirst": "ExpressVPN is back on sale again, and its two-year plans are up to 81 percent off right now. You can get the Advanced tier for $88 for 28 months. This is marked down from the $392 that this time frame normally costs. On a per-month basis, it works out to roughly $3.14 for the promo period. We’ve consistently liked ExpressVPN because it’s fast, easy to use and widely available across a large global server network. In fact, it's our current pick for best premium VPN. One of the biggest drawbacks has always been its high cost, and this deal temporarily solves that issue. In our review we were able to get fast download and upload speeds, losing only 7 percent in the former and 2 percent in the latter worldwide. We found that it could unblock Netflix anywhere, and its mobile and desktop apps were simple to operate. We gave ExpressVPN an overall score of 85 out of 100. The virtual private network service now has three tiers. Basic is cheaper with fewer features, while Pro costs more and adds extra perks like support for 14 simultaneous devices and a password manager. Advanced sits in the middle and includes the password manager but only supports 12 devices.This article originally appeared on Engadget at https://www.engadget.com/deals/save-up-to-81-percent-on-expressvpn-two-year-plans-right-now-180602273.html?src=rss",
          "content": "ExpressVPN is back on sale again, and its two-year plans are up to 81 percent off right now. You can get the Advanced tier for $88 for 28 months. This is marked down from the $392 that this time frame normally costs. On a per-month basis, it works out to roughly $3.14 for the promo period. We’ve consistently liked ExpressVPN because it’s fast, easy to use and widely available across a large global server network. In fact, it's our current pick for best premium VPN. One of the biggest drawbacks has always been its high cost, and this deal temporarily solves that issue. In our review we were able to get fast download and upload speeds, losing only 7 percent in the former and 2 percent in the latter worldwide. We found that it could unblock Netflix anywhere, and its mobile and desktop apps were simple to operate. We gave ExpressVPN an overall score of 85 out of 100. The virtual private network service now has three tiers. Basic is cheaper with fewer features, while Pro costs more and adds extra perks like support for 14 simultaneous devices and a password manager. Advanced sits in the middle and includes the password manager but only supports 12 devices.This article originally appeared on Engadget at https://www.engadget.com/deals/save-up-to-81-percent-on-expressvpn-two-year-plans-right-now-180602273.html?src=rss",
          "feed_position": 17
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html",
          "published_at": "Fri, 06 Feb 2026 17:01:27 +0000",
          "title": "The best live TV streaming services to cut cable in 2026",
          "standfirst": "People who are interested in a live TV streaming service are probably looking for one (or all three) of the following: current sports matchups, breaking news and cable-like channels. We tried all the major providers to see what you get for your monthly bill — particularly in light of the fact that every live TV streamer has raised prices over the past year or two. That said, in most markets, a live TV streaming service is still more cost-effective than cable. And you still don’t have to sign a contract. Right now, we think YouTube TV is the most well-rounded option — but the others might have more of what you’re looking for. Here are the best live TV streaming services based on our testing.Editor’s note: The blackout of NBC channels on Fubo’s service continues, with no end in sight. That means fans hoping to catch the Super Bowl will need to look elsewhere. We’ve detailed your options below. Best live TV streaming services for 2026 How to watch the 2026 Super Bowl with a streaming service This year, the Super Bowl will take place on Sunday, February 8, 2026 at Levi's Stadium in Santa Clara, California. NBC has the rights to air the broadcast, which means you can watch it with a live TV streaming subscription to YouTube TV, Hulu + Live TV or DirecTV. Sling Blue plans include NBC in certain markets only. NBC channels are dark on Fubo as the company and NBC are still in negotiations. The traditional streaming service Peacock, which is owned by NBC, will also air the game. Those plans start at just $8 per month, which is nearly the cheapest way to watch. However, if you have a digital antenna, you can pick up the game’s broadcast signal from your local NBC affiliate for free. How can I stream NFL games for free? If you have a digital antenna hooked up to your TV, you can grab games that are broadcast over the airways for your region by tuning into your local CBS, Fox, NBC and ABC stations. You can buy a digital antenna for between $20 and $60. Alternatively, you can check out your local sports bar and watch the game for the price of a soda and maybe some nachos. As it turns out, bars and restaurants that provide those games to customers have to pay a ton of cash to do so, so you may as well take advantage of the opportunity. Will Peacock stream the Super Bowl? Yes. Peacock is owned by NBC Universal, which holds the rights to stream the big game this year. The Super Bowl will stream on both Peacock (all tiers) and local NBC stations (Premium Plus tier). The cheapest tier of Peacock's service starts at $8 per month. Can you stream live football on YouTube? September 5, 2025 marked the first time YouTube was an official live NFL broadcaster when it aired the Friday night, week-one game of the 2025 NFL season from São Paulo, Brazil. It pit the Los Angeles Chargers against the Kansas City Chiefs (LA won 21-27) and aired worldwide on YouTube for free as well as for subscribers to YouTube TV. There are no other plans for YouTube to air live NFL games for the 2025-6 season for free. Best free live TV streaming services for 2026 There are loads of ways to get free TV these days. To start, many standard streaming apps have added live components to their lineups — even Netflix. Peacock Premium Plus subscriptions include regional NBC stations. Paramount+ Premium subscribers can watch on-air CBS programming. The new Fox One service includes multiple live Fox stations. True, if you’re already paying for a service it’s not technically “free” but at least the live content isn’t extra. The smart TV operating system (OS) you use likely provides free live content too: Amazon’s Fire TV, Google/Android TV, Roku’s built-in Roku Channel and Samsung’s TV Plus all have hundreds of live channels and original programming. Some of the paid services we recommend above have a free version — namely Sling Freestream, Fubo Free (available after you cancel) and DirecTV’s MyFree. But if you’re looking for more, here are the best free ad-supported TV (FAST) apps with live TV that we tried: What to look for in a live TV streaming service How to stream live TV Streaming live TV is a lot like using Netflix. You get access through apps on your phone, tablet, smart TV or streaming device and the signal arrives over the internet. A faster and more stable connection tends to give you a better experience. Most live TV apps require you to sign up and pay via a web browser. After that, you can activate the app on all of your devices. Monthly Price When I started testing these cord-cutting alternatives, I was struck by the price difference between live TV and a standard video streaming app. Where the latter cost between $5 and $20 per month, most live TV services hit the $80 mark and can go higher than $200 with additional perks, channel packages and premium extras. The higher starting price is mostly due to the cost of providing multiple networks — particularly sports and local stations. And, in the past year or so, every service has raised base plan prices. Local channels Only two of the services I tried don’t include full local channel coverage for subscribers and one of those makes no effort to carry sports at all. That would be Philo and, as you might guess, it’s the cheapest. The next most affordable option, Sling, only carries three local stations — and only in larger markets — but it still manages to include some of the top sports channels. When you sign up with any provider that handles local TV, you’ll enter your zip code, ensuring you get your area’s broadcast affiliates for ABC, CBS, FOX and NBC. Of course, you can also get those stations for free. Nearly all modern television sets support a radio frequency (RF) connection, also known as the coaxial port, which means if you buy an HD antenna, you’ll receive locally broadcast stations like ABC, CBS, PBS, FOX and NBC. And since the signal is digital, reception is much improved over the staticky rabbit-ears era. But local channel access is another area where traditional streaming services, like Netflix, are bleeding into broadcast territory. For example, you can watch your local NBC station with a Peacock subscription and you can tune into your area’s CBS station through your Paramount+ subscription. Netflix is even getting into the mix with a recently announced deal with one of France’s broadcast companies, TF1. The streaming service will now air TF1's live TV channels and on-demand content inside the Netflix app. No word if the concept will expand to other regions, but it’s an interesting move to anyone interested in the future of streaming. Live sports coverage One reality that spun my head was the sheer number and iterations of sports networks in existence. Trying to figure out which network will carry the match-up you want to see can be tricky. I found that Google makes it a little easier for sports fans by listing out upcoming games (just swap in NBA, NFL, MLB, NHL and so on in the search bar). When you click an event, the “TV & streaming” button will tell you which network is covering it. That just leaves figuring out if your chosen service carries the RSNs (regional sports networks) you want. Unfortunately, even with add-ons and extra packages, some providers simply don’t have certain channels in their lineups. It would take a lawyer to understand the ins and outs of streaming rights negotiations, and networks leave and return to live TV carriers all the time. That said, most major sporting events in the US are covered by ESPN, Fox Sports, TNT, USA and local affiliates. I should also point out that traditional streaming services have started adding live sports to their lineups. Peacock carries live Premier League matches, Sunday Night Football games and aired the 2024 Olympic Games from Paris. Thursday Night Football as well as NBA and WNBA games are on Amazon Prime and Christmas Day Football airs on Netflix. HBO Max (formerly, er, HBO Max) now airs select, regular season games from the NHL, MLB, NCAA and NBA with a $10-per-month add-on. You can watch MLS games with an add-on through the Apple TV app, and Apple TV+ (now just called Apple TV) includes some MLB games. Roku users can watch the just-added free sports channel and those who subscribe to Paramount Plus can see many of the matches aired on CBS Sports, including live NFL games. In 2025, January's Super Bowl was live-streamed for free on Tubi. While all of these alternatives may not cover as much ground as live TV streamers, they could end up being cheaper avenues to the sports you want. And if sports is all you’re after, there are sports-only plans that are a touch cheaper, too. The promised sports streaming service from ESPN, Fox and Warner Bros. called Venu was cancelled early this year. But on August 21, ESPN launched its own streaming service that includes all ESPN channels and costs $30 per month. Fubo Sports is $56 monthly and includes local broadcast stations from ABC, CBS and FOX plus a slew of sports networks (CBS Sport and FS1 among them) as well as all networks included with ESPN Unlimited. Fox launched its own standalone service in August as well and it includes Fox Sports and all other Fox properties (News, Business, Weather) for $20 monthly. DirecTV also has a $70-per-month, sports-only streaming package called MySports and Comcast has a sports and news bundle for that same price (as long as you're an Xfinity customer with auto-pay, otherwise it's more expensive). Traditional cable networks Dozens of linear programming networks were once only available with cable TV, like Bravo, BET, Food Network, HGTV, CNN, Lifetime, SYFY and MTV. If you only subscribe to, say, Netflix or Apple TV+, you won’t have access to those. But as with sports, standard streamers are starting to incorporate this content into their offerings. After the Warner Bros. merger, Max incorporated some content from HGTV, Discovery and TLC. Peacock has Bravo and Hallmark shows, and Paramount+ has material from Nickelodeon, MTV and Comedy Central. Other entertainment channels like AMC+ have stand-alone apps. The Discovery+ app gives you 15 channels ad-free for $10 per month (or with ads for $6 monthly). And a service called Frndly TV starts at a mere $7 per month and streams A&E, Lifetime, Game Show Network, Outdoor Channel and about 35 others. Of course, most live TV streaming options will deliver more sizable lists of cable networks, but just note that you may already be paying for some of them — and if all you need is a certain channel, you could get it cheaper by subscribing directly. On-demand streaming Most live TV subscriptions include access to a selection of video-on-demand (VOD) content, like you would get with a traditional streaming service. Much of this content is made up of the movies and TV series that have recently aired on your subscribed networks. This typically doesn’t cover live events and news programming, but I was able to watch specific episodes of ongoing shows like Top Chef or BET’s Diarra from Detroit. Just search the on-demand library for the program, pick an episode and hit play. Partnerships, like Hulu’s relationship with Disney, and add-ons, such as bundling Max with your YouTube TV subscription or Starz with your Sling plan, will let you watch even larger libraries of on-demand content. But again, if VOD is all you’re after, paying for those networks directly instead of through a live TV plan will be far cheaper. Digital video recordings (DVR) limits Every option I tried offers some cloud DVR storage without needing a separate physical device. You’ll either get unlimited storage for recordings that expires after nine months or a year, or you’ll get a set number of hours (between 50 and 1,000) that you can keep indefinitely. Typically, all you need to do is designate what ongoing TV series you want to record and the DVR component will do all the hard work of saving subsequent episodes for you to watch later. You can do the same thing with sports events. Aside from being able to watch whenever it’s most convenient, you can also fast-forward through commercials in recorded content. In contrast, you can’t skip them on live TV or VOD. Simultaneous streams and profiles per account Each plan gives you a certain number of simultaneous streams, aka how many screens can play content at the same time. And while most providers will let you travel with your subscription, there are usually location restrictions that require you to sign in from your home IP address periodically. Stream allowances range from one at a time to unlimited screens (or as many as your ISP’s bandwidth can handle). Some plans require add-ons to get more screens. Most services also let you set up a few profiles so I was able to give different people in my family the ability to build their own watch histories and libraries, set their favorite channels and get individual recommendations. Picture-in-picture mode and multiview Picture-in-picture (PiP) usually refers to shrinking a video window on a mobile device or computer browser so you can watch it while using other apps. Sling, YouTube TV, FuboTV, Philo, DirecTV Stream and Hulu + Live TV all have PiP modes on computers and mobile devices. Another feature, multiview, lets you view multiple (usually four) sports matches or other live content at once on your TV screen. YouTube TV, FuboTV and now DirecTV all let you do this. With YouTube TV, you can select up to four views from a few preset selection of streams. FuboTV offers the same feature, but only if you're using an Apple TV or Roku streaming device. DirecTV lets you do so through “mixes” which include sports, news, business and kids variants with a set four channels in each mix. 4K live streams Right now, just FuboTV, YouTube TV and DirecTV Stream offer 4K live streams — but with caveats. YouTube TV requires a $20-per-month add-on, after which you’ll only be able to watch certain live content in 4K. DirecTV Stream has three channels that show live 4K content — one with shows and original series, and two with occasional sporting events. You don’t have to pay extra for these but you do need to have either DirecTV’s Gemini receiver, or a device from Fire TV, Apple TV or Roku. You’ll need those same streaming devices to watch the select 4K programming on Sling as well. FuboTV shows certain live events in 4K but access is limited to the Elite and Premier packages, not the base-level Pro plan. Of course, watching any 4K content also requires equipment that can handle it: a 4K smart TV or 4K streaming device paired with a cord and screen that can handle 4K resolution. Tiers, packages and add-ons Comparing price-to-offering ratios is a task for a spreadsheet. I… made three. The base plans range from $28 to $85 per month. From there, you can add packages, which are usually groups of live TV channels bundled by themes like news, sports, entertainment or international content. Premium VOD extras like Max, AMC+ and Starz are also available. Add-ons cost an extra $5 to $20 each per month and simply show up in the guide where you find the rest of your live TV. This is where streaming can quickly get expensive, pushing an $80 subscription to $200 monthly, depending on what you choose. How to stream live TV for free I also downloaded and tried out a few apps that offer free ad-supported TV (FAST) including Freevee, Tubi, PlutoTV and Sling Freestream. These let you drop in and watch a more limited selection of live networks at zero cost. Most don’t even require an email address, let alone a credit card. And if you have a Roku device, an Amazon Fire TV or Stick, a Samsung TV, a Chromecast device or a Google TV, you already have access to hundreds of live channels via the Roku Channel, the live tab in Fire TV, through the Samsung TV Plus app or through Google TV. How we tested live TV streaming services When I begin testing for a guide, I research the most popular and well-reviewed players in the category and narrow down which are worth trying. For the paid plans, just six services dominate so I tried them all. There are considerably more free live TV contenders so I tested the four most popular. After getting accounts set up using my laptop, I downloaded the apps on a Samsung smart TV running the latest version of Tizen OS. I counted the local stations and regional sports coverage, and noted how many of the top cable networks were available. I then weighed the prices, base packages and available add-ons. I then looked at how the programming was organized in each app’s UI and judged how easy everything was to navigate, from the top navigation to the settings. To test the search function, I searched for the same few TV shows on BET, Food Network, HGTV and Comedy Central, since all six providers carry those channels. I noted how helpful the searches were and how quickly they got me to season 6, episode 13 of Home Town. I used DVR to record entire series and single movies and watched VOD shows, making sure to test the pause and scan functions. On each service with sports, I searched for the same four upcoming NHL, NBA, MLS and NCAA basketball matches and used the record option to save the games and play them back a day or two later. Finally, I noted any extra perks or irritating quirks. All live TV streaming services we’ve tested: Philo Sling YouTube TV Hulu + Live TV DirecTV Stream FuboTV Freevee Tubi PlutoTV Sling Freestream Plex Live TV Streaming FAQs What is live streaming? Streaming simply refers to video content that is delivered to your screen over the internet. Live streaming can be split into two categories: linear programming and simultaneous transmission. That first one is similar to what you get with cable or broadcast TV, with channels that play a constant flow of movies and shows (sort of what TV looked like before Netflix). Simultaneous streaming lets you watch live events (like a basketball game) or a program (like the evening news) as they happen. What is the difference between streaming and live streaming? Standard streaming, the most popular example being Netflix, lets you pick what you want to watch from a menu of choices. It’s also referred to as “video on demand.” Live streaming refers to sports and news events that you can stream as they happen in real time. It also refers to channels that show a continuous, linear flow of programming. What streaming service is best for live TV? FuboTV does the best job of letting you organize live channels to help you find just what you want to watch. The interface is uncluttered and when you search for something, the UI clearly tells you whether something is live now or on-demand. YouTube TV also does a good job making that info clear. Both have just over 100 live channels on offer. What is the most cost effective TV streaming service? Free TV streaming services like PlutoTV, Plex, Tubi and FreeVee show plenty of ad-supported TV shows and movies without charging you anything. Of course, they won’t have the same channels or content that more premium subscriptions have. Ultimately it depends on what you want to watch and finding the service that can supply that to you in the most streamlined form so you’re not paying for stuff you don’t need. Is it cheaper to have cable or streaming? A basic cable package used to be more expensive than the base-level live TV streaming service. But now that nearly all major providers have raised their prices to over $75 per month, that’s no longer the case. And with add-ons and other premiums, you can easily pay over $200 a month for either cable or a live TV streaming service. But those who want to cut the cord will appreciate that streaming services don't have contracts. What streaming service has all the TV channels? No service that we tested had every available channel. Hulu + Live TV and DirecTV Stream carry the the highest number of the top rated channels, according to Neilsen. Hulu’s service also gets you Disney+ fare, which you can’t get elsewhere. FuboTV has the most sports channels and YouTube TV gives you the widest selection of add-ons. What is the most popular live TV streaming platform? YouTube TV has the most paying customers. According to 2024's letter from the CEO, the service has over eight million subscribers. Disney’s 2024 third quarter earnings put the Hulu + Live TV viewer count at 4.6 million. Sling’s customer count dipped from two million to about 1.9 million in 2024 and FuboTV grew its subscriber list to 1.6 million. How safe are free streaming services and websites? You may have heard certain sites that provide free content can be dangerous, leading to stolen info and/or exposing you to malware. That’s likely in reference to certain peer-to-peer (P2P) networks and file-sharing sites that let people download free movies and series — which can come bundled with malicious code. But if you’re talking about the free ad-supported streaming television (FAST) services listed here, from providers like PlutoTV, Tubi and Plex, they are just as safe as any other streaming service. Since you sometimes don’t even have to provide your email address or credit card info, they can even be more anonymous for cord cutters than apps that require login credentials. Recent updates December 2025: Included Fubo's channel and price adjustments. Confirmed pricing for all servicesThis article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html?src=rss",
          "content": "People who are interested in a live TV streaming service are probably looking for one (or all three) of the following: current sports matchups, breaking news and cable-like channels. We tried all the major providers to see what you get for your monthly bill — particularly in light of the fact that every live TV streamer has raised prices over the past year or two. That said, in most markets, a live TV streaming service is still more cost-effective than cable. And you still don’t have to sign a contract. Right now, we think YouTube TV is the most well-rounded option — but the others might have more of what you’re looking for. Here are the best live TV streaming services based on our testing.Editor’s note: The blackout of NBC channels on Fubo’s service continues, with no end in sight. That means fans hoping to catch the Super Bowl will need to look elsewhere. We’ve detailed your options below. Best live TV streaming services for 2026 How to watch the 2026 Super Bowl with a streaming service This year, the Super Bowl will take place on Sunday, February 8, 2026 at Levi's Stadium in Santa Clara, California. NBC has the rights to air the broadcast, which means you can watch it with a live TV streaming subscription to YouTube TV, Hulu + Live TV or DirecTV. Sling Blue plans include NBC in certain markets only. NBC channels are dark on Fubo as the company and NBC are still in negotiations. The traditional streaming service Peacock, which is owned by NBC, will also air the game. Those plans start at just $8 per month, which is nearly the cheapest way to watch. However, if you have a digital antenna, you can pick up the game’s broadcast signal from your local NBC affiliate for free. How can I stream NFL games for free? If you have a digital antenna hooked up to your TV, you can grab games that are broadcast over the airways for your region by tuning into your local CBS, Fox, NBC and ABC stations. You can buy a digital antenna for between $20 and $60. Alternatively, you can check out your local sports bar and watch the game for the price of a soda and maybe some nachos. As it turns out, bars and restaurants that provide those games to customers have to pay a ton of cash to do so, so you may as well take advantage of the opportunity. Will Peacock stream the Super Bowl? Yes. Peacock is owned by NBC Universal, which holds the rights to stream the big game this year. The Super Bowl will stream on both Peacock (all tiers) and local NBC stations (Premium Plus tier). The cheapest tier of Peacock's service starts at $8 per month. Can you stream live football on YouTube? September 5, 2025 marked the first time YouTube was an official live NFL broadcaster when it aired the Friday night, week-one game of the 2025 NFL season from São Paulo, Brazil. It pit the Los Angeles Chargers against the Kansas City Chiefs (LA won 21-27) and aired worldwide on YouTube for free as well as for subscribers to YouTube TV. There are no other plans for YouTube to air live NFL games for the 2025-6 season for free. Best free live TV streaming services for 2026 There are loads of ways to get free TV these days. To start, many standard streaming apps have added live components to their lineups — even Netflix. Peacock Premium Plus subscriptions include regional NBC stations. Paramount+ Premium subscribers can watch on-air CBS programming. The new Fox One service includes multiple live Fox stations. True, if you’re already paying for a service it’s not technically “free” but at least the live content isn’t extra. The smart TV operating system (OS) you use likely provides free live content too: Amazon’s Fire TV, Google/Android TV, Roku’s built-in Roku Channel and Samsung’s TV Plus all have hundreds of live channels and original programming. Some of the paid services we recommend above have a free version — namely Sling Freestream, Fubo Free (available after you cancel) and DirecTV’s MyFree. But if you’re looking for more, here are the best free ad-supported TV (FAST) apps with live TV that we tried: What to look for in a live TV streaming service How to stream live TV Streaming live TV is a lot like using Netflix. You get access through apps on your phone, tablet, smart TV or streaming device and the signal arrives over the internet. A faster and more stable connection tends to give you a better experience. Most live TV apps require you to sign up and pay via a web browser. After that, you can activate the app on all of your devices. Monthly Price When I started testing these cord-cutting alternatives, I was struck by the price difference between live TV and a standard video streaming app. Where the latter cost between $5 and $20 per month, most live TV services hit the $80 mark and can go higher than $200 with additional perks, channel packages and premium extras. The higher starting price is mostly due to the cost of providing multiple networks — particularly sports and local stations. And, in the past year or so, every service has raised base plan prices. Local channels Only two of the services I tried don’t include full local channel coverage for subscribers and one of those makes no effort to carry sports at all. That would be Philo and, as you might guess, it’s the cheapest. The next most affordable option, Sling, only carries three local stations — and only in larger markets — but it still manages to include some of the top sports channels. When you sign up with any provider that handles local TV, you’ll enter your zip code, ensuring you get your area’s broadcast affiliates for ABC, CBS, FOX and NBC. Of course, you can also get those stations for free. Nearly all modern television sets support a radio frequency (RF) connection, also known as the coaxial port, which means if you buy an HD antenna, you’ll receive locally broadcast stations like ABC, CBS, PBS, FOX and NBC. And since the signal is digital, reception is much improved over the staticky rabbit-ears era. But local channel access is another area where traditional streaming services, like Netflix, are bleeding into broadcast territory. For example, you can watch your local NBC station with a Peacock subscription and you can tune into your area’s CBS station through your Paramount+ subscription. Netflix is even getting into the mix with a recently announced deal with one of France’s broadcast companies, TF1. The streaming service will now air TF1's live TV channels and on-demand content inside the Netflix app. No word if the concept will expand to other regions, but it’s an interesting move to anyone interested in the future of streaming. Live sports coverage One reality that spun my head was the sheer number and iterations of sports networks in existence. Trying to figure out which network will carry the match-up you want to see can be tricky. I found that Google makes it a little easier for sports fans by listing out upcoming games (just swap in NBA, NFL, MLB, NHL and so on in the search bar). When you click an event, the “TV & streaming” button will tell you which network is covering it. That just leaves figuring out if your chosen service carries the RSNs (regional sports networks) you want. Unfortunately, even with add-ons and extra packages, some providers simply don’t have certain channels in their lineups. It would take a lawyer to understand the ins and outs of streaming rights negotiations, and networks leave and return to live TV carriers all the time. That said, most major sporting events in the US are covered by ESPN, Fox Sports, TNT, USA and local affiliates. I should also point out that traditional streaming services have started adding live sports to their lineups. Peacock carries live Premier League matches, Sunday Night Football games and aired the 2024 Olympic Games from Paris. Thursday Night Football as well as NBA and WNBA games are on Amazon Prime and Christmas Day Football airs on Netflix. HBO Max (formerly, er, HBO Max) now airs select, regular season games from the NHL, MLB, NCAA and NBA with a $10-per-month add-on. You can watch MLS games with an add-on through the Apple TV app, and Apple TV+ (now just called Apple TV) includes some MLB games. Roku users can watch the just-added free sports channel and those who subscribe to Paramount Plus can see many of the matches aired on CBS Sports, including live NFL games. In 2025, January's Super Bowl was live-streamed for free on Tubi. While all of these alternatives may not cover as much ground as live TV streamers, they could end up being cheaper avenues to the sports you want. And if sports is all you’re after, there are sports-only plans that are a touch cheaper, too. The promised sports streaming service from ESPN, Fox and Warner Bros. called Venu was cancelled early this year. But on August 21, ESPN launched its own streaming service that includes all ESPN channels and costs $30 per month. Fubo Sports is $56 monthly and includes local broadcast stations from ABC, CBS and FOX plus a slew of sports networks (CBS Sport and FS1 among them) as well as all networks included with ESPN Unlimited. Fox launched its own standalone service in August as well and it includes Fox Sports and all other Fox properties (News, Business, Weather) for $20 monthly. DirecTV also has a $70-per-month, sports-only streaming package called MySports and Comcast has a sports and news bundle for that same price (as long as you're an Xfinity customer with auto-pay, otherwise it's more expensive). Traditional cable networks Dozens of linear programming networks were once only available with cable TV, like Bravo, BET, Food Network, HGTV, CNN, Lifetime, SYFY and MTV. If you only subscribe to, say, Netflix or Apple TV+, you won’t have access to those. But as with sports, standard streamers are starting to incorporate this content into their offerings. After the Warner Bros. merger, Max incorporated some content from HGTV, Discovery and TLC. Peacock has Bravo and Hallmark shows, and Paramount+ has material from Nickelodeon, MTV and Comedy Central. Other entertainment channels like AMC+ have stand-alone apps. The Discovery+ app gives you 15 channels ad-free for $10 per month (or with ads for $6 monthly). And a service called Frndly TV starts at a mere $7 per month and streams A&E, Lifetime, Game Show Network, Outdoor Channel and about 35 others. Of course, most live TV streaming options will deliver more sizable lists of cable networks, but just note that you may already be paying for some of them — and if all you need is a certain channel, you could get it cheaper by subscribing directly. On-demand streaming Most live TV subscriptions include access to a selection of video-on-demand (VOD) content, like you would get with a traditional streaming service. Much of this content is made up of the movies and TV series that have recently aired on your subscribed networks. This typically doesn’t cover live events and news programming, but I was able to watch specific episodes of ongoing shows like Top Chef or BET’s Diarra from Detroit. Just search the on-demand library for the program, pick an episode and hit play. Partnerships, like Hulu’s relationship with Disney, and add-ons, such as bundling Max with your YouTube TV subscription or Starz with your Sling plan, will let you watch even larger libraries of on-demand content. But again, if VOD is all you’re after, paying for those networks directly instead of through a live TV plan will be far cheaper. Digital video recordings (DVR) limits Every option I tried offers some cloud DVR storage without needing a separate physical device. You’ll either get unlimited storage for recordings that expires after nine months or a year, or you’ll get a set number of hours (between 50 and 1,000) that you can keep indefinitely. Typically, all you need to do is designate what ongoing TV series you want to record and the DVR component will do all the hard work of saving subsequent episodes for you to watch later. You can do the same thing with sports events. Aside from being able to watch whenever it’s most convenient, you can also fast-forward through commercials in recorded content. In contrast, you can’t skip them on live TV or VOD. Simultaneous streams and profiles per account Each plan gives you a certain number of simultaneous streams, aka how many screens can play content at the same time. And while most providers will let you travel with your subscription, there are usually location restrictions that require you to sign in from your home IP address periodically. Stream allowances range from one at a time to unlimited screens (or as many as your ISP’s bandwidth can handle). Some plans require add-ons to get more screens. Most services also let you set up a few profiles so I was able to give different people in my family the ability to build their own watch histories and libraries, set their favorite channels and get individual recommendations. Picture-in-picture mode and multiview Picture-in-picture (PiP) usually refers to shrinking a video window on a mobile device or computer browser so you can watch it while using other apps. Sling, YouTube TV, FuboTV, Philo, DirecTV Stream and Hulu + Live TV all have PiP modes on computers and mobile devices. Another feature, multiview, lets you view multiple (usually four) sports matches or other live content at once on your TV screen. YouTube TV, FuboTV and now DirecTV all let you do this. With YouTube TV, you can select up to four views from a few preset selection of streams. FuboTV offers the same feature, but only if you're using an Apple TV or Roku streaming device. DirecTV lets you do so through “mixes” which include sports, news, business and kids variants with a set four channels in each mix. 4K live streams Right now, just FuboTV, YouTube TV and DirecTV Stream offer 4K live streams — but with caveats. YouTube TV requires a $20-per-month add-on, after which you’ll only be able to watch certain live content in 4K. DirecTV Stream has three channels that show live 4K content — one with shows and original series, and two with occasional sporting events. You don’t have to pay extra for these but you do need to have either DirecTV’s Gemini receiver, or a device from Fire TV, Apple TV or Roku. You’ll need those same streaming devices to watch the select 4K programming on Sling as well. FuboTV shows certain live events in 4K but access is limited to the Elite and Premier packages, not the base-level Pro plan. Of course, watching any 4K content also requires equipment that can handle it: a 4K smart TV or 4K streaming device paired with a cord and screen that can handle 4K resolution. Tiers, packages and add-ons Comparing price-to-offering ratios is a task for a spreadsheet. I… made three. The base plans range from $28 to $85 per month. From there, you can add packages, which are usually groups of live TV channels bundled by themes like news, sports, entertainment or international content. Premium VOD extras like Max, AMC+ and Starz are also available. Add-ons cost an extra $5 to $20 each per month and simply show up in the guide where you find the rest of your live TV. This is where streaming can quickly get expensive, pushing an $80 subscription to $200 monthly, depending on what you choose. How to stream live TV for free I also downloaded and tried out a few apps that offer free ad-supported TV (FAST) including Freevee, Tubi, PlutoTV and Sling Freestream. These let you drop in and watch a more limited selection of live networks at zero cost. Most don’t even require an email address, let alone a credit card. And if you have a Roku device, an Amazon Fire TV or Stick, a Samsung TV, a Chromecast device or a Google TV, you already have access to hundreds of live channels via the Roku Channel, the live tab in Fire TV, through the Samsung TV Plus app or through Google TV. How we tested live TV streaming services When I begin testing for a guide, I research the most popular and well-reviewed players in the category and narrow down which are worth trying. For the paid plans, just six services dominate so I tried them all. There are considerably more free live TV contenders so I tested the four most popular. After getting accounts set up using my laptop, I downloaded the apps on a Samsung smart TV running the latest version of Tizen OS. I counted the local stations and regional sports coverage, and noted how many of the top cable networks were available. I then weighed the prices, base packages and available add-ons. I then looked at how the programming was organized in each app’s UI and judged how easy everything was to navigate, from the top navigation to the settings. To test the search function, I searched for the same few TV shows on BET, Food Network, HGTV and Comedy Central, since all six providers carry those channels. I noted how helpful the searches were and how quickly they got me to season 6, episode 13 of Home Town. I used DVR to record entire series and single movies and watched VOD shows, making sure to test the pause and scan functions. On each service with sports, I searched for the same four upcoming NHL, NBA, MLS and NCAA basketball matches and used the record option to save the games and play them back a day or two later. Finally, I noted any extra perks or irritating quirks. All live TV streaming services we’ve tested: Philo Sling YouTube TV Hulu + Live TV DirecTV Stream FuboTV Freevee Tubi PlutoTV Sling Freestream Plex Live TV Streaming FAQs What is live streaming? Streaming simply refers to video content that is delivered to your screen over the internet. Live streaming can be split into two categories: linear programming and simultaneous transmission. That first one is similar to what you get with cable or broadcast TV, with channels that play a constant flow of movies and shows (sort of what TV looked like before Netflix). Simultaneous streaming lets you watch live events (like a basketball game) or a program (like the evening news) as they happen. What is the difference between streaming and live streaming? Standard streaming, the most popular example being Netflix, lets you pick what you want to watch from a menu of choices. It’s also referred to as “video on demand.” Live streaming refers to sports and news events that you can stream as they happen in real time. It also refers to channels that show a continuous, linear flow of programming. What streaming service is best for live TV? FuboTV does the best job of letting you organize live channels to help you find just what you want to watch. The interface is uncluttered and when you search for something, the UI clearly tells you whether something is live now or on-demand. YouTube TV also does a good job making that info clear. Both have just over 100 live channels on offer. What is the most cost effective TV streaming service? Free TV streaming services like PlutoTV, Plex, Tubi and FreeVee show plenty of ad-supported TV shows and movies without charging you anything. Of course, they won’t have the same channels or content that more premium subscriptions have. Ultimately it depends on what you want to watch and finding the service that can supply that to you in the most streamlined form so you’re not paying for stuff you don’t need. Is it cheaper to have cable or streaming? A basic cable package used to be more expensive than the base-level live TV streaming service. But now that nearly all major providers have raised their prices to over $75 per month, that’s no longer the case. And with add-ons and other premiums, you can easily pay over $200 a month for either cable or a live TV streaming service. But those who want to cut the cord will appreciate that streaming services don't have contracts. What streaming service has all the TV channels? No service that we tested had every available channel. Hulu + Live TV and DirecTV Stream carry the the highest number of the top rated channels, according to Neilsen. Hulu’s service also gets you Disney+ fare, which you can’t get elsewhere. FuboTV has the most sports channels and YouTube TV gives you the widest selection of add-ons. What is the most popular live TV streaming platform? YouTube TV has the most paying customers. According to 2024's letter from the CEO, the service has over eight million subscribers. Disney’s 2024 third quarter earnings put the Hulu + Live TV viewer count at 4.6 million. Sling’s customer count dipped from two million to about 1.9 million in 2024 and FuboTV grew its subscriber list to 1.6 million. How safe are free streaming services and websites? You may have heard certain sites that provide free content can be dangerous, leading to stolen info and/or exposing you to malware. That’s likely in reference to certain peer-to-peer (P2P) networks and file-sharing sites that let people download free movies and series — which can come bundled with malicious code. But if you’re talking about the free ad-supported streaming television (FAST) services listed here, from providers like PlutoTV, Tubi and Plex, they are just as safe as any other streaming service. Since you sometimes don’t even have to provide your email address or credit card info, they can even be more anonymous for cord cutters than apps that require login credentials. Recent updates December 2025: Included Fubo's channel and price adjustments. Confirmed pricing for all servicesThis article originally appeared on Engadget at https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html?src=rss",
          "feed_position": 18
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/cybersecurity/vpn/best-vpns-with-free-trials-130000435.html",
          "published_at": "Fri, 06 Feb 2026 13:00:00 +0000",
          "title": "The best VPNs with free trials in 2026",
          "standfirst": "A free trial to a virtual private network (VPN) can mean a few different things. Several of the best VPNs let you try them out without paying. A rare few, and only one on this list, let you try them without submitting payment information at all. Some VPNs have forever free plans that let you use them indefinitely without paying, as long as you're OK with some limits.For the most part, though, your best chance to test a VPN for free is to pay for a subscription. Then, if you don't like the service, you can get your money back before the refund guarantee expires. This takes a bit more work, and some services have very tight turnarounds. However, it'll get you the most time with the most complete version of the VPN.With that out of the way, let's talk about the best VPN free trials for each definition of \"free trial.\" I'll start with VPNs that actually have free trials, most of which require a payment method and only work on mobile devices. The next section lists the best forever free plans. Finally, I'll share instructions for how to use a VPN money-back guarantee as a free trial. Best VPNs with free trials Best VPN forever free plans Using VPN money-back guarantees as free trials Although VPN free trials are great when you can get them, you'll enjoy a lot more flexibility by taking advantage of refund guarantees. Almost every provider has a money-back guarantee that doesn't require you to prove a specific problem. You'll probably have to deflect some upselling attempts before you actually get the refund, but most policies do promise you all your money back, with no pro-rating. I like to download VPNs on their one-month plans so I can put the full service through my usual battery of tests. A 30-day money-back guarantee grants you enough time to learn whether you can use the VPN long-term. If you don't like the service, the standard method for getting a refund is to get in touch with customer support on the VPN provider's help page. This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/best-vpns-with-free-trials-130000435.html?src=rss",
          "content": "A free trial to a virtual private network (VPN) can mean a few different things. Several of the best VPNs let you try them out without paying. A rare few, and only one on this list, let you try them without submitting payment information at all. Some VPNs have forever free plans that let you use them indefinitely without paying, as long as you're OK with some limits.For the most part, though, your best chance to test a VPN for free is to pay for a subscription. Then, if you don't like the service, you can get your money back before the refund guarantee expires. This takes a bit more work, and some services have very tight turnarounds. However, it'll get you the most time with the most complete version of the VPN.With that out of the way, let's talk about the best VPN free trials for each definition of \"free trial.\" I'll start with VPNs that actually have free trials, most of which require a payment method and only work on mobile devices. The next section lists the best forever free plans. Finally, I'll share instructions for how to use a VPN money-back guarantee as a free trial. Best VPNs with free trials Best VPN forever free plans Using VPN money-back guarantees as free trials Although VPN free trials are great when you can get them, you'll enjoy a lot more flexibility by taking advantage of refund guarantees. Almost every provider has a money-back guarantee that doesn't require you to prove a specific problem. You'll probably have to deflect some upselling attempts before you actually get the refund, but most policies do promise you all your money back, with no pro-rating. I like to download VPNs on their one-month plans so I can put the full service through my usual battery of tests. A 30-day money-back guarantee grants you enough time to learn whether you can use the VPN long-term. If you don't like the service, the standard method for getting a refund is to get in touch with customer support on the VPN provider's help page. This article originally appeared on Engadget at https://www.engadget.com/cybersecurity/vpn/best-vpns-with-free-trials-130000435.html?src=rss",
          "feed_position": 38
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/deals/two-years-of-nordvpns-complete-plan-is-70-percent-off-123000301.html",
          "published_at": "Fri, 06 Feb 2026 12:30:00 +0000",
          "title": "Two years of NordVPN's Complete plan is 70 percent off",
          "standfirst": "NordVPN is offering a significant discount on its two-year plans, with 70 percent off its Complete tier and up to 78 percent off overall. For the Complete tier, the deal brings the total cost down to $130 for 24 months NordVPN regularly appears on Engadget’s list of the best VPN services thanks to its wide server network, strong security tools and consistent performance across devices. NordVPN’s latest promotion puts one of its most comprehensive plans at a price that undercuts many competing premium VPN subscriptions. The Complete tier includes full access to NordVPN’s core VPN service, which encrypts internet traffic and masks a user’s IP address to help protect online activity on public Wi-Fi networks and at home. Subscribers can use the service on multiple devices, including phones, tablets, laptops and smart TVs, with apps available for major operating systems. It also includes access to NordPass (more on that below), an ad blocker and 1TB of cloud storage. You’ll find similar discounts on all of NordVPN’s other plans: Basic, Plus and Prime. Beyond the basics, NordVPN offers features like threat protection to help block malicious websites and trackers, as well as specialty servers designed for added privacy or faster performance in specific scenarios. In our NordVPN review, the service was praised for its evolving feature set and overall reliability, even as the VPN market becomes increasingly competitive. Engadget regularly tracks VPN pricing trends and this offer compares favorably with other current promotions. It also appears alongside NordVPN deals featured in Engadget’s ongoing roundup of the best VPN discounts available right now, which compares offers from multiple major providers. Those looking for additional security tools may also want to note that NordVPN’s Complete plan bundles in extra services beyond the VPN itself. One of those is NordPass, the company’s password management app. NordPass is also discounted as part of a separate promotion, if you’re primarily looking for a password manager rather than a VPN. The Premium tier is currently 50 percent off, bringing the price down to $36 for two years. NordPass Premium adds features such as cross-device password syncing, secure password sharing and breach monitoring, which alerts users if stored credentials appear in known data leaks. Both offers are available for a limited time, though Nord has not specified an end date for the promotion. If you’re still unsure whether NordVPN is right for you, it offers a 30-day money-back guarantee, so you can change your mind and get a full refund. This article originally appeared on Engadget at https://www.engadget.com/deals/two-years-of-nordvpns-complete-plan-is-70-percent-off-123000301.html?src=rss",
          "content": "NordVPN is offering a significant discount on its two-year plans, with 70 percent off its Complete tier and up to 78 percent off overall. For the Complete tier, the deal brings the total cost down to $130 for 24 months NordVPN regularly appears on Engadget’s list of the best VPN services thanks to its wide server network, strong security tools and consistent performance across devices. NordVPN’s latest promotion puts one of its most comprehensive plans at a price that undercuts many competing premium VPN subscriptions. The Complete tier includes full access to NordVPN’s core VPN service, which encrypts internet traffic and masks a user’s IP address to help protect online activity on public Wi-Fi networks and at home. Subscribers can use the service on multiple devices, including phones, tablets, laptops and smart TVs, with apps available for major operating systems. It also includes access to NordPass (more on that below), an ad blocker and 1TB of cloud storage. You’ll find similar discounts on all of NordVPN’s other plans: Basic, Plus and Prime. Beyond the basics, NordVPN offers features like threat protection to help block malicious websites and trackers, as well as specialty servers designed for added privacy or faster performance in specific scenarios. In our NordVPN review, the service was praised for its evolving feature set and overall reliability, even as the VPN market becomes increasingly competitive. Engadget regularly tracks VPN pricing trends and this offer compares favorably with other current promotions. It also appears alongside NordVPN deals featured in Engadget’s ongoing roundup of the best VPN discounts available right now, which compares offers from multiple major providers. Those looking for additional security tools may also want to note that NordVPN’s Complete plan bundles in extra services beyond the VPN itself. One of those is NordPass, the company’s password management app. NordPass is also discounted as part of a separate promotion, if you’re primarily looking for a password manager rather than a VPN. The Premium tier is currently 50 percent off, bringing the price down to $36 for two years. NordPass Premium adds features such as cross-device password syncing, secure password sharing and breach monitoring, which alerts users if stored credentials appear in known data leaks. Both offers are available for a limited time, though Nord has not specified an end date for the promotion. If you’re still unsure whether NordVPN is right for you, it offers a 30-day money-back guarantee, so you can change your mind and get a full refund. This article originally appeared on Engadget at https://www.engadget.com/deals/two-years-of-nordvpns-complete-plan-is-70-percent-off-123000301.html?src=rss",
          "feed_position": 39
        },
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/home/smart-home/best-mesh-wifi-system-130028701.html",
          "published_at": "Fri, 06 Feb 2026 10:00:37 +0000",
          "title": "The best mesh Wi-Fi systems of 2026",
          "standfirst": "If your Wi-Fi struggles to reach every corner of your house, it’s probably not your internet plan that’s the problem. A single router can only do so much, especially in larger spaces or homes with thick walls. That’s where the best mesh Wi-Fi system comes in, replacing one overworked router with a Wi-Fi mesh network designed to deliver high-speed coverage across your entire home.A whole home mesh Wi-Fi setup uses multiple nodes that act as shared access points, spreading your connection more evenly and reducing slowdowns as you move from room to room. Compared to basic range extenders, mesh systems handle traffic more intelligently, balance bandwidth between devices and usually offer easy setup through companion apps. Many support dual-band Wi-Fi and newer standards, making them better suited for households full of phones, laptops, TVs and smart home devices.We’ve tested today’s leading mesh systems to see which ones actually deliver consistent speeds and reliable coverage. Whether you’re trying to eliminate dead zones in a small apartment or blanket a large, multi-floor house with fast, stable Wi-Fi, these are the mesh systems worth considering. Best mesh Wi-Fi systems for 2026 What to look for in a mesh Wi-Fi system Linksys’ CEO Jonathan Bettino told Engadget why mesh systems are an “advancement in Wi-Fi technology” over buying a single point router. With one transmitter, the signal can degrade the further away from the router you go, or the local environment isn’t ideal. “You can have a small [home], but there’s thick walls [...] or things in the way that just interfere with your wireless signal,” he said. Historically, the solution to a home’s Wi-Fi dead zone was to buy Wi-Fi range extenders but Bettino said the hardware has both a “terrible user experience” and one of the highest return rates of any consumer electronics product. Mesh Wi-Fi, by comparison, offers “multiple nodes that can be placed anywhere in your home,” says Bettino, each acting as an access point that works together as part of a whole home mesh Wi-Fi system. Rather than having one main router in your home, having a “router in every room” is the biggest selling point for mesh Wi-Fi given how reliant we all are on the internet. Each node is in constant contact with each other, broadcasting a single, seamless network to all of your connected devices. There’s no separate network for the 2.4GHz and 5GHz bands, just a single name that you connect to. It’s a good time to buy a mesh Wi-Fi system since the latest standard, Wi-Fi 6E, represents a big leap in the technology. Matt MacPherson, Cisco's Chief Technology Officer for Wireless, said Wi-Fi 6E is a big “inflection point,” using much more of the wireless spectrum than its predecessors. “If you’re using that spectrum with a Wi-Fi 6 [device],” he said, “you’re going to get significant gains [in speed.]” MacPherson added Wi-Fi 6E will likely “carry you for a long time” thanks to the fact its “top throughputs now typically exceed what people can actually connect their home to.” In short, with a top theoretical per-stream speed of 1.2 Gbps, Wi-Fi 6E is fast enough to outrun all but the fastest internet service. What do all these Wi-Fi numbers and letters mean? I’m sorry folks, we need to get boringly technical for one paragraph, but I promise you it’s worth it. Wi-Fi is governed by International Standard IEEE 802.11, and every few years a letter gets added onto that name when the technology evolves and improves. Until 2019, routers were sold under their IEEE name, leaving users to pick through the word soup of a product labeled 802.11 b/g/a/n/ac and so on. Mercifully, wiser heads opted to rebrand the letters as numbers, so rather than 802.11 b/g/a/n/ac, we have Wi-Fi 1, 2, 3 4 and 5. Right now, we’re in the middle of one of those Wi-Fi generations, with most of the gear on sale right now supporting either Wi-Fi 6 or Wi-Fi 6E. What’s the difference between Wi-Fi 6 and Wi-Fi 6E? Wi-Fi uses chunks of the radio frequency spectrum, with Wi-Fi 6 using the 2.4GHz and 5GHz bands to pump data around. In fact, back in the old days, it was likely your home router would offer you the choice of the 2.4GHz or the 5GHz network, as separate bands to access. These days, all of the spectrums are tied together as one thing, and Wi-Fi 6E has the added ability to use the 6GHz band as well. That’s a big chunk of extra wireless real estate that isn’t as cluttered up as the 2.4 and 5GHz bands. You’re going to talk about wireless frequencies now, aren’t you. Each Wi-Fi band had tradeoffs, because the slower radio frequencies have greater range but less speed. 2.4GHz signals will travel a long way in your home but aren’t quick, while 6GHz is blisteringly fast but can be defeated by a sturdy brick wall. A lot of Wi-Fi-enabled gear you own, like smart home products, only use the 2.4GHz band because the range is better and it’s a lot cheaper. But it means that the band is also overcrowded and slow, making it great for your doorbell and robovac, but lackluster for Twitch streaming. So, what am I looking for? Right now, the market is full of mature Wi-Fi 6 and 6E devices, and most new systems available to buy are capable of taking advantage of the faster speeds they offer. This guide focuses on Wi-Fi 6E gear since it’s what we think it’s more than enough to satisfy almost everyone’s at-home Wi-Fi needs. What about Wi-Fi 7? We’re now seeing the first generation of Wi-Fi 7 devices available to buy, but we don’t recommend you do so immediately. The Wi-Fi 7 standard is still so new that there’s little to no reason for you to rush out and buy one for your home. The hardware is tremendously expensive and while Wi-Fi 7 will, eventually, offer some great benefits over 6E, it’s not as transformative an upgrade as 6E. Not to mention, Wi-Fi 7 is so new that almost none of your home’s devices will be able to take advantage of its big-ticket features. I’d estimate you won’t need to worry about upgrading to Wi-Fi 7 for at least five years, if not longer. Range and speed All Wi-Fi routers boast a theoretical broadcast range and a theoretical top speed, and in some cases external antennas to boost signal directionality — but these figures don’t mean much. After all, manufacturers can’t control your ISP’s real speed, the materials and layout of your home or where you put your Wi-Fi gear. Raw speed isn’t everything, either, and you likely need less peak speed than your provider advertises. What matters more is consistent bandwidth and stable performance throughout your entire home. After all, Netflix needs just 15 Mbps to push a single 4K video stream to your home. As cool as it is to say you’ve got all these hundreds of Mbps, factors like latency and reliability are far more crucial to a happy internet life. And unless you have Gigabit internet that can reach speeds of up to 1 Gbps, you won’t need a mesh router that offers that spec. Backhaul Mesh Wi-Fi systems work by connecting every hardware node to a single wireless network, letting them all communicate with each other. Imagine four people in a busy, noisy restaurant all trying to order their dinner from a weary staff member, all at once. Now imagine, while this is going on, that four more people at that same table are also trying to tell a funny anecdote. It’s no surprise that it might take a long time for the right information to reach its intended destination. To combat this, higher-end mesh routers offer dedicated wireless backhaul, allowing nodes to communicate without eating into the high-speed bandwidth your devices rely on. So rather than everyone talking at once in the same space, the conversations are essentially separated, reducing the invisible clutter in the air. Because there’s less confusing cross-chatter, everything moves faster, offering a significant performance boost to those systems. Connectivity These days, even your washing machine can have a wireless connection, but that doesn’t mean you should ignore the joys of wired internet. No matter how fast Wi-Fi is, a hard line will always be faster, and wired connections can significantly improve Wi-Fi mesh network performance when used for backhaul. Plenty of routers can also use these hard connections as backhaul, eliminating further wireless clutter. It’s convenient for spread-out systems and power users, but it will mean running more wires through your home. The most common standard is Cat 5e, or gigabit ethernet which, unsurprisingly, has a top speed of 1 Gigabit per second (Gbps). Since Ethernet cables are backward compatible, you should be able to easily find one that works with your system. However, to get the most out of your mesh routers, it’s worth investing in an Ethernet cable that meets the standard your router uses — if it’s Cat 5e, use a Cat 5e cable. You can check your router’s specs via the manufacturer’s website to be sure. Flexibility and scalability Mesh routers enable you to add (or subtract) modules from your home network to suit your needs. D-Link’s Alan Jones said users should “check how scalable the prospective product is” before you buy. This sense of scale doesn’t just apply to the number of nodes on the network, but how many simultaneous connections it can handle. It’s also worth looking at ASUS’ AiMesh products, which can combine mesh Wi-Fi gear and its standard “spider” Wi-Fi routers. If you’ve got a tricky part of your home, you can bolt on an ultra-power standalone Wi-Fi router to a compatible mesh. Placement Mesh networks replace one big piece of hardware with a series of identical nodes that you scatter around your home, each acting as a shared access point to maintain coverage throughout the entire home. You connect one to your modem (usually over ethernet), and then scatter the rest around the place for the best coverage. A good rule of thumb is to place each node no more than two rooms away from the last one, rather than sticking them at the far ends of your home. Bear in mind, every physical obstacle between a Wi-Fi node, its siblings and your devices will hurt your overall performance. You should aim to place them, at the very least, at waist height on furniture in open air, without too many obstructions. The reason many mesh Wi-Fi products are designed to look like an inoffensive white doodad is so you don’t feel compelled to hide them behind your TV. Other mesh Wi-Fi router systems we tested Amazon Eero Pro 7 Eero built its reputation on easy to use yet powerful mesh systems that offer a lot of good in a relatively small and affordable package. Setup is effortless, the app running things is clean and simple, and you get the added benefit of backwards compatibility with older hardware. Sadly, the issue with every Eero system is that so many basic management features, like parental controls, are paywalled behind the company’s Eero Plus subscription for $100 a year. Amazon Eero 6E Eero Pro 6E is an “easy” device, the sort a total novice can set up on their own and thrive with for years on end. There’s little brainwork required to get things set up, and the app has a clean UI with plenty of hand-holding. But, as with the Eero Pro 7, the fact that so many basic management tools are paywalled irks me, especially since you can get plenty of them for free with Google’s rival offering. Netgear Orbi 960 The Orbi 96T0 (RBKE963) is Netgear’s flagship mesh Wi-Fi product, which the company calls the “world’s most powerful Wi-Fi 6E system.” It’s also one of the most expensive consumer-level kits on the market, setting you back $1,499.99 for a three pack. It's a fantastic piece of gear, but it's worth saying that the subset of people who could, would or should buy it remains far smaller than you might expect. Ultimately, I feel that if you’re paying luxury prices, you should expect a luxury product. There were plenty of times during testing that I went looking for a feature that was either only available via the web client, or behind a paywall. While, yes, much of your cash is going to the superlative hardware, but for this sort of money, the fact you have to pay extra for some table-stakes features is insulting. If you’re looking for a new Wi-Fi system and aren’t prepared to spend almost $1,500, it’s worth considering our other top picks for the best Wi-Fi routers and mesh systems. How we test Wi-Fi routers My home covers around 2,200 square feet across three stories with the office on the third floor. It’s relatively long and thin, with the living room at the front of the house, the kitchen at the back and the three bedrooms on the first floor. Its age means there are a lot of solid brick walls, old-school lathe and plaster as well as aluminum foil-backed insulation boards to help with energy efficiency. There are two major Wi-Fi dead zones in the house: The bathroom and the third bedroom behind it, since there’s lots of old and new pipework in the walls and floors. For mesh routers with two nodes, I place the first in my living room, connected via ethernet to my cable modem with the second on the first floor landing in the (ostensible) center of the house. For three-node sets, the third goes in my kitchen, which I’ve found is the optimal layout to get the bulk of my house covered in Wi-Fi. Fundamentally, my home poses enough challenges that if it succeeds here, it stands a very good chance of succeeding in your place. Each mesh is judged on ease of setup, Wi-Fi coverage, reliability, speed and any additional features that it advertises. I look at how user-friendly each companion app is from the perspective of a novice rather than an expert given you shouldn’t need to be a network engineer to do this sort of thing. Tests I do include checking for dead zones, moving from room to room to measure consistency of connectivity and streaming multiple videos at once to replicate common usage patterns. Mesh Wi-Fi system FAQs This is the section of our mesh Wi-Fi buyer’s guide where we talk about the stuff that most people just glide past. If you’re not familiar with technology, it can be intimidating if people talk about these things as if you’re expected to already know. So here’s a very simple, very basic rundown of some of the stuff you might have missed in very basic terms. What’s the difference between a Wi-Fi router and a mesh router? A Wi-Fi router is a box that usually sits close to wherever the internet comes into your home and pumps out information over radio waves. A mesh router, meanwhile, is a set of smaller devices, one of which sits next to your internet connection while the rest are scattered around your home. A single Wi-Fi router is great if your home is small, your needs aren’t too demanding, or if your home doesn’t have many radio-blocking obstructions that mean those signals can’t reach every corner of your home. But, much like standing next to a radio transmitter and then walking away from it in a straight line, after a while, the signal will degrade. That’s the problem a mesh system is designed to solve, since it will take the signal from your modem and pump to the other mesh devices, known as nodes, in your home. That way, instead of having one big router in one part of your home, you have several small ones that ensure you have good Wi-Fi connectivity all over. It also helps ensure that there’s no risk of dropping your connection as you move around — a mesh router system makes it easy to, for instance, walk from room to room watching Netflix and know you won’t miss a single frame. What's the difference between a Wi-Fi extender and a mesh system? Oh boy. Wi-Fi extenders, or repeaters, are small devices designed to push Wi-Fi a little further than your Wi-Fi router can stretch. They’re cheap, compact and often come in the form of little boxes that sit on your plug sockets with the hope of pushing Wi-Fi to a signal-sparse corner of your home. They are, and I can’t put this delicately enough, often a big pile of rubbish and are often not worth your time. Especially since the price of mesh routers has fallen to within most people’s budgets. What is a wireless backhaul? As we explained above, mesh Wi-Fi systems work by connecting every hardware node to a single wireless network, letting them all communicate with each other. Imagine four people in a busy, noisy restaurant all trying to order their dinner from a weary staff member, all at once. Now imagine, while this is going on, that four more people at that same table are also trying to tell a funny anecdote. It’s no surprise that it might take a long time for the right information to reach its intended destination. To combat this, higher-end mesh routers offer dedicated wireless backhaul; a slice of the spectrum for node-to-node communication. So rather than everyone talking at once in the same space, the conversations are essentially separated, reducing the invisible clutter in the air. Because there’s less confusing cross-chatter, everything moves faster, offering a significant performance boost to those systems. Is it better to hard wire instead of using a mesh Wi-Fi system? This is a great question that doesn’t have a simple answer. It is (almost) always preferable to connect devices with a wire, in this case Ethernet, than to use Wi-Fi. The speeds are faster, it’s more reliable and your data is less vulnerable to the slings and arrows of the laws of physics. Hell, I spent about a year trying to work out how to build an iPhone to Ethernet connector back in the bad old days of Wi-Fi. But your ability to do so depends on your level of DIY skills and / or how much money you want to spend on contractors. Wiring your home for Ethernet if you don’t have the infrastructure already can be a costly and time-consuming process. Particularly if you don’t want ugly wires running along your baseboards and under your carpets or across your hardwood floors. If you’re building your own home or can do some serious DIY, then hard wiring is a fantastic thing to have. It goes wonderfully hand-in-glove with mesh networks too, since you’ll be able to hook up your nodes to the network for even better speeds. But if I’m honest, advances in Wi-Fi technology mean I’d only go for hard wiring if I really believed I needed the sort of speed it offers. Unless you’re a Twitch streamer running your own 24/7 content studio, it’s probably overkill. When we started renovating our 140-year-old home, I had Ethernet installed in the living room, the master and second bedroom and in my office, all at the front of the house. I can’t use it for my mesh since I’d need to put the wiring through the middle of the house. If I ever had the wiring done again, I would do so as I know I’ll instantly see a meaningful improvement in both my connection speed and reliability. But I wouldn’t spend several thousand pounds to have it done just for the sake of it.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-mesh-wifi-system-130028701.html?src=rss",
          "content": "If your Wi-Fi struggles to reach every corner of your house, it’s probably not your internet plan that’s the problem. A single router can only do so much, especially in larger spaces or homes with thick walls. That’s where the best mesh Wi-Fi system comes in, replacing one overworked router with a Wi-Fi mesh network designed to deliver high-speed coverage across your entire home.A whole home mesh Wi-Fi setup uses multiple nodes that act as shared access points, spreading your connection more evenly and reducing slowdowns as you move from room to room. Compared to basic range extenders, mesh systems handle traffic more intelligently, balance bandwidth between devices and usually offer easy setup through companion apps. Many support dual-band Wi-Fi and newer standards, making them better suited for households full of phones, laptops, TVs and smart home devices.We’ve tested today’s leading mesh systems to see which ones actually deliver consistent speeds and reliable coverage. Whether you’re trying to eliminate dead zones in a small apartment or blanket a large, multi-floor house with fast, stable Wi-Fi, these are the mesh systems worth considering. Best mesh Wi-Fi systems for 2026 What to look for in a mesh Wi-Fi system Linksys’ CEO Jonathan Bettino told Engadget why mesh systems are an “advancement in Wi-Fi technology” over buying a single point router. With one transmitter, the signal can degrade the further away from the router you go, or the local environment isn’t ideal. “You can have a small [home], but there’s thick walls [...] or things in the way that just interfere with your wireless signal,” he said. Historically, the solution to a home’s Wi-Fi dead zone was to buy Wi-Fi range extenders but Bettino said the hardware has both a “terrible user experience” and one of the highest return rates of any consumer electronics product. Mesh Wi-Fi, by comparison, offers “multiple nodes that can be placed anywhere in your home,” says Bettino, each acting as an access point that works together as part of a whole home mesh Wi-Fi system. Rather than having one main router in your home, having a “router in every room” is the biggest selling point for mesh Wi-Fi given how reliant we all are on the internet. Each node is in constant contact with each other, broadcasting a single, seamless network to all of your connected devices. There’s no separate network for the 2.4GHz and 5GHz bands, just a single name that you connect to. It’s a good time to buy a mesh Wi-Fi system since the latest standard, Wi-Fi 6E, represents a big leap in the technology. Matt MacPherson, Cisco's Chief Technology Officer for Wireless, said Wi-Fi 6E is a big “inflection point,” using much more of the wireless spectrum than its predecessors. “If you’re using that spectrum with a Wi-Fi 6 [device],” he said, “you’re going to get significant gains [in speed.]” MacPherson added Wi-Fi 6E will likely “carry you for a long time” thanks to the fact its “top throughputs now typically exceed what people can actually connect their home to.” In short, with a top theoretical per-stream speed of 1.2 Gbps, Wi-Fi 6E is fast enough to outrun all but the fastest internet service. What do all these Wi-Fi numbers and letters mean? I’m sorry folks, we need to get boringly technical for one paragraph, but I promise you it’s worth it. Wi-Fi is governed by International Standard IEEE 802.11, and every few years a letter gets added onto that name when the technology evolves and improves. Until 2019, routers were sold under their IEEE name, leaving users to pick through the word soup of a product labeled 802.11 b/g/a/n/ac and so on. Mercifully, wiser heads opted to rebrand the letters as numbers, so rather than 802.11 b/g/a/n/ac, we have Wi-Fi 1, 2, 3 4 and 5. Right now, we’re in the middle of one of those Wi-Fi generations, with most of the gear on sale right now supporting either Wi-Fi 6 or Wi-Fi 6E. What’s the difference between Wi-Fi 6 and Wi-Fi 6E? Wi-Fi uses chunks of the radio frequency spectrum, with Wi-Fi 6 using the 2.4GHz and 5GHz bands to pump data around. In fact, back in the old days, it was likely your home router would offer you the choice of the 2.4GHz or the 5GHz network, as separate bands to access. These days, all of the spectrums are tied together as one thing, and Wi-Fi 6E has the added ability to use the 6GHz band as well. That’s a big chunk of extra wireless real estate that isn’t as cluttered up as the 2.4 and 5GHz bands. You’re going to talk about wireless frequencies now, aren’t you. Each Wi-Fi band had tradeoffs, because the slower radio frequencies have greater range but less speed. 2.4GHz signals will travel a long way in your home but aren’t quick, while 6GHz is blisteringly fast but can be defeated by a sturdy brick wall. A lot of Wi-Fi-enabled gear you own, like smart home products, only use the 2.4GHz band because the range is better and it’s a lot cheaper. But it means that the band is also overcrowded and slow, making it great for your doorbell and robovac, but lackluster for Twitch streaming. So, what am I looking for? Right now, the market is full of mature Wi-Fi 6 and 6E devices, and most new systems available to buy are capable of taking advantage of the faster speeds they offer. This guide focuses on Wi-Fi 6E gear since it’s what we think it’s more than enough to satisfy almost everyone’s at-home Wi-Fi needs. What about Wi-Fi 7? We’re now seeing the first generation of Wi-Fi 7 devices available to buy, but we don’t recommend you do so immediately. The Wi-Fi 7 standard is still so new that there’s little to no reason for you to rush out and buy one for your home. The hardware is tremendously expensive and while Wi-Fi 7 will, eventually, offer some great benefits over 6E, it’s not as transformative an upgrade as 6E. Not to mention, Wi-Fi 7 is so new that almost none of your home’s devices will be able to take advantage of its big-ticket features. I’d estimate you won’t need to worry about upgrading to Wi-Fi 7 for at least five years, if not longer. Range and speed All Wi-Fi routers boast a theoretical broadcast range and a theoretical top speed, and in some cases external antennas to boost signal directionality — but these figures don’t mean much. After all, manufacturers can’t control your ISP’s real speed, the materials and layout of your home or where you put your Wi-Fi gear. Raw speed isn’t everything, either, and you likely need less peak speed than your provider advertises. What matters more is consistent bandwidth and stable performance throughout your entire home. After all, Netflix needs just 15 Mbps to push a single 4K video stream to your home. As cool as it is to say you’ve got all these hundreds of Mbps, factors like latency and reliability are far more crucial to a happy internet life. And unless you have Gigabit internet that can reach speeds of up to 1 Gbps, you won’t need a mesh router that offers that spec. Backhaul Mesh Wi-Fi systems work by connecting every hardware node to a single wireless network, letting them all communicate with each other. Imagine four people in a busy, noisy restaurant all trying to order their dinner from a weary staff member, all at once. Now imagine, while this is going on, that four more people at that same table are also trying to tell a funny anecdote. It’s no surprise that it might take a long time for the right information to reach its intended destination. To combat this, higher-end mesh routers offer dedicated wireless backhaul, allowing nodes to communicate without eating into the high-speed bandwidth your devices rely on. So rather than everyone talking at once in the same space, the conversations are essentially separated, reducing the invisible clutter in the air. Because there’s less confusing cross-chatter, everything moves faster, offering a significant performance boost to those systems. Connectivity These days, even your washing machine can have a wireless connection, but that doesn’t mean you should ignore the joys of wired internet. No matter how fast Wi-Fi is, a hard line will always be faster, and wired connections can significantly improve Wi-Fi mesh network performance when used for backhaul. Plenty of routers can also use these hard connections as backhaul, eliminating further wireless clutter. It’s convenient for spread-out systems and power users, but it will mean running more wires through your home. The most common standard is Cat 5e, or gigabit ethernet which, unsurprisingly, has a top speed of 1 Gigabit per second (Gbps). Since Ethernet cables are backward compatible, you should be able to easily find one that works with your system. However, to get the most out of your mesh routers, it’s worth investing in an Ethernet cable that meets the standard your router uses — if it’s Cat 5e, use a Cat 5e cable. You can check your router’s specs via the manufacturer’s website to be sure. Flexibility and scalability Mesh routers enable you to add (or subtract) modules from your home network to suit your needs. D-Link’s Alan Jones said users should “check how scalable the prospective product is” before you buy. This sense of scale doesn’t just apply to the number of nodes on the network, but how many simultaneous connections it can handle. It’s also worth looking at ASUS’ AiMesh products, which can combine mesh Wi-Fi gear and its standard “spider” Wi-Fi routers. If you’ve got a tricky part of your home, you can bolt on an ultra-power standalone Wi-Fi router to a compatible mesh. Placement Mesh networks replace one big piece of hardware with a series of identical nodes that you scatter around your home, each acting as a shared access point to maintain coverage throughout the entire home. You connect one to your modem (usually over ethernet), and then scatter the rest around the place for the best coverage. A good rule of thumb is to place each node no more than two rooms away from the last one, rather than sticking them at the far ends of your home. Bear in mind, every physical obstacle between a Wi-Fi node, its siblings and your devices will hurt your overall performance. You should aim to place them, at the very least, at waist height on furniture in open air, without too many obstructions. The reason many mesh Wi-Fi products are designed to look like an inoffensive white doodad is so you don’t feel compelled to hide them behind your TV. Other mesh Wi-Fi router systems we tested Amazon Eero Pro 7 Eero built its reputation on easy to use yet powerful mesh systems that offer a lot of good in a relatively small and affordable package. Setup is effortless, the app running things is clean and simple, and you get the added benefit of backwards compatibility with older hardware. Sadly, the issue with every Eero system is that so many basic management features, like parental controls, are paywalled behind the company’s Eero Plus subscription for $100 a year. Amazon Eero 6E Eero Pro 6E is an “easy” device, the sort a total novice can set up on their own and thrive with for years on end. There’s little brainwork required to get things set up, and the app has a clean UI with plenty of hand-holding. But, as with the Eero Pro 7, the fact that so many basic management tools are paywalled irks me, especially since you can get plenty of them for free with Google’s rival offering. Netgear Orbi 960 The Orbi 96T0 (RBKE963) is Netgear’s flagship mesh Wi-Fi product, which the company calls the “world’s most powerful Wi-Fi 6E system.” It’s also one of the most expensive consumer-level kits on the market, setting you back $1,499.99 for a three pack. It's a fantastic piece of gear, but it's worth saying that the subset of people who could, would or should buy it remains far smaller than you might expect. Ultimately, I feel that if you’re paying luxury prices, you should expect a luxury product. There were plenty of times during testing that I went looking for a feature that was either only available via the web client, or behind a paywall. While, yes, much of your cash is going to the superlative hardware, but for this sort of money, the fact you have to pay extra for some table-stakes features is insulting. If you’re looking for a new Wi-Fi system and aren’t prepared to spend almost $1,500, it’s worth considering our other top picks for the best Wi-Fi routers and mesh systems. How we test Wi-Fi routers My home covers around 2,200 square feet across three stories with the office on the third floor. It’s relatively long and thin, with the living room at the front of the house, the kitchen at the back and the three bedrooms on the first floor. Its age means there are a lot of solid brick walls, old-school lathe and plaster as well as aluminum foil-backed insulation boards to help with energy efficiency. There are two major Wi-Fi dead zones in the house: The bathroom and the third bedroom behind it, since there’s lots of old and new pipework in the walls and floors. For mesh routers with two nodes, I place the first in my living room, connected via ethernet to my cable modem with the second on the first floor landing in the (ostensible) center of the house. For three-node sets, the third goes in my kitchen, which I’ve found is the optimal layout to get the bulk of my house covered in Wi-Fi. Fundamentally, my home poses enough challenges that if it succeeds here, it stands a very good chance of succeeding in your place. Each mesh is judged on ease of setup, Wi-Fi coverage, reliability, speed and any additional features that it advertises. I look at how user-friendly each companion app is from the perspective of a novice rather than an expert given you shouldn’t need to be a network engineer to do this sort of thing. Tests I do include checking for dead zones, moving from room to room to measure consistency of connectivity and streaming multiple videos at once to replicate common usage patterns. Mesh Wi-Fi system FAQs This is the section of our mesh Wi-Fi buyer’s guide where we talk about the stuff that most people just glide past. If you’re not familiar with technology, it can be intimidating if people talk about these things as if you’re expected to already know. So here’s a very simple, very basic rundown of some of the stuff you might have missed in very basic terms. What’s the difference between a Wi-Fi router and a mesh router? A Wi-Fi router is a box that usually sits close to wherever the internet comes into your home and pumps out information over radio waves. A mesh router, meanwhile, is a set of smaller devices, one of which sits next to your internet connection while the rest are scattered around your home. A single Wi-Fi router is great if your home is small, your needs aren’t too demanding, or if your home doesn’t have many radio-blocking obstructions that mean those signals can’t reach every corner of your home. But, much like standing next to a radio transmitter and then walking away from it in a straight line, after a while, the signal will degrade. That’s the problem a mesh system is designed to solve, since it will take the signal from your modem and pump to the other mesh devices, known as nodes, in your home. That way, instead of having one big router in one part of your home, you have several small ones that ensure you have good Wi-Fi connectivity all over. It also helps ensure that there’s no risk of dropping your connection as you move around — a mesh router system makes it easy to, for instance, walk from room to room watching Netflix and know you won’t miss a single frame. What's the difference between a Wi-Fi extender and a mesh system? Oh boy. Wi-Fi extenders, or repeaters, are small devices designed to push Wi-Fi a little further than your Wi-Fi router can stretch. They’re cheap, compact and often come in the form of little boxes that sit on your plug sockets with the hope of pushing Wi-Fi to a signal-sparse corner of your home. They are, and I can’t put this delicately enough, often a big pile of rubbish and are often not worth your time. Especially since the price of mesh routers has fallen to within most people’s budgets. What is a wireless backhaul? As we explained above, mesh Wi-Fi systems work by connecting every hardware node to a single wireless network, letting them all communicate with each other. Imagine four people in a busy, noisy restaurant all trying to order their dinner from a weary staff member, all at once. Now imagine, while this is going on, that four more people at that same table are also trying to tell a funny anecdote. It’s no surprise that it might take a long time for the right information to reach its intended destination. To combat this, higher-end mesh routers offer dedicated wireless backhaul; a slice of the spectrum for node-to-node communication. So rather than everyone talking at once in the same space, the conversations are essentially separated, reducing the invisible clutter in the air. Because there’s less confusing cross-chatter, everything moves faster, offering a significant performance boost to those systems. Is it better to hard wire instead of using a mesh Wi-Fi system? This is a great question that doesn’t have a simple answer. It is (almost) always preferable to connect devices with a wire, in this case Ethernet, than to use Wi-Fi. The speeds are faster, it’s more reliable and your data is less vulnerable to the slings and arrows of the laws of physics. Hell, I spent about a year trying to work out how to build an iPhone to Ethernet connector back in the bad old days of Wi-Fi. But your ability to do so depends on your level of DIY skills and / or how much money you want to spend on contractors. Wiring your home for Ethernet if you don’t have the infrastructure already can be a costly and time-consuming process. Particularly if you don’t want ugly wires running along your baseboards and under your carpets or across your hardwood floors. If you’re building your own home or can do some serious DIY, then hard wiring is a fantastic thing to have. It goes wonderfully hand-in-glove with mesh networks too, since you’ll be able to hook up your nodes to the network for even better speeds. But if I’m honest, advances in Wi-Fi technology mean I’d only go for hard wiring if I really believed I needed the sort of speed it offers. Unless you’re a Twitch streamer running your own 24/7 content studio, it’s probably overkill. When we started renovating our 140-year-old home, I had Ethernet installed in the living room, the master and second bedroom and in my office, all at the front of the house. I can’t use it for my mesh since I’d need to put the wiring through the middle of the house. If I ever had the wiring done again, I would do so as I know I’ll instantly see a meaningful improvement in both my connection speed and reliability. But I wouldn’t spend several thousand pounds to have it done just for the sake of it.This article originally appeared on Engadget at https://www.engadget.com/home/smart-home/best-mesh-wifi-system-130028701.html?src=rss",
          "feed_position": 41
        },
        {
          "source": "VentureBeat",
          "url": "https://venturebeat.com/security/recruitment-fraud-cloud-iam-2-billion-attack-surface",
          "published_at": "Fri, 06 Feb 2026 00:00:00 GMT",
          "title": "How recruitment fraud turned cloud IAM into a $2 billion attack surface",
          "standfirst": "A developer gets a LinkedIn message from a recruiter. The role looks legitimate. The coding assessment requires installing a package. That package exfiltrates all cloud credentials from the developer’s machine — GitHub personal access tokens, AWS API keys, Azure service principals and more — are exfiltrated, and the adversary is inside the cloud environment within minutes.Your email security never saw it. Your dependency scanner might have flagged the package. Nobody was watching what happened next.The attack chain is quickly becoming known as the identity and access management (IAM) pivot, and it represents a fundamental gap in how enterprises monitor identity-based attacks. CrowdStrike Intelligence research published on January 29 documents how adversary groups operationalized this attack chain at an industrial scale. Threat actors are cloaking the delivery of trojanized Python and npm packages through recruitment fraud, then pivoting from stolen developer credentials to full cloud IAM compromise. In one late-2024 case, attackers delivered malicious Python packages to a European FinTech company through recruitment-themed lures, pivoted to cloud IAM configurations and diverted cryptocurrency to adversary-controlled wallets.Entry to exit never touched the corporate email gateway, and there is no digital evidence to go on.On a recent episode of CrowdStrike’s Adversary Universe podcast, Adam Meyers, the company&#x27;s SVP of intelligence and head of counter adversary operations, described the scale: More than $2 billion associated with cryptocurrency operations run by one adversary unit. Decentralized currency, Meyers explained, is ideal because it allows attackers to avoid sanctions and detection simultaneously. CrowdStrike&#x27;s field CTO of the Americas, Cristian Rodriguez, explained that revenue success has driven organizational specialization. What was once a single threat group has split into three distinct units targeting cryptocurrency, fintech and espionage objectives.That case wasn’t isolated. The Cybersecurity and Infrastructure Security Agency (CISA) and security company JFrog have tracked overlapping campaigns across the npm ecosystem, with JFrog identifying 796 compromised packages in a self-replicating worm that spread through infected dependencies. The research further documents WhatsApp messaging as a primary initial compromise vector, with adversaries delivering malicious ZIP files containing trojanized applications through the platform. Corporate email security never intercepts this channel.Most security stacks are optimized for an entry point that these attackers abandoned entirely.When dependency scanning isn’t enoughAdversaries are shifting entry vectors in real-time. Trojanized packages aren’t arriving through typosquatting as in the past — they’re hand-delivered via personal messaging channels and social platforms that corporate email gateways don’t touch. CrowdStrike documented adversaries tailoring employment-themed lures to specific industries and roles, and observed deployments of specialized malware at FinTech firms as recently as June 2025.CISA documented this at scale in September, issuing an advisory on a widespread npm supply chain compromise targeting GitHub personal access tokens and AWS, GCP and Azure API keys. Malicious code was scanned for credentials during package installation and exfiltrated to external domains.Dependency scanning catches the package. That’s the first control, and most organizations have it. Almost none have the second, which is runtime behavioral monitoring that detects credential exfiltration during the install process itself.“When you strip this attack down to its essentials, what stands out isn’t a breakthrough technique,” Shane Barney, CISO at Keeper Security, said in an analysis of a recent cloud attack chain. “It’s how little resistance the environment offered once the attacker obtained legitimate access.”Adversaries are getting better at creating lethal, unmonitored pivotsGoogle Cloud’s Threat Horizons Report found that weak or absent credentials accounted for 47.1% of cloud incidents in the first half of 2025, with misconfigurations adding another 29.4%. Those numbers have held steady across consecutive reporting periods. This is a chronic condition, not an emerging threat. Attackers with valid credentials don’t need to exploit anything. They log in.Research published earlier this month demonstrated exactly how fast this pivot executes. Sysdig documented an attack chain where compromised credentials reached cloud administrator privileges in eight minutes, traversing 19 IAM roles before enumerating Amazon Bedrock AI models and disabling model invocation logging.Eight minutes. No malware. No exploit. Just a valid credential and the absence of IAM behavioral baselines.Ram Varadarajan, CEO at Acalvio, put it bluntly: Breach speed has shifted from days to minutes, and defending against this class of attack demands technology that can reason and respond at the same speed as automated attackers.Identity threat detection and response (ITDR) addresses this gap by monitoring how identities behave inside cloud environments, not just whether they authenticate successfully. KuppingerCole’s 2025 Leadership Compass on ITDR found that the majority of identity breaches now originate from compromised non-human identities, yet enterprise ITDR adoption remains uneven.Morgan Adamski, PwC&#x27;s deputy leader for cyber, data and tech risk, put the stakes in operational terms. Getting identity right, including AI agents, means controlling who can do what at machine speed. Firefighting alerts from everywhere won’t keep up with multicloud sprawl and identity-centric attacks.Why AI gateways don’t stop thisAI gateways excel at validating authentication. They check whether the identity requesting access to a model endpoint or training pipeline holds the right token and has privileges for the timeframe defined by administrators and governance policies. They don’t check whether that identity is behaving consistently with its historical pattern or is randomly probing across infrastructure.Consider a developer who normally queries a code-completion model twice a day, suddenly enumerating every Bedrock model in the account, disabling logging first. An AI gateway sees a valid token. ITDR sees an anomaly.A blog post from CrowdStrike underscores why this matters now. The adversary groups it tracks have evolved from opportunistic credential theft into cloud-conscious intrusion operators. They are pivoting from compromised developer workstations directly into cloud IAM configurations, the same configurations that govern AI infrastructure access. The shared tooling across distinct units and specialized malware for cloud environments indicate this isn’t experimental. It’s industrialized.Google Cloud’s office of the CISO addressed this directly in their December 2025 cybersecurity forecast, noting that boards now ask about business resilience against machine-speed attacks. Managing both human and non-human identities is essential to mitigating risks from non-deterministic systems. No air gap separates compute IAM from AI infrastructure. When a developer’s cloud identity is hijacked, the attacker can reach model weights, training data, inference endpoints and whatever tools those models connect to through protocols like model context protocol (MCP).That MCP connection is no longer theoretical. OpenClaw, an open-source autonomous AI agent that crossed 180,000 GitHub stars in a single week, connects to email, messaging platforms, calendars and code execution environments through MCP and direct integrations. Developers are installing it on corporate machines without a security review.Cisco’s AI security research team called the tool “groundbreaking” from a capability standpoint and “an absolute nightmare” from a security one, reflecting exactly the kind of agentic infrastructure a hijacked cloud identity could reach.The IAM implications are direct. In an analysis published February 4, CrowdStrike CTO Elia Zaitsev warned that \"a successful prompt injection against an AI agent isn&#x27;t just a data leak vector. It&#x27;s a potential foothold for automated lateral movement, where the compromised agent continues executing attacker objectives across infrastructure.\" The agent&#x27;s legitimate access to APIs, databases and business systems becomes the adversary&#x27;s access. This attack chain doesn&#x27;t end at the model endpoint. If an agentic tool sits behind it, the blast radius extends to everything the agent can reach. Where the control gaps areThis attack chain maps to three stages, each with a distinct control gap and a specific action.Entry: Trojanized packages delivered through WhatsApp, LinkedIn and other non-email channels bypass email security entirely. CrowdStrike documented employment-themed lures tailored to specific industries, with WhatsApp as a primary delivery mechanism. The gap: Dependency scanning catches the package, but not the runtime credential exfiltration. Suggested action: Deploy runtime behavioral monitoring on developer workstations that flags credential access patterns during package installation.Pivot: Stolen credentials enable IAM role assumption invisible to perimeter-based security. In CrowdStrike&#x27;s documented European FinTech case, attackers moved from a compromised developer environment directly to cloud IAM configurations and associated resources. The gap: No behavioral baselines exist for cloud identity usage. Suggested action: Deploy ITDR that monitors identity behavior across cloud environments, flagging lateral movement patterns like the 19-role traversal documented in the Sysdig research.Objective: AI infrastructure trusts the authenticated identity without evaluating behavioral consistency. The gap: AI gateways validate tokens but not usage patterns. Suggested action: Implement AI-specific access controls that correlate model access requests with identity behavioral profiles, and enforce logging that the accessing identity cannot disable.Jason Soroko, senior fellow at Sectigo, identified the root cause: Look past the novelty of AI assistance, and the mundane error is what enabled it. Valid credentials are exposed in public S3 buckets. A stubborn refusal to master security fundamentals.What to validate in the next 30 daysAudit your IAM monitoring stack against this three-stage chain. If you have dependency scanning but no runtime behavioral monitoring, you can catch the malicious package but miss the credential theft. If you authenticate cloud identities but don&#x27;t baseline their behavior, you won&#x27;t see the lateral movement. If your AI gateway checks tokens but not usage patterns, a hijacked credential walks straight to your models.The perimeter isn&#x27;t where this fight happens anymore. Identity is.",
          "content": "A developer gets a LinkedIn message from a recruiter. The role looks legitimate. The coding assessment requires installing a package. That package exfiltrates all cloud credentials from the developer’s machine — GitHub personal access tokens, AWS API keys, Azure service principals and more — are exfiltrated, and the adversary is inside the cloud environment within minutes.Your email security never saw it. Your dependency scanner might have flagged the package. Nobody was watching what happened next.The attack chain is quickly becoming known as the identity and access management (IAM) pivot, and it represents a fundamental gap in how enterprises monitor identity-based attacks. CrowdStrike Intelligence research published on January 29 documents how adversary groups operationalized this attack chain at an industrial scale. Threat actors are cloaking the delivery of trojanized Python and npm packages through recruitment fraud, then pivoting from stolen developer credentials to full cloud IAM compromise. In one late-2024 case, attackers delivered malicious Python packages to a European FinTech company through recruitment-themed lures, pivoted to cloud IAM configurations and diverted cryptocurrency to adversary-controlled wallets.Entry to exit never touched the corporate email gateway, and there is no digital evidence to go on.On a recent episode of CrowdStrike’s Adversary Universe podcast, Adam Meyers, the company&#x27;s SVP of intelligence and head of counter adversary operations, described the scale: More than $2 billion associated with cryptocurrency operations run by one adversary unit. Decentralized currency, Meyers explained, is ideal because it allows attackers to avoid sanctions and detection simultaneously. CrowdStrike&#x27;s field CTO of the Americas, Cristian Rodriguez, explained that revenue success has driven organizational specialization. What was once a single threat group has split into three distinct units targeting cryptocurrency, fintech and espionage objectives.That case wasn’t isolated. The Cybersecurity and Infrastructure Security Agency (CISA) and security company JFrog have tracked overlapping campaigns across the npm ecosystem, with JFrog identifying 796 compromised packages in a self-replicating worm that spread through infected dependencies. The research further documents WhatsApp messaging as a primary initial compromise vector, with adversaries delivering malicious ZIP files containing trojanized applications through the platform. Corporate email security never intercepts this channel.Most security stacks are optimized for an entry point that these attackers abandoned entirely.When dependency scanning isn’t enoughAdversaries are shifting entry vectors in real-time. Trojanized packages aren’t arriving through typosquatting as in the past — they’re hand-delivered via personal messaging channels and social platforms that corporate email gateways don’t touch. CrowdStrike documented adversaries tailoring employment-themed lures to specific industries and roles, and observed deployments of specialized malware at FinTech firms as recently as June 2025.CISA documented this at scale in September, issuing an advisory on a widespread npm supply chain compromise targeting GitHub personal access tokens and AWS, GCP and Azure API keys. Malicious code was scanned for credentials during package installation and exfiltrated to external domains.Dependency scanning catches the package. That’s the first control, and most organizations have it. Almost none have the second, which is runtime behavioral monitoring that detects credential exfiltration during the install process itself.“When you strip this attack down to its essentials, what stands out isn’t a breakthrough technique,” Shane Barney, CISO at Keeper Security, said in an analysis of a recent cloud attack chain. “It’s how little resistance the environment offered once the attacker obtained legitimate access.”Adversaries are getting better at creating lethal, unmonitored pivotsGoogle Cloud’s Threat Horizons Report found that weak or absent credentials accounted for 47.1% of cloud incidents in the first half of 2025, with misconfigurations adding another 29.4%. Those numbers have held steady across consecutive reporting periods. This is a chronic condition, not an emerging threat. Attackers with valid credentials don’t need to exploit anything. They log in.Research published earlier this month demonstrated exactly how fast this pivot executes. Sysdig documented an attack chain where compromised credentials reached cloud administrator privileges in eight minutes, traversing 19 IAM roles before enumerating Amazon Bedrock AI models and disabling model invocation logging.Eight minutes. No malware. No exploit. Just a valid credential and the absence of IAM behavioral baselines.Ram Varadarajan, CEO at Acalvio, put it bluntly: Breach speed has shifted from days to minutes, and defending against this class of attack demands technology that can reason and respond at the same speed as automated attackers.Identity threat detection and response (ITDR) addresses this gap by monitoring how identities behave inside cloud environments, not just whether they authenticate successfully. KuppingerCole’s 2025 Leadership Compass on ITDR found that the majority of identity breaches now originate from compromised non-human identities, yet enterprise ITDR adoption remains uneven.Morgan Adamski, PwC&#x27;s deputy leader for cyber, data and tech risk, put the stakes in operational terms. Getting identity right, including AI agents, means controlling who can do what at machine speed. Firefighting alerts from everywhere won’t keep up with multicloud sprawl and identity-centric attacks.Why AI gateways don’t stop thisAI gateways excel at validating authentication. They check whether the identity requesting access to a model endpoint or training pipeline holds the right token and has privileges for the timeframe defined by administrators and governance policies. They don’t check whether that identity is behaving consistently with its historical pattern or is randomly probing across infrastructure.Consider a developer who normally queries a code-completion model twice a day, suddenly enumerating every Bedrock model in the account, disabling logging first. An AI gateway sees a valid token. ITDR sees an anomaly.A blog post from CrowdStrike underscores why this matters now. The adversary groups it tracks have evolved from opportunistic credential theft into cloud-conscious intrusion operators. They are pivoting from compromised developer workstations directly into cloud IAM configurations, the same configurations that govern AI infrastructure access. The shared tooling across distinct units and specialized malware for cloud environments indicate this isn’t experimental. It’s industrialized.Google Cloud’s office of the CISO addressed this directly in their December 2025 cybersecurity forecast, noting that boards now ask about business resilience against machine-speed attacks. Managing both human and non-human identities is essential to mitigating risks from non-deterministic systems. No air gap separates compute IAM from AI infrastructure. When a developer’s cloud identity is hijacked, the attacker can reach model weights, training data, inference endpoints and whatever tools those models connect to through protocols like model context protocol (MCP).That MCP connection is no longer theoretical. OpenClaw, an open-source autonomous AI agent that crossed 180,000 GitHub stars in a single week, connects to email, messaging platforms, calendars and code execution environments through MCP and direct integrations. Developers are installing it on corporate machines without a security review.Cisco’s AI security research team called the tool “groundbreaking” from a capability standpoint and “an absolute nightmare” from a security one, reflecting exactly the kind of agentic infrastructure a hijacked cloud identity could reach.The IAM implications are direct. In an analysis published February 4, CrowdStrike CTO Elia Zaitsev warned that \"a successful prompt injection against an AI agent isn&#x27;t just a data leak vector. It&#x27;s a potential foothold for automated lateral movement, where the compromised agent continues executing attacker objectives across infrastructure.\" The agent&#x27;s legitimate access to APIs, databases and business systems becomes the adversary&#x27;s access. This attack chain doesn&#x27;t end at the model endpoint. If an agentic tool sits behind it, the blast radius extends to everything the agent can reach. Where the control gaps areThis attack chain maps to three stages, each with a distinct control gap and a specific action.Entry: Trojanized packages delivered through WhatsApp, LinkedIn and other non-email channels bypass email security entirely. CrowdStrike documented employment-themed lures tailored to specific industries, with WhatsApp as a primary delivery mechanism. The gap: Dependency scanning catches the package, but not the runtime credential exfiltration. Suggested action: Deploy runtime behavioral monitoring on developer workstations that flags credential access patterns during package installation.Pivot: Stolen credentials enable IAM role assumption invisible to perimeter-based security. In CrowdStrike&#x27;s documented European FinTech case, attackers moved from a compromised developer environment directly to cloud IAM configurations and associated resources. The gap: No behavioral baselines exist for cloud identity usage. Suggested action: Deploy ITDR that monitors identity behavior across cloud environments, flagging lateral movement patterns like the 19-role traversal documented in the Sysdig research.Objective: AI infrastructure trusts the authenticated identity without evaluating behavioral consistency. The gap: AI gateways validate tokens but not usage patterns. Suggested action: Implement AI-specific access controls that correlate model access requests with identity behavioral profiles, and enforce logging that the accessing identity cannot disable.Jason Soroko, senior fellow at Sectigo, identified the root cause: Look past the novelty of AI assistance, and the mundane error is what enabled it. Valid credentials are exposed in public S3 buckets. A stubborn refusal to master security fundamentals.What to validate in the next 30 daysAudit your IAM monitoring stack against this three-stage chain. If you have dependency scanning but no runtime behavioral monitoring, you can catch the malicious package but miss the credential theft. If you authenticate cloud identities but don&#x27;t baseline their behavior, you won&#x27;t see the lateral movement. If your AI gateway checks tokens but not usage patterns, a hijacked credential walks straight to your models.The perimeter isn&#x27;t where this fight happens anymore. Identity is.",
          "feed_position": 1,
          "image_url": "https://images.ctfassets.net/jdtwqhzvc2n1/5o3Aq9Roo3iMxYwdJddaKq/4cf88e3821a6d2979e30d5934df14a22/hero.jpg?w=300&q=30"
        }
      ],
      "featured_image": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-09/acf51d20-9296-11f0-9146-7e82dd205a74",
      "popularity_score": 2009.6202475
    },
    {
      "id": "cluster_48",
      "coverage": 2,
      "updated_at": "Sat, 07 Feb 2026 00:55:03 -0500",
      "title": "Source: Benchmark raised $225M in special funds to invest in Cerebras' ~$1B Series H, led by Tiger Global; Benchmark led Cerebras' $27M Series A in 2016 (Marina Temkin/TechCrunch)",
      "neutral_headline": "Benchmark raises $225M in special funds to double down on Cerebras",
      "bullet_summary": [
        "Reported by TechMeme, TechCrunch"
      ],
      "items": [
        {
          "source": "TechMeme",
          "url": "http://www.techmeme.com/260207/p2#a260207p2",
          "published_at": "Sat, 07 Feb 2026 00:55:03 -0500",
          "title": "Source: Benchmark raised $225M in special funds to invest in Cerebras' ~$1B Series H, led by Tiger Global; Benchmark led Cerebras' $27M Series A in 2016 (Marina Temkin/TechCrunch)",
          "standfirst": "Marina Temkin / TechCrunch: Source: Benchmark raised $225M in special funds to invest in Cerebras' ~$1B Series H, led by Tiger Global; Benchmark led Cerebras' $27M Series A in 2016 &mdash; This week, AI chipmaker Cerebras Systems announced that it raised $1 billion in fresh capital at a valuation of $23 billion &hellip;",
          "content": "Marina Temkin / TechCrunch: Source: Benchmark raised $225M in special funds to invest in Cerebras' ~$1B Series H, led by Tiger Global; Benchmark led Cerebras' $27M Series A in 2016 &mdash; This week, AI chipmaker Cerebras Systems announced that it raised $1 billion in fresh capital at a valuation of $23 billion &hellip;",
          "feed_position": 10,
          "image_url": "http://www.techmeme.com/260207/i2.jpg"
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/06/benchmark-raises-225m-in-special-funds-to-double-down-on-cerebras/",
          "published_at": "Sat, 07 Feb 2026 05:23:04 +0000",
          "title": "Benchmark raises $225M in special funds to double down on Cerebras",
          "standfirst": "Benchmark Capital has been an investor in the Nvidia rival since 2016.",
          "content": "Benchmark Capital has been an investor in the Nvidia rival since 2016.",
          "feed_position": 2
        }
      ],
      "featured_image": "http://www.techmeme.com/260207/i2.jpg",
      "popularity_score": 2002.5377475
    },
    {
      "id": "cluster_100",
      "coverage": 2,
      "updated_at": "Fri, 06 Feb 2026 16:45:59 +0000",
      "title": "Spotify now lets you swipe on songs to learn more about them",
      "neutral_headline": "Spotify now lets you swipe on songs to learn more about them",
      "bullet_summary": [
        "Reported by Engadget, TechCrunch"
      ],
      "items": [
        {
          "source": "Engadget",
          "url": "https://www.engadget.com/audio/spotify-now-lets-you-swipe-on-songs-to-learn-more-about-them-164558366.html",
          "published_at": "Fri, 06 Feb 2026 16:45:59 +0000",
          "title": "Spotify now lets you swipe on songs to learn more about them",
          "standfirst": "Spotify is rolling out a feature called About the Song which lets fans learn a bit more about their favorite tunes. This \"brings stories and context\" into the listening experience, sort of like that old VH1 show Pop Up Video. How does it work? The Now Playing View houses short, swipeable story cards that \"explore the meaning\" behind the music. This information is sourced from third parties and the company promises \"interesting details and behind-the-scenes moments.\" All you have to do is scroll down until you see the card and then swipe. This is rolling out right now to Premium users on both iOS and Android, but it's not everywhere just yet. The beta tool is currently available in the US, UK, Canada, Ireland, New Zealand and Australia. Spotify has been busy lately, as this is just the latest new feature. The platform recently introduced a group messaging feature and prompt-based playlists.This article originally appeared on Engadget at https://www.engadget.com/audio/spotify-now-lets-you-swipe-on-songs-to-learn-more-about-them-164558366.html?src=rss",
          "content": "Spotify is rolling out a feature called About the Song which lets fans learn a bit more about their favorite tunes. This \"brings stories and context\" into the listening experience, sort of like that old VH1 show Pop Up Video. How does it work? The Now Playing View houses short, swipeable story cards that \"explore the meaning\" behind the music. This information is sourced from third parties and the company promises \"interesting details and behind-the-scenes moments.\" All you have to do is scroll down until you see the card and then swipe. This is rolling out right now to Premium users on both iOS and Android, but it's not everywhere just yet. The beta tool is currently available in the US, UK, Canada, Ireland, New Zealand and Australia. Spotify has been busy lately, as this is just the latest new feature. The platform recently introduced a group messaging feature and prompt-based playlists.This article originally appeared on Engadget at https://www.engadget.com/audio/spotify-now-lets-you-swipe-on-songs-to-learn-more-about-them-164558366.html?src=rss",
          "feed_position": 20
        },
        {
          "source": "TechCrunch",
          "url": "https://techcrunch.com/2026/02/06/spotifys-new-feature-lets-you-explore-the-story-behind-the-song-youre-listening-to/",
          "published_at": "Fri, 06 Feb 2026 14:48:52 +0000",
          "title": "Spotify&#8217;s new feature lets you explore the story behind the song you&#8217;re listening to",
          "standfirst": "The short, swipeable stories in the About the Song feature are summarized from third-party sources to highlight interesting details and behind-the-scenes moments.",
          "content": "The short, swipeable stories in the About the Song feature are summarized from third-party sources to highlight interesting details and behind-the-scenes moments.",
          "feed_position": 18
        }
      ],
      "popularity_score": 2000
    },
    {
      "id": "cluster_33",
      "coverage": 1,
      "updated_at": "Sat, 07 Feb 2026 12:00:35 +0000",
      "title": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
      "neutral_headline": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/under-trump-epas-enforcement-of-environmental-laws-collapses-report-finds/",
          "published_at": "Sat, 07 Feb 2026 12:00:35 +0000",
          "title": "Under Trump, EPA’s enforcement of environmental laws collapses, report finds",
          "standfirst": "The Environmental Protection Agency has drastically pulled back on holding polluters accountable.",
          "content": "Enforcement against polluters in the United States plunged in the first year of President Donald Trump’s second term, a far bigger drop than in the same period of his first term, according to a new report from a watchdog group. By analyzing a range of federal court and administrative data, the nonprofit Environmental Integrity Project found that civil lawsuits filed by the US Department of Justice in cases referred by the Environmental Protection Agency dropped to just 16 in the first 12 months after Trump’s inauguration on Jan. 20, 2025. That is 76 percent less than in the first year of the Biden administration. Trump’s first administration filed 86 such cases in its first year, which was in turn a drop from the Obama administration’s 127 four years earlier.Read full article Comments",
          "feed_position": 0,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531111-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2258531111-1152x648.jpg",
      "popularity_score": 341.6299697222222
    },
    {
      "id": "cluster_63",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 23:40:58 +0000",
      "title": "Sixteen Claude AI agents working together created a new C compiler",
      "neutral_headline": "Sixteen Claude AI agents working together created a new C compiler",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/ai/2026/02/sixteen-claude-ai-agents-working-together-created-a-new-c-compiler/",
          "published_at": "Fri, 06 Feb 2026 23:40:58 +0000",
          "title": "Sixteen Claude AI agents working together created a new C compiler",
          "standfirst": "The $20,000 experiment compiled a Linux kernel but needed deep human management.",
          "content": "Amid a push toward AI agents, with both Anthropic and OpenAI shipping multi-agent tools this week, Anthropic is more than ready to show off some of its more daring AI coding experiments. But as usual with claims of AI-related achievement, you'll find some key caveats ahead. On Thursday, Anthropic researcher Nicholas Carlini published a blog post describing how he set 16 instances of the company's Claude Opus 4.6 AI model loose on a shared codebase with minimal supervision, tasking them with building a C compiler from scratch. Over two weeks and nearly 2,000 Claude Code sessions costing about $20,000 in API fees, the AI model agents reportedly produced a 100,000-line Rust-based compiler capable of building a bootable Linux 6.9 kernel on x86, ARM, and RISC-V architectures.Read full article Comments",
          "feed_position": 1,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/coding_robots_agents-1152x648.jpg",
      "popularity_score": 338
    },
    {
      "id": "cluster_68",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 22:43:12 +0000",
      "title": "Lawyer sets new standard for abuse of AI; judge tosses case",
      "neutral_headline": "Lawyer sets new standard for abuse of AI; judge tosses case",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/randomly-quoting-ray-bradbury-did-not-save-lawyer-from-losing-case-over-ai-errors/",
          "published_at": "Fri, 06 Feb 2026 22:43:12 +0000",
          "title": "Lawyer sets new standard for abuse of AI; judge tosses case",
          "standfirst": "Behold the most overwrought AI legal filings you will ever gaze upon.",
          "content": "Frustrated by fake citations and flowery prose packed with \"out-of-left-field\" references to ancient libraries and Ray Bradbury’s Fahrenheit 451, a New York federal judge took the rare step of terminating a case this week due to a lawyer's repeated misuse of AI when drafting filings. In an order on Thursday, district judge Katherine Polk Failla ruled that the extraordinary sanctions were warranted after an attorney, Steven Feldman, kept responding to requests to correct his filings with documents containing fake citations. One of those filings was \"noteworthy,\" Failla said, \"for its conspicuously florid prose.\" Where some of Feldman's filings contained grammatical errors and run-on sentences, this filing seemed glaringly different stylistically.Read full article Comments",
          "feed_position": 3,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2252952774-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2252952774-1152x648.jpg",
      "popularity_score": 318
    },
    {
      "id": "cluster_64",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 23:08:42 +0000",
      "title": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
      "neutral_headline": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/health/2026/02/penisgate-erupts-at-olympics-scandal-exposes-risks-of-bulking-your-budge/",
          "published_at": "Fri, 06 Feb 2026 23:08:42 +0000",
          "title": "Penisgate erupts at Olympics; scandal exposes risks of bulking your bulge",
          "standfirst": "Claims of penis injections in ski jumpers has fillers spewing into the news.",
          "content": "As the 2026 Olympic Winter Games begin today, news articles are swelling with juicy claims that male ski jumpers have injected their penises with fillers to gain a flight advantage. As the rumor goes, having a bigger bulge on a required 3D body scan taken in the pre-season could earn jumpers extra centimeters of material in their jumpsuits—and a suit's larger nether regions provide more surface area to glide to the gold. Even a small increase can make a satisfying difference in this sport. A 2025 simulation-based study published in the journal Frontiers in Sports and Active Living suggested that every 2 cm of extra fabric in a ski jumpsuit could increase drag by about 4 percent and increase lift by about 5 percent. On a jump, that extra 2 cm of fabric amounts to an extra 5.8 meters, the simulations found. Elite ski jumpers are aware of the advantage and have already crotch-rocketed to scandal with related schemes. Last year, two Norwegian Olympic medalists, Marius Lindvik and Johann Andre Forfang, and three of their team officials were charged with cheating after an anonymous video showed the head coach and suit technician illegally restitching the crotch area of the two jumpers' suits to make them larger. The jumpers received a three-month suspension, while the head coach, an assistant coach, and the technician faced a harsher 18-month ban.Read full article Comments",
          "feed_position": 2,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260132839-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2260132839-1152x648.jpg",
      "popularity_score": 313
    },
    {
      "id": "cluster_69",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 22:16:51 +0000",
      "title": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
      "neutral_headline": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/security/2026/02/malicious-packages-for-dydx-cryptocurrency-exchange-empties-user-wallets/",
          "published_at": "Fri, 06 Feb 2026 22:16:51 +0000",
          "title": "Malicious packages for dYdX cryptocurrency exchange empties user wallets",
          "standfirst": "Incident is at least the third time the exchange has been targeted by thieves.",
          "content": "Open source packages published on the npm and PyPI repositories were laced with code that stole wallet credentials from dYdX developers and backend systems and, in some cases, backdoored devices, researchers said. “Every application using the compromised npm versions is at risk ….” the researchers, from security firm Socket, said Friday. “Direct impact includes complete wallet compromise and irreversible cryptocurrency theft. The attack scope includes all applications depending on the compromised versions and both developers testing with real credentials and production end-users.\" Packages that were infected were:Read full article Comments",
          "feed_position": 4,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cryptocurrency-theft-heist-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/cryptocurrency-theft-heist-1152x648.jpg",
      "popularity_score": 301
    },
    {
      "id": "cluster_72",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 21:53:05 +0000",
      "title": "Why $700 could be a \"death sentence\" for the Steam Machine",
      "neutral_headline": "Why $700 could be a \"death sentence\" for the Steam Machine",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/gaming/2026/02/why-a-bump-to-700-could-be-a-death-sentence-for-the-steam-machine/",
          "published_at": "Fri, 06 Feb 2026 21:53:05 +0000",
          "title": "Why $700 could be a \"death sentence\" for the Steam Machine",
          "standfirst": "Analysts expect Valve might be hit particularly hard by soaring RAM, storage prices.",
          "content": "After writing two November stories analyzing price expectations for Valve's upcoming Steam Machine, I really didn't think we'd be offering more informed speculation before the official price was revealed. Then Valve wrote a blog post this week noting that the \"growing price of... critical components\" like RAM and storage meant that \"we must revisit our exact shipping schedule and pricing\" for the living room-focused PC gaming box. We don't know exactly what form that \"revisiting\" will take at the moment. Analysts who spoke to Ars were somewhat divided on how much of its quickly increasing component costs Valve would be willing (or forced) to pass on to consumers. \"We knew the component issue was bad,\" DFC Intelligence analyst David Cole told Ars. \"It has just gotten worse. \"Read full article Comments",
          "feed_position": 5,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2227105271-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2227105271-1152x648.jpg",
      "popularity_score": 283
    },
    {
      "id": "cluster_77",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 21:05:45 +0000",
      "title": "COVID-19 cleared the skies but also supercharged methane emissions",
      "neutral_headline": "COVID-19 cleared the skies but also supercharged methane emissions",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/covid-19-cleared-the-skies-but-also-supercharged-methane-emissions/",
          "published_at": "Fri, 06 Feb 2026 21:05:45 +0000",
          "title": "COVID-19 cleared the skies but also supercharged methane emissions",
          "standfirst": "Less pollution meant lower amounts of a methane-destroying chemical.",
          "content": "In the spring of 2020, as the COVID-19 pandemic brought global industry and travel nearly to a halt, satellite sensors recorded a dramatic plunge in nitrogen dioxide, a byproduct of internal combustion engines and heavy industry. For a moment, the world’s air was cleaner than it had been in decades. But then something strange started happening: methane, the second most important anthropogenic greenhouse gas after carbon dioxide, was surging. Its growth rate hit 16.2 parts per billion that year, the highest since systematic records began in the early 1980s. A new study published in the journal Science looked at the complex chemistry of the troposphere (the lowest region of the atmosphere) and found that the two changes are likely connected. An atmospheric cleaner Since the late 1960s, we knew that atmospheric methane doesn’t just vanish. It is actively scrubbed from the sky by the hydroxyl radical, a highly reactive molecule that breaks down methane, turning it into water vapor and carbon dioxide. “The problem is that the lifetime of the hydroxyl radical is very short—its lifespan is less than a second\" says Shushi Peng, a professor at Peking University, China, and a co-author of the study. To do its job as an atmospheric methane clearing agent, a hydroxyl radical must be constantly replenished through a series of chemical reactions triggered by sunlight. The key ingredients in these reactions are nitrogen oxides, the very pollutants that were drastically reduced when cars stayed in garages and factories went dark in 2020.Read full article Comments",
          "feed_position": 6,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-614277290-1024x648.jpg",
      "popularity_score": 273
    },
    {
      "id": "cluster_79",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 20:44:35 +0000",
      "title": "Waymo leverages Genie 3 to create a world model for self-driving cars",
      "neutral_headline": "Waymo leverages Genie 3 to create a world model for self-driving cars",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/google/2026/02/waymo-leverages-genie-3-to-create-a-world-model-for-self-driving-cars/",
          "published_at": "Fri, 06 Feb 2026 20:44:35 +0000",
          "title": "Waymo leverages Genie 3 to create a world model for self-driving cars",
          "standfirst": "With Genie 3, Waymo wants to explore rare and even impossible driving conditions.",
          "content": "Google-spinoff Waymo is in the midst of expanding its self-driving car fleet into new regions. Waymo touts more than 200 million miles of driving that informs how the vehicles navigate roads, but the company's AI has also driven billions of miles virtually, and there's a lot more to come with the new Waymo World Model. Based on Google DeepMind's Genie 3, Waymo says the model can create \"hyper-realistic\" simulated environments that train the AI on situations that are rarely (or never) encountered in real life—like snow on the Golden Gate Bridge. Until recently, the autonomous driving industry relied entirely on training data collected from real cars and real situations. That means rare, potentially dangerous events are not well represented in training data. The Waymo World Model aims to address that by allowing engineers to create simulations with simple prompts and driving inputs. Google revealed Genie 3 last year, positioning it as a significant upgrade over other world models by virtue of its long-horizon memory. In Google's world model, you can wander away from a given object, and when you look back, the model will still \"remember\" how that object is supposed to look. In earlier attempts at world models, the simulation would lose that context almost immediately. With Genie 3, the model can remember details for several minutes.Read full article Comments",
          "feed_position": 7,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Waymo-IO-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/Waymo-IO-1152x648.jpg",
      "popularity_score": 269
    },
    {
      "id": "cluster_97",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 17:37:18 +0000",
      "title": "Driven: The 2026 Lamborghini Temerario raises the bar for supercars",
      "neutral_headline": "Driven: The 2026 Lamborghini Temerario raises the bar for supercars",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/02/driven-the-2026-lamborghini-temerario-raises-the-bar-for-supercars/",
          "published_at": "Fri, 06 Feb 2026 17:37:18 +0000",
          "title": "Driven: The 2026 Lamborghini Temerario raises the bar for supercars",
          "standfirst": "This V8 hybrid with more than 900 hp replaces the V10 Huracán.",
          "content": "While mainstream vehicles usually get comprehensive updates every few years, low-volume exotics tend evolve more gradually. Supercar platforms often remain unchanged for a decade or more, with manufacturers instead focusing on what can be tuned, massaged, added, or subtracted to keep their lineups fresh. Every once in a while, though, a performance car debuts that truly earns the label “all-new,” and the Lamborghini Temerario is one of them. As the replacement for the Huracán, Lamborghini’s bestselling sports car to date, the Temerario has big shoes to fill. At first glance, it might seem like a more subdued affair than its predecessor, but the Huracán debuted in a similar fashion before wilder iterations like the STO and Sterrato were introduced to the lineup. During a technical briefing late last year, Lamborghini sales chief Frederick Foschini noted that the Temerario’s streamlined look is intentional. The team sought to increase downforce by more than 100 percent compared with the Huracán Evo through the car's core design, rather than relying on big wings, splitters, and other racy aerodynamic bits. Designers were also tasked with creating an all-new car that was distinctive yet instantly recognizable as a Lamborghini. Judging by the number of heads this car turned during my time with it, I’d say the company was successful.Read full article Comments",
          "feed_position": 9,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/10-2026-Lamborghini-Temerario-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/10-2026-Lamborghini-Temerario-1152x648.jpg",
      "popularity_score": 258
    },
    {
      "id": "cluster_88",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 19:31:09 +0000",
      "title": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
      "neutral_headline": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/to-reuse-or-not-reuse-the-eternal-debate-of-new-glenns-second-stage-reignites/",
          "published_at": "Fri, 06 Feb 2026 19:31:09 +0000",
          "title": "To reuse or not reuse—the eternal debate of New Glenn's second stage reignites",
          "standfirst": "A new job posting suggests the debate may be swinging back toward reusing GS2.",
          "content": "Engineers at Blue Origin have been grappling with a seemingly eternal debate that involves the New Glenn rocket and the economics of flying it. The debate goes back at least 15 years, to the early discussions around the design of the heavy lift rocket. The first stage, of course, would be fully reusable. But what about the upper stage of New Glenn, powered by two large BE-3U engines? Around the same time, in the early 2010s, SpaceX was also trading the economics of reusing the second stage of its Falcon 9 rocket. Eventually SpaceX founder Elon Musk abandoned his goal of a fully reusable Falcon 9, choosing instead to recover payload fairings and push down manufacturing costs of the upper stage as much as possible. This strategy worked, as SpaceX has lowered its internal launch costs of a Falcon 9, even with a new second stage, to about $15 million. The company is now focused on making the larger Starship rocket fully reusable.Read full article Comments",
          "feed_position": 8,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/new-glenn_gs2-hotfire-1152x648.webp"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/new-glenn_gs2-hotfire-1152x648.webp",
      "popularity_score": 253
    },
    {
      "id": "cluster_105",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 16:17:45 +0000",
      "title": "New critique debunks claim that trees can sense a solar eclipse",
      "neutral_headline": "New critique debunks claim that trees can sense a solar eclipse",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/science/2026/02/new-critique-debunks-claim-that-trees-can-sense-a-solar-eclipse/",
          "published_at": "Fri, 06 Feb 2026 16:17:45 +0000",
          "title": "New critique debunks claim that trees can sense a solar eclipse",
          "standfirst": "Controversial 2025 study \"represents the encroachment of pseudoscience into the heart of biological research.\"",
          "content": "Last year, a team of scientists presented evidence that spruce trees in Italy's Dolomite mountains synchronized their bioelectrical activity in anticipation of a partial solar eclipse—a potentially exciting new insight into the complexities of plant communication. The findings naturally generated media interest and even inspired a documentary. But the claims drew sharp criticism from other researchers in the field, with some questioning whether the paper should even have been published. Those initial misgivings are outlined in more detail in a new critique published in the journal Trends in Plant Science. For the original paper, Alessandro Chiolerio, a physicist at the Italian Institute of Technology, collaborated with plant ecologist Monica Gagliano of Southern Cross University and several others conducting field work in the Costa Bocche forest in the Dolomites. They essentially created an EKG for trees, attaching electrodes to three spruce trees (ranging in age from 20 to 70 years) and five tree stumps in the forest. Those sensors recorded a marked increase in bioelectrical activity during a partial solar eclipse on October 22, 2022. The activity peaked mid-eclipse and faded away in its aftermath. Chiolerio et al. interpreted this spike in activity as a coordinated response among the trees to the darkened conditions brought on by the eclipse. And older trees' electrical activity spiked earlier and more strongly than the younger trees, which Chiolerio et al. felt was suggestive of trees developing response mechanisms—a kind of memory captured in associated gravitational effects. Older trees might even transmit this knowledge to younger trees, the authors suggested, based on the detection of bioelectrical waves traveling between the trees.Read full article Comments",
          "feed_position": 10,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/dolomite4-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/dolomite4-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_128",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 11:30:17 +0000",
      "title": "Why Darren Aronofsky thought an AI-generated historical docudrama was a good idea",
      "neutral_headline": "Why Darren Aronofsky thought an AI-generated historical docudrama was a good idea",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/features/2026/02/why-darren-aronofsky-thought-an-ai-generated-historical-docudrama-was-a-good-idea/",
          "published_at": "Fri, 06 Feb 2026 11:30:17 +0000",
          "title": "Why Darren Aronofsky thought an AI-generated historical docudrama was a good idea",
          "standfirst": "Production source says it takes \"weeks\" to produce just minutes of usable video.",
          "content": "Last week, filmmaker Darren Aronofsky's AI studio Primordial Soup and Time magazine released the first two episodes of On This Day... 1776. The year-long series of short-form videos features short vignettes describing what happened on that day of the American Revolution 250 years ago, but it does so using “a variety of AI tools” to produce photorealistic scenes containing avatars of historical figures like George Washington, Thomas Paine, and Benjamin Franklin. In announcing the series, Time Studios President Ben Bitonti said the project provides \"a glimpse at what thoughtful, creative, artist-led use of AI can look like—not replacing craft but expanding what’s possible and allowing storytellers to go places they simply couldn’t before.\" The trailer for \"On This Day... 1776.\" Outside critics were decidedly less excited about the effort. The AV Club took the introductory episodes to task for \"repetitive camera movements [and] waxen characters\" that make for \"an ugly look at American history.\" CNET said that this \"AI slop is ruining American history,\" calling the videos a \"hellish broth of machine-driven AI slop and bad human choices.\" The Guardian lamented that the \"once-lauded director of Black Swan and The Wrestler has drowned himself in AI slop,\" calling the series \"embarrassing,\" \"terrible,\" and \"ugly as sin.\" I could go on.Read full article Comments",
          "feed_position": 16,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/pitchfork-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/pitchfork-1152x648.jpg",
      "popularity_score": 148
    },
    {
      "id": "cluster_124",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 12:00:50 +0000",
      "title": "Rocket Report: SpaceX probes upper stage malfunction; Starship testing resumes",
      "neutral_headline": "Rocket Report: SpaceX probes upper stage malfunction; Starship testing resumes",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/rocket-report-spacex-probes-upper-stage-malfunction-starship-testing-resumes/",
          "published_at": "Fri, 06 Feb 2026 12:00:50 +0000",
          "title": "Rocket Report: SpaceX probes upper stage malfunction; Starship testing resumes",
          "standfirst": "Amazon has booked 10 more launches with SpaceX, citing a \"near-term shortage in launch capacity.\"",
          "content": "Welcome to Edition 8.28 of the Rocket Report! The big news in rocketry this week was that NASA still hasn't solved the problem with hydrogen leaks on the Space Launch System. The problem caused months of delays before the first SLS launch in 2022, and the fuel leaks cropped up again Monday during a fueling test on NASA's second SLS rocket. It is a continuing problem, and NASA's sparse SLS launch rate makes every countdown an experiment, as my colleague Eric Berger wrote this week. NASA will conduct another fueling test in the coming weeks after troubleshooting the rocket's leaky fueling line, but the launch of the Artemis II mission is off until March. As always, we welcome reader submissions. If you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar. Blue Origin \"pauses\" New Shepard flights. Blue Origin has \"paused\" its New Shepard program for the next two years, a move that likely signals a permanent end to the suborbital space tourism initiative, Ars reports. The small rocket and capsule have been flying since April 2015 and have combined to make 38 launches, all but one of which were successful, and 36 landings. In its existence, the New Shepard program flew 98 people to space, however briefly, and launched more than 200 scientific and research payloads into the microgravity environment.Read full article Comments",
          "feed_position": 15,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/HAGSSN-X0AAwd5a-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/HAGSSN-X0AAwd5a-1152x648.jpg",
      "popularity_score": 146
    },
    {
      "id": "cluster_109",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 15:36:56 +0000",
      "title": "Lawmakers ask what it would take to \"store\" the International Space Station",
      "neutral_headline": "Lawmakers ask what it would take to \"store\" the International Space Station",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/congress-advances-bill-requiring-nasa-to-reconsider-deorbiting-space-station/",
          "published_at": "Fri, 06 Feb 2026 15:36:56 +0000",
          "title": "Lawmakers ask what it would take to \"store\" the International Space Station",
          "standfirst": "NASA shall evaluate the \"viability of transferring the ISS to a safe orbital harbor\" after retirement.",
          "content": "Members of the House Science, Space, and Technology Committee voted to approve a NASA authorization bill this week, advancing legislation chock full of policy guidelines meant to give lawmakers a voice in the space agency's strategic direction. The committee met to \"mark up\" the NASA Reauthorization Act of 2026, adding more than 40 amendments to the bill before a unanimous vote to refer the legislation to the full House of Representatives. Wednesday's committee vote was just one of several steps needed for the bill to become law. It must pass a vote on the House floor, win approval from the Senate, and then go to the White House for President Donald Trump's signature. Ars has reported on one of the amendments, which would authorize NASA to take steps toward a \"commercial\" deep space program using privately owned rockets and spacecraft rather than vehicles owned by the government.Read full article Comments",
          "feed_position": 12,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/37912693655_bd7fa9fd18_o-1152x648-1770317087.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/37912693655_bd7fa9fd18_o-1152x648-1770317087.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_111",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 14:55:22 +0000",
      "title": "NASA stage show explores \"outer\" outer space with Henson's Fraggles",
      "neutral_headline": "NASA stage show explores \"outer\" outer space with Henson's Fraggles",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/space/2026/02/nasa-stage-show-explores-outer-outer-space-with-hensons-fraggles/",
          "published_at": "Fri, 06 Feb 2026 14:55:22 +0000",
          "title": "NASA stage show explores \"outer\" outer space with Henson's Fraggles",
          "standfirst": "\"Our two worlds that on paper wouldn't seem connected, made a lot of sense to connect.\"",
          "content": "Move over Snoopy, because NASA has a new character helping to promote its deep space exploration plans. His name is Uncle Traveling Matt. No really, move over. Fraggle Rock: A Space-y Adventure has taken over the same theater the Kennedy Space Center Visitor Complex in Florida previously used for All Systems Are Go, featuring the comic strip beagle. The new stage show stars the Jim Henson Company's subterranean Muppets as they discover outer (outer) space for the first time.Read full article Comments",
          "feed_position": 13,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/news-020426a-lg-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/news-020426a-lg-1152x648.jpg",
      "popularity_score": 141
    },
    {
      "id": "cluster_107",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 15:59:47 +0000",
      "title": "Stellantis swallows $26 billion costs as it rethinks its EV strategy",
      "neutral_headline": "Stellantis swallows $26 billion costs as it rethinks its EV strategy",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/cars/2026/02/stellantis-swallows-26-billion-costs-as-it-rethinks-its-ev-strategy/",
          "published_at": "Fri, 06 Feb 2026 15:59:47 +0000",
          "title": "Stellantis swallows $26 billion costs as it rethinks its EV strategy",
          "standfirst": "The automaker follows Ford and GM in writing down huge sums after betting wrong.",
          "content": "The automotive industry's big bet on a rapid adoption of electric vehicles—at least here in the United States—continues to unwind. Today, Stellantis, which owns brands like Jeep and Dodge, as well as Fiat, Peugeot, and others, announced that it has \"reset\" its business to adapt to reality, which comes with a rather painful $26.2 billion (22.2 billion euro) write-down. It wasn't that long ago that everyone was more bullish on electrification. Even the US had relatively ambitious plans to boost EV adoption into the next decade, including a big commitment to charging infrastructure. Ten new battery factories were announced, and the future looked bright. Not everyone agreed. Some automakers, having been left behind by the push toward battery EVs and away from simple hybrids that offered little in the way of true decarbonization, lobbied hard to relax fuel efficiency standards. Car dealers, uncomfortable with the prospect of investing in and learning about new technology, did so, too. When the Republican Party won the 2024 election, the revanchists got their wish.Read full article Comments",
          "feed_position": 11,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2210397222-1152x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2210397222-1152x648.jpg",
      "popularity_score": 139
    },
    {
      "id": "cluster_112",
      "coverage": 1,
      "updated_at": "Fri, 06 Feb 2026 14:31:12 +0000",
      "title": "EU says TikTok needs to drop \"addictive design\"",
      "neutral_headline": "EU says TikTok needs to drop \"addictive design\"",
      "bullet_summary": [
        "Reported by Ars Technica"
      ],
      "items": [
        {
          "source": "Ars Technica",
          "url": "https://arstechnica.com/tech-policy/2026/02/eu-says-tiktok-needs-to-drop-addictive-design/",
          "published_at": "Fri, 06 Feb 2026 14:31:12 +0000",
          "title": "EU says TikTok needs to drop \"addictive design\"",
          "standfirst": "Regulators say design choices that hook users could breach EU's digital rules.",
          "content": "Brussels has warned TikTok that its endlessly scrolling feeds may breach Europe’s new content rules, as regulators press ahead with efforts to rein in the social effects of big online platforms. In preliminary findings issued on Friday, the European Commission said it believed the group had failed to adequately assess and mitigate the risks posed by addictive design features that could harm users’ physical and mental wellbeing, particularly children and other vulnerable groups. The warning marks one of the most advanced tests yet of the EU’s Digital Services Act, which requires large online platforms to identify and curb systemic risks linked to their products.Read full article Comments",
          "feed_position": 14,
          "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/10/GettyImages-1243334115-1024x648.jpg"
        }
      ],
      "featured_image": "https://cdn.arstechnica.net/wp-content/uploads/2022/10/GettyImages-1243334115-1024x648.jpg",
      "popularity_score": 130
    }
  ]
}